{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              25
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Embedding",
          "config": {
            "activity_regularizer": null,
            "batch_input_shape": [
              null,
              25
            ],
            "dtype": "float32",
            "embeddings_constraint": null,
            "embeddings_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "maxval": 0.05,
                "minval": -0.05,
                "seed": null
              }
            },
            "embeddings_regularizer": null,
            "input_dim": 28,
            "input_length": 25,
            "mask_zero": false,
            "name": "embedding_1",
            "output_dim": 32,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "embedding_1"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "batch_input_shape": [
              null,
              25,
              16
            ],
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 5
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 3
                },
                "kernel_regularizer": null,
                "name": "lstm_4",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 4
                },
                "recurrent_regularizer": null,
                "return_sequences": true,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 16,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "embedding_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_4"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 11
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 9
                },
                "kernel_regularizer": null,
                "name": "lstm_5",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 10
                },
                "recurrent_regularizer": null,
                "return_sequences": false,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 16,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_5"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 4,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        }
      ],
      "name": "student",
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.5.0"
  },
  "hash": "cbbb6dbf44e6e67f2bf2f58e12a66cf2691ba12f17b078f0499a0eea5dbf44c2",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      25
    ]
  ],
  "output_shapes": [
    [
      4
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            25
          ],
          "values": [
            "AAAAQAAAIEEAAIA/AABAQAAAsEEAAMBAAABwQQAAEEEAAJhBAAAwQQAAsEEAAJhBAACIQQAAMEEAAIBBAADgQAAA2EEAAAAAAACAQQAAyEEAABBBAADYQQAAuEEAAABBAADIQQ=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            4
          ],
          "values": [
            "unoAPgDVSj2QzRw/xplZPg=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "bidirectional_4": {
      "backward_bias": [
        "Awq5v5AUQD6bzkU+tCLJve9Vfj9quXq/YvktP+R82D/7LBK/zvknPt1I0T9dnkc/E5MSPzcjzTr+eV4+gd7Avml5SD+h0RM/X4SGPmRPqT+ZUsQ/8+YiQG+byT/o11Y/JrDRP784qT87D2K/41fbP772A0ACQEM/jcj6PtzxpT7UIDI+u0n2Ps4OD79p2q68v6Ofvy70Tz9LdW0+ZfylvywAFb4yY988pl4+P+whrD3piTO/DCfAPkvrsD4xo5Q+30jMPPsFKbzaH8c/qZ2YP8FW0D0yrg0/uCGWPp+bg7/r0ro+qWL5PvbgrT1La7y++QlvPoid4D6DZDg/XUehPw=="
      ],
      "backward_recurrent_weights": [
        "UTCfv+CxjL9VBfw/VTWav3Z/kb8GZIbAaOwVQFMohD/8u9g/hHvVPhuZsz/vV6w/KsM+v/JHMsDk0yJAc+HuPqI02L9tPcC+O1jIPeSdBsCEL6I/Wj/3Pt+k3z7DVki/xNRpPaV6JL8TDaM+LHe6voRYQ7+Pl1bA23Mqv0MmFMAllfQ+jY4LPVC8KL9Jdpw80OVzPahaej8Nyk+/42q1Psf/hT9fOrG/e+rKvZ+ODj8Rmmg+pN+GP4yOlL4pzhi/t0uqvmiA6L8lG6W/Z3eMP+KO/j8hCkA/hxi4v+RNWT3iUFa/FLi4Pm2Gij4GyS7ATzopP4NeBb69NIU+B+0iwEq2OT8V9BdA5lkqQE0FgkCTu5JA0w49QIyYib8Aocy8sXJqPnqvmD8QHOA+nrvTvpV7n78AhY2/RzlHQDioNUDF4Jw+YLOUv1/cAECpXAtApSLJv/RgHkAkEZBAaj6DP0oza7+0XgFAIV6sP5FPj7/xGeO/1PYZwOTrXr/QjRVACdGcPxc3Gr9b4BW/9VIeP7VHkr8DzhZAkofNvyjXrD85jbS/nyXJvfspzj66H30/Mx8yP0F9MD/NE0o/oUUOPFm5E0CDIJg/pNVvQE1Y7D/ljNI/3aUoQG7zLD9OtEg/CYDBv8I5/j/Nlo4/Bzv9PsH5Fz9Fr9o+I5tnP590mz5d2t2+z2neP48aCUDEPpw/G2ehPiNJkz/dPJq+KHwbQHS0nz8fXIo/D/VuvwFu9r6xQBm/9FRkP8JJlL9/KyY/HRxtvqLPAL9kOwg+bKcTP8TNKL/dCiE/MDagP4EgdT/ymNM/Yl5CwJOIyz4nDjA/+H9QPzCH1D8WG/U/Vzmiv/+O2L+yUy8+RouhP5mlLr8npFk/tjCwPeBC7D50Pz6+23WXv7DIZT/NCBM/V5j3vvuSPj9z39Y8UFl/P+yTMj4ncQBAzU9Rvpts+L8Uk7S++rJJQDz2475Tt4+++59pPSeggL/zQ6Q8D+RiP9XEAT/EC44/ejbsvsFG9TyYAz0/",
        "fW2Lv76Eyj5HGt+/N51EQEm+oT/ZcNO/sc0dP3juJT6stBg/DKPfv4z7G79wugXA9FfmvaOzOL8uS5G/H2jBPyiY2L+M4bc+XFDIPyJ8bD8ZTLa/vUGVvyWuRb81iAzAwCF7P/uU1r+AlYO/6UIdv0+VBsAGOyS+j/u9vxnB4T7N6Ny+e1ouvgv1r7xhXaM/mY9gP0uTlz9GkGc8++mtvs5z0L8Pix0/kJvEvY3xv79YkXO/KWKSv+YXCEB0CYK9aeG5PyCGdD/e6VE/s/h0v1t2Jj8CIQ++rJhMv7NC6j752uS/QN39vnv4Zr7t9YS/KEOYPFmnCb6+uls+mR4/P5pS7r8EHLU+oBTBv8vzO8A6Ehy/LrtDP4Rauj9cdfe9cCvAv3Z2pj3GzEk+ASV+P3HqFL7ty1tAHFpYwHOmFT7YR1q/OZEFP6RJjD+T2+a/Xdi4vqh1rz7amJc+YEWuvwXRPD/9WZu/CuvuvzG9zD8cCeO/8t2MP+Ey9D42ces9rUgfPzh3HT//CX29rtmEvqaKoT8cieO/qsiivjt2VD97UAM/kKOSP6CePz95RrE9eNgUvQxjZb8nLoW+/FyvPl5CCr0hXRpAgShbv/IUsr4vJhk/xEXoPk5nIUC1swm/9OkjQI6oxL97aD49vW8Hv0b9hT8hwpu+07Lsv9+npT831nq/Ln1gv08uPj/u2gi/pantvuvzHr85DYk/nSY3wI8ySD+eUK8/27uKwAIPPMBwgnPALQpGPom3hL8GtWq/Zx57vdExJL0KztU/sGaoPg/Vyj8S09+/HIx8PCRX9j4tN+6/YiX9Pxj5cb89yjW/jSuZv9s0xL44o0jAw5dzP2/GWr+/kVa+dYsHP9YweD+jK6o/YPnPP/PRgb/7ZRC+jDt/PiahDL+fGkm+4soUv32zP79KRPG+ac+OPyE3N72assy9DrOlv/xHmD/jR/W+Tkp3QCQ8qr84stM/AcmFPtZG3r7G2W3Ao+DQPGslxb9cN4k/PO0eP8bH7b81f9c/",
        "AElsPwh0BUC6oYu/Rm+dv9/5Ur0cmLk8xQYevxXa/D5uNFu/XTjAPjmBh0B9n50/jMZGvyqwFEC636s/NNRCvrDKAUAk4l4+6t1cvzXozL9PBiZAVP0+QKJbvr6wq+C9zHA2QOwW3j/BFz+/vMj0vBGq4r8ABsY/5Wddvng+Jj81tLg+PebGvhSdHb8LVeM+lpPBP6WXa71s0AO9na34PlVhnr96gZy+i+muvuxivD48aWk/qdTLvmLmKD7alKq9f3vcP9EMz7500Ra/5VrFPR7/TUBJXnc/FBxaPvXxuD5BS+E/jsntv+SfOj+9R3s+YhVDvwrpTj4j+IC/If9LQF6imb/iQk5AxV7wvyCGV7/quztAmGJDQKoUqT+fM+w/BSY3v8pFrL5yibk/30gAQOhd4j0vcJc/c5yWvxlOkz8dbJc/0Wr0PsRrtrxhqZE/c62DPQu7lz9K1gO+ZU7WP8MTX70NJyi+9Er8Pr22ID+dWEBAj/IdQLerrz1NCsU/FWJ9P161ir52SIq/mr0NvxZeBcBSpF3A6RuMPmZ45D+FTcM/sMz2PrPNir+Oo34+NApjPtnKzj8Ef6S/3elOv+54AMDiRpY/2uDCPw9D+z+BhPm+dumYPlWdiT9Enu0/WxMBQOJmLL8cAnY+xfihP1xFEMDVr9W/5DpsP+S3XT8w7OC/6QLOPay1X79tDJ0/iuJQQAbVej8DCBG/c/NoQDiXuz6MzhrA5qCzPjbC8j4Jcm0++7nMP2ci1L9+DkI+hYLUv1SGFz45Prw+yAULQOyyub+FD4A+DH6nvgUDGD5xrsW+qzB7P8vXkL+/B/M+hSU1v/13ED2pveW9ZpcAwHV9MD7e7L+9NZHovtJMqT6LLxDAX7hrvv4ea75UNrS/etP7P5gS0D4IvaE9ACCkPsWEs77mkhG/eWMxv333Yz608i2/4CWVP3Apmj9i1hZA9a03PR4Klj6gD+k/RjouwHyBjD9BBCO/kVXSvxUW4b+CAba+9lbZPzZvy77bagZA",
        "S2lePw6sfr5a9HA/cY9RQMCDxT3BTChAUgHVPpIERz5YVLK+KBXyP+2ZUL506Ue/LkIHvymln7/cZya+kIxOvwZQr7/0sQhA1avAvcIeNL89wje+jGjdP4tZGD/5AV8/fsYawAPX4j4r024/nbqfP2EHxD4J/c6/vpcMPrTbtr5wsw6+7X9hvtkZSr+9fSm/UYWsvvrV8j0x614/AB6Pvnz9Rr/8UC6/Nva6v/wNFb0Ox2y+BAUVvvrQ+L7eMYu+mYyIvzzWtz9237s/FjT+vH/6CT6rZc4/d/qAv5F0DUBQLYG/9bPEPtRbCz8DroG89USWP0WY+j7tTww/rlGgPxRAQ75/78s/5L8nPg49dcAvtA7AiNX9vuMok792OXC/qjzWvSNlw74ekB/AKfDYvVe8wr8SyE1APNU+QGld/D/9ij2/l+McQHBU978LUIm/wmlrP6x7AcAscRBANfsJv8aPKcAFpN49mWgkP2HDDcDEhDG/9OgbQNH52z9lS38/dBB5PuabID4OKsy+WwWCPwseCL9x9jE/r7aVP/h9wj4yadu/hgJRvy41Zj8tNFk/EPxlv5rXoL+sl2E/CZbevgZJwj/v6ow/SsJyv/sSRMDLrJc/5jIoP2bBDUALMq8/7eSEv/7fD0A+2j5A8CwhwPL1rb9pbrW+bO9ov8OdhT9lhQLACvZcwFRojL6emW+/dbl3v5/gFD/5hQ4/IWyzP0dMwr8A8+Y/+n7Xv6Tnsz/b3Xm+yGbsPtkGNj/6Re0/8CjiP3oJJ0BbVxg/aFLiPaGsBUD1kWc/xylyPsmDHr7Gmu8+Dc9uvrMrCsB4CSK+N1q+PhMu9788+50/DI55P4EQIj+WS789WA/xvMPHE76RDw6/kZ91P5IuxL/CJFM+yON6P2j1ib8bZt8/cUpgvxq7Dz+2CxdAu+HFvkTZLz/NcOC+9QtPv2IiKj95x6w/w+HRP4lb5D/xqKw/+SiOv8r2uT4RVSY+NiOnPi3xtL5a+bI/3gwePq6EHr+o/2A/",
        "2KdgwOhxC8Bwcwc/4tXpv85orDyWT6m/iELOv+bHKsDHjL0+16LYP+F6zb8N8WJAJ1xtv+d/jr8f1uU+xMA3v2Zkyz7DD4C/UYGAPyq7Jz9u902+6e2LvqlUGMABnzW/V0dAQIpovL5Qiak/AxlFPj1SCD8J0vk/XoNPPiKHA0BeeuS/U48HP+NcGb/RbYk+8BalvimYpz8drlI+nT6Nv8ZpoT+T7eY/Utf1PO/Jaz/WmhE/HINOv7PEjj/3sEy+vta2v97b8L8mpZM/QGRyv4w9173HHCvASXY1QAn9n75zB6k/4J5fPwGyvL4Xt5+/4xfqP7hrRL+HgY8/sweTv8LDMsDxiMQ+fTk8QLG67T+TZDq/qDDOv4cQt76Zqfy+oZppP+1hGsDZRPw/H7wiPXT/eT/dsvY/UhGiPmBwMT+GZZ8+9+sMP0k+LUATMeg/94YDQHsOcj8GJv6/myx/v1Bjdz+JxdG/4oDwv80HQ0CbZCW/jLIQu6wI+D0dtgtA56jSvsyQiT4j2zY/M8drPxGIAkC8Rom/v/8Jvocdlz6aQpo/4tQ7P/Ym5T4UqA6+8Rn9vdBggz9MOJS/M7Gavby4or4gb4A/Et6rvx8H6D8CRl8+qbF1v5XKhj/uW2g/SdEdvzoahz/Pfqw9wwiCvwAzrr5LXcY/ezsFQB+/uL9Pgz7A9vxfP8q3I8D+PAbAfVHuv9wLnz/uPCXAzsONv97Qob+l7wc/kTH7P5JADr+1Tu+/YSE9Pihjwb+ooyFArbbGvoVzsz58TwC+yMaRv/LWqr9rr80/OrAHv8XtDEB2EQK/Nd1uQF1/hb/H04k/adfjv48pEMBsEqI8uJ3SPzmFmL5ia0c//kyQPpjgxD/aU4C/8Fefv170E78XDF8/2YAlvlbNOz9J7La/BxsHwOLg6j2C04E+Dp2vP3YiVj9FGUQ/fCIQwMoUmz9RCYI/BCmTP27Na766xge/w7fVvUFikL+9eeo/D37vvyHhIsBf+ME+Yy42v+05HEB1TRlA",
        "Lei7P4GuwT+Zt4E+bbmDv7Po2b6wCwzAwcOEvfGMGD6N5cM/jY7Bv5rK479BKmE+ivmfP/qRIsBljXNA1ysRP3wmuT9T7qA/KAnjv9Sii70KWCI/BcTIP6qjrr7s4rk/J0UMvmJwBD/4kG2/9TNpP2+FOz+F1Ms/LLpaP6zP2D+17Ey+ZvvyvQHhGcB6et0+8zkFPs916D+Fwoy/sxiTvWvRX7+BuzS//VjYP9wwrj8o14a/PSgov8C7Dr/VcCK/iRKGP6XKvD9OIL0/j65zvyI6rL21cTFAJ2d4v7/5QkDxXRvA2ACqPyc+ML9E+oc/AHO4PyF2LT/Dq2S/MNnPPw=="
      ],
      "backward_weights": [
        "TnLYvu7NUr4YQCq+O4TTPqFus742Sq2+e3ZePZ19Ij9nSw8/xxvVvvk4O766ufc9Ae1vP6caMj9bwfC+R6GdPtwW071Jqiy/YapZuhusID4HZtu+ekygPiRE9z5tzrK+cpwvvbEAMD84WIW/F33nPq/fhz4byzDAz6PrPc6t0T7Cr6C+k7mPP9j7OL+kMa0+pwgjwEiUqD6N/X2+uNdPPNLxLz/mC2M9TYdUPdeRyL0wVEw+C0pXPq2Jr749zLFA0Ad3v/smfD/vB4i+KWDoPl+Hz74HBkc+3bJCPlE7l7+K8DC/chrRv6jkaz/rPFU+CFuqvmKWmr8Tfp6/oDp2PkGWzj8jtuy9HjsgPgRFJD7fps++IUgXvxsXmT+11JA+eXILvv0tuj9YfAm+JnKLP3JJMj7fGOA+F2uAvH9GPT489F4/XLNdPyxXJL//ZQo/+9WBv3UIfr9mN3c/TGQCv6IjXL/x1+w+mznJP7/CUr+2BFu9IYqyPeKEQj6kaQU/Yo1hvtgmMj/m5GW/HtUfvbf7pb9tbeW+XQUwvncSxb75zoO+2a0dPmEpu712WDW+xhMNP7pWnz3HA6k+4OBPv4YZqj5PgeQ/AAu+Pnbj8j3AF4c/0C5IP5f4kLvvbHg+rEOJv11BCz/d9Kk+vOcLv0/RQj/JON89OxgyP3qRIz2dOEG/Jfe7PXoNpbyhnoO+NCj3Pq1OAT9b5gU/dtktv9+qDL4yGQq+BcanvjUNaj0h0fy++qKJv036lz5VTc48lQVlv8jksT6ouNQ+eUJavsG9JL+3Rvm+mg0vPwuMMD+fsF+/D6ElP/JITb66S2g/rNQJwGd1ij8u88c9laYxvjkZbr4Zl86/dDIwPtRbDD1ok1A/pZDSPvrw1z741AxA8mQmv5akm76AZTG/qNAKP9ZVBj2/vG49LfK+vVNSdMCShyY/NdDlPsChsL1qZCM+pdbYviHDkb/b0kK9orqqP/d3c766nCM/ciM4vpi/oz8Vx0K9fpsfP5ZOkr4SuRa/",
        "2iR1vbjHBT+i9U09euxxvpbHRj7aJh0/PNAUv9bllz4YSj2/m/heP2C8pT6+jVs/tGWRvvgJGT8WlIy/1DpOPE/vAj3PEVm+s08Sv2Kxuz4NQF69tM8uvjEmtj93I3a+aSH3v72Yd79Ka2G/D8NsvgO7IkB2oxY/QvqqvmNLnT37frc9Pf7/P652Kz5JoJM+2vAqwNEQeTyZ1N290qc8vyA1Q76A4ky+h+8mvmdBBr8RheQ+PF60PnDiar6lupo/o5q2vkJM3z6W+Ay/D+GovoCbDb6Q9fw+J/NSPpBPOcA3cr28rONIvSoc9T2tvxy+WcCOvStKFD/jugfA1cHCvuLDpb6glR4+Y9Q6PkD6Hj/nRNW+STEGvuqmGT/4UkQ+eAvGPkUeNb4DR0A/ybuNProXxT6VobY/10CZP4VitD7yxOy/opyQve6Wgz0FEVi/eqYTvhuKmj5yPRu/gOS+PkoLnD8CB4k/+Dl8v3imV76uXVu/Ljlov/G9nr8I+QO/2qGjPT1HBsBlecU/ulNzv2ajfz8taiw+c2+8vnPsbz6JT4i+1E36Pqlu7L27rW2+Fs3VPuAVfL8IJgW/QWSpv4akLj/2ogG/mPOxvqwvLL+z3nk/8HNDv8CAoT785xm+CdzQviIq87m4xAe9o2t4PqOfRj+ayuG+97pvvyHHyD2zaQ8/LpMUPl/GxL3O95A+dS8ivmGW9D0fMfk+KnNOPy81iDrINLw+kLi7Pd1B3DwvsSO+a6QhP0uVLz87ekW+lKuqP2vA5r7iMU2/iFUZQP7Z9z4uqQO/6xEiwCbNG74I2WC/48xLv2osw75kObO/7gvbvPgBfD5TX6287m3MvO1KRT6hId6/66ezPtSGxb4D91Q/pc7Nvh9zbT6bzcG+B8BTvkmkTL4vWso+csUAv2gifT5NMxA/LUWPPqsFi7/iDIA/WzjXv8/fJz+xS24+rVp8PqiS572SF6i9eEfTPgDd2LvlnD4/Hi/evjrepzwt2cQ+x/XlPWiwMT8E1vi+",
        "ThYVu0eBPT0ws2m+XuyCvXmWLD7ZTfg+IQHEvvQVeb56UjC+alY1vX5w5L0GHn2+XQHFvvT72750/Ik+JmsivpK2KcCeeoG9GlgnPuyXOb5tZ33A5rA6vl4mMr8saA9ANRxaP2yOE7yP2hpAo60BP2boPD+BxMk+ZpeUP8ZpTr/E10a9lM1av6PL0z7GoAu/lgtyvtNLbruBuhm/+2YPvnXZoryLUT+9eOuHPiE/4T78DeE+UwJvvv3jJr7vBXQ+dZutv/31kr7qDno+N8sovsbZUL/7Tvg9bnOXvrU2Er2qmfg//l8AvsM8Lj+Vmik/euLuPjfk7LwaepU+tcL9vTlZAT8iGSw90lqEvYL8qr7FiJm9BwIcvvsFDr5ycyS/OB6dvaJRlr6WjLU+ZD5+vktzmb6n2U++w/c9vzUvBb13YQI/GCMbvcy8uz8DoG2+6ZnYPj2I2D1UzsQ/aPnTPIDOkD8pge++awb6P1deg75BcC0/+d8YPjgukz53D58+NyKNP1mzJkAcSza9MB3rPwo8h7+DQ+c+oydRPjgJhz5VQzY/3WwHPiZPUr+5d2w+rR+2vt1FE74+dI+9eBRpP6QyPr9cK/U+ADYovqRYR78Y3i4/O3dPvpleLL8+7LA+3T7cPpzHEj+f2jk/0hWXvoLXDr5OgZc/WXYJvW0p1j78GKM/s79Kvd5fjj6rJp6+SZUePVvg7D4HnoK+M6esPYfx2L5tD64+pMddvq16CL1XTlG/Gru5v+CEB78vHAu+5MI5P+7Vt7wfooy+sziEPw8bzr0+mFi/bukDP56Xjb5qX2m/x0Sov9uyyD/N7go+/49KP5emWz/cGaw/l0L9Puer7b1w+o5AJ0eDvxQ/gT4DsoO/pvdjPKrg4j6x6ge/UJX/vnPIjb6PLp0+C/fDPZldqb+2Eck/40GUPmITCECcARa/H4yRPxUC7z4VJlU/L//pvtSnp76a/JE+YrWIPb/HIb++iBY+236FPj+Fjj6R7Co+10asPkkjnz+tWxY/",
        "IwbcvXnIX7yOARq/V7stvFIbYj2k9Rq/2UyXP52FBj+uYWM/CAGUv9mOprtwHBs/xdaXPUD0lz9MoUI+bC+FPiApLz+Yrgw/FyRyPzTEAL/wzAA+VEsdPyeURz5Tzzs/cUUuP2E/ST8Q0MM/FhSiPyQw1L6oVCs+FDpfv/wae72TpN28a3OhPakhi76nVie90bOXPzfXXr+3JRi+OwKGPwoGDj5N6ia+n/qDvitQHj+fK2Q/qYmUvjiPgj9/qmG/7za+PxeS6T2tBnc/+XYWv4uzKT/O5og+W4PvvsGvwD/m5uO+hysoQN3rTb4S5Bq/uthRP4vwCj5zkgU/MPqwPDyUNT5lGQm9QBLSvl3ygT42daa+8gF+PjBjmT89UzS+k3C8PXoFcb3d2aM+mfbnPtq9OL7jNzU88URnPqei0T7PrIC+tVbyvsiWnL8HeNU+hzMtPiaIDr0bj7y+e03XPQTp1z6J0J6/fHUCv+hMcL+kjOC/sW5TvNW+BD2vfBLAtdhxvEMrIb+u47S+raPsvSXpZkBGFlE8cJCMPmaGID4zVdA+63qvvnGSDr40/IC+zkIYvnHv/D5i7Z0+eVtjvo3UNUBM8rQ/axPoPT+z7z1Euli+vM6yPsX1PT+PT+A/Yz+ovJHdGz/M8jO+UAAovodour8bW9U9yvhNPnjTl76DFSM+mdkTPQUUBT82fgu/0XplPK1/R78k694968SSPj+f3L6CJLw+uSy2v1sT+70zygg/69PHPqB/e78rqAU/d+tyP+cBBT4KQCo/b5OcvlkmVb9C9pi9w4U2PvSKRz8NQfc+eX6fP7Z9FL9XvRfAreohwJ5e07/UEfY+k3l/P4Opv76gbEm/MY6Av/PZar9UD2o/uC4Bv6tDab6q3BE/b630vX43Vj4k7sO9ShSjvuTwpT7GB9A+tdHAPuKwir8Gzty/w4CgPzgg/r3E+GS/2+vLvtROYz+zuOG+mQeZP/wzaL+2VaC9V9L9PlIMcr4Pthe+8O5CPtzSrT6bZxS+",
        "becavvSpg7toFpu+BzH1PngY476pI968wbHUPljwbz5oZUC+a12FP30ImT+Qtx8/dFzeukuU5D6E2pq+Di3yPIGRTD/mODy/c7zFvlqOnT9LWqM/kqk5P6fwyb/jWky/isXXvSFmz76uPCm/wX8RQBZKgL8V/m0/boSrPq/y774VskE91AZPwOP5OT6NAci8Xq2oPV6ctj7InC8/kBUZvqStAD+0jEi+jdQKvee+3L6tU44+4KecPgNGUD+vqS6/QZQBQOLzxT6wPai9ZKZtPp4/yr0H24Q+549yvjYMcz6HQSY/csq0Pp3/TL+hHgk+jl/HPMaMfr6MHqk+iH63v8/ufD9PwoI9af2bPdQEGT5eWkE+1RmQvkzYdD9UBkY+Yk6bPm3lPT8C0bo9KiSuPsBlBr1LJZK+IokIP9z+JT4RwSBAFaYUP0z7Bj4TUKo+IffcP/Qh2j3QZW2/8Vexv2ECjzx/ytS/jrURPzdzsr6WUMc/Sq5mvtAV9r7zVus+0cslP2DIDDvrrgI/0CsKPkF0377zFUO//TukPRLNkb8cR06+HL2BPQDBPTxR63u/2W3zvhn42D1qB389wMTQvDBaxD4zJrq/c1v+vndccD4mmqY+RzR0v2DTvb75pCG+yyu+vtTEWz8raNi+1B7mPQf7KT6jP789ATWzvE4jgb68THo+jOmrvA1DHb9GDb09Hc63vKH4zj5EPoa+rHwjPV6iwT0bLEe+0xmsveCt471Thua+wepxP7tHOT2Sg8G+gymLvwkNgL1fgBq9dUt5Ptu3+79PegO+L3gXvxeQDD+iYb6+ZPDZvpWLuD8lmBY/bW41QAT1Jj/qjHI/Png6v2OKHD2VvhK/ab4BP48d0b40DVS++HpCPWzV474z1Ya/LYr5PdrMTD1XuKA/TG6qPurjlT6hss6901zwvbo5uD5qsJe/Y0BTvtQ9UD8sEpi9Yp62vheBQj7M550+H/03PMJKxz+97kg/9RtLPwp10T7bpPE+zgqQvtwhLj6r5NW8",
        "lwoTP+MJj79rDgg/Kiw3P+wmkr/tmBW9sAEDPlMGXD49ojs/R72rPlX8sj+IirM9v9E9vADLob4zIgI+1ozHPQu5iL40xa2/n0cpv/Z7y77YLhe/VTu6v1G2w79Z6w3AFuFDvxb1zb58ypA+VNayvvoVUr9R0Ty/wosBwPhBpb4GIxi/jk+6Pt+iXz4JaQ1AgSRBwG3YAj/Yysq98qPhv4exZj0scw2/ELy5P6cs7b5NRdA/Xbk3vso0sb6kGA8/EqgqvuQDf782U1A/VDRSP7WPwLxkt/++GcLIPl1lK8BePVq/LEMxvrlpSL5RGaw/4lCoP9PNHb84BP+9+I8jP26Ovz+zZlW+uw5gP6yxmD2PSum9hFyQPs+S0D7VTbY+QJqUve/DaT79JqA+dWW8PhpA6z5JgwW/79lSPy8Lnz5m00K/2/ITv2q8Cr0kxIA+VOqIvp3W075+3na/E1yKvsmkUr5zo6S/ys2GPdDa+L7vItK+uahEPiSrp78j74K+DT6rvvlHikC+ZTk/O5G4P6XW4r+EWXi9awSevuhNMb9DTjK/n48mvyAMhT8leq2+1hXIPjwIhb5oeSK/7LcAPbPzSj5pzjrAmGHhPkpUGz915Ga/rKm/v1GZQj90OO2/72FGvlsG4b0IDg+/nco0PxjbdD01JTy++U/fvsEyhD8Et3+/kJ9QPw/dz77nB/q+gIGsPwo/ST4AMDG+VSSdviQFCr9Xv5m+fwOlvmnVbL7j86i+u6SBv4ygbL8oGIG++JUfPwcsgD+7dRs/1xgFPmEaET/JaD4/LnykPwTZkj8Hu18/qli6vitCCj5wRFU/FCcNPodWPD9i96M/Y59kPpTJHD8EhU2/rK8kvh3nW79J6fU/88eWvrFKNz8sQQ1A0rXfPpUgYj6FpxDADATOPuFL879LK7k+u8W/PlvpZD2083a+5Gf+P7qJIb9VUh2/XnjIvk9Irj4/Csi+d28eQHkIMT8Liho+FthzPs+wTb9SgzrAyE43P2TwOj5GxIC/",
        "GRrRPr8+nr39GvI9EfZ4PhVOQT59sQM+KWujPpoTWT9eMgg+w3+KPg1oub5+YxG+7DUevchXHT2CWm8/gNgDPlvLhD/QaaW+lEl0v9y2nD5gS9k9yZzWvPWx2b8qcxg+xVaHvl/GGD6NVa6/7yA3wDMKtr5J7lG9Genyvt6H0b1IXkY+5hN0wGD8Nz9mZ92+NpJUQBNdy743YIy8fDHCPWl+XL9awK+9xjZMP1BGgL5N8cG8OKksPpMlET/HQcDAFZv3PvlfKcB0bN09uIQJP4d6JL8YmAO+j25qPvLU9b2Lm/6+Vu8Ivv4NsL+HQ4M+g3xpva4CY78fmgc+wLckv5GvAD+C1tE9AaiXvqxOPL4NRLK+MAKMPMSxeT47mN0+4YwuPrMTkz5a1Da+2lupvhMbyL5eSNk9WIqFPrt8IT7D5GM/BhkXvmC77j6ONI4/x7i8PiLIDb8Q+dq/+TJBvCqJRL0T5Qq/jLyqvqYIJMDqeD0+CuCPPy+7Cr+k3Z6+61NYPo7Wo793J9I+QfGRvqwyFkBfwgW/sBKCPrZU+bxCMKq+kB/tvUHbVD913Jq+0YY1vjdwwD7M1HY+GolxvyYjib6MuRjAL0QXP3kjcT3vh/Y9qESGvjiFez57gjs/JzsFPMNKND88dlO/47Khvt10/L2xhF4+AhSsPxXdhL3+vDw+pm1fPhYWtz672IO+FyE/PwtDgr5vmOS+QZqRv9705L6XrSO/apCyPcFcPT88m+Q8DMGTvilCa7/NUvC70sr8vqhqnD7EWuq+7fMqPnMAS771STI/REryvuLM9b02f9Q+0DA5v4lroz7GxMs+CEemwGCs4j8qvxg/PBgjv659wD4QLk+/TMw1P5/fHL9QsbY/1UcEvwTWGj6SIRU/hh4vvhWJhj1GhsY9PtVTPhdU1by4CCi+FWzQPgR6acBet/e8m9IAvqjWgD4f2Uy+ZNQSPq5NfT6t/C49MXo+QLyUij/+K5s+KTb+vizw2b6MlbI9Zib7PUA8Jz/iFGQ+",
        "FOszvvUdwL1v2Cy/YjSdPd0wxz33lqk+KefxvgwMYz4/OwG+W4I0vsvOpr5q/PC9S2L1voQ2xz76LiK+FQFkvjSfSsD8IlA+GaUBvoEG1L7oMmnAd+VGvUAqBb87qBBA0MMDP/K5vb5VHRVAQTwSP084HUAAY1w/BAdRPwTMh7+sonm+ybwYv3dtrz5VqrO+R9ccvt8mhL2QfFC/E2y2vnqeBr3glZq9IbguP5BpCD8cGJQ+3T+Cvul6kb0rHso++mRIv5MQMb3UNV4/u1BOPThHT78xpSY/WwvXPo2h67qNDKc/b3Y5P9/9dT8CnwM/wOoXP+eAVr5L3gs+U6s1vlwGhb+TyKE8J2EsvxiVML6FQ469exzhPsIQ5L59iHS9N1DGvgYHBb9gI42+iu6qvVf0Er49WLK+KyilvXdzqL7Amki/KJ/IvphFR73aeUu+eD4Mvw9mhb4toV0/karUP1NuIj55Zos/W0hJv7jUR74oDr7Ad7m4Pt8AU70w0CzAuLv6vgdbGsCdTYU96ImIvqUcg0Afpc0+hsNJvCoGA0BwStg+SA0YvpGWrzwa9wE/UzTzPlkdELyQumo9vPoavt4UDT/XUE0/MhuQP3h8k76pj56+cteAP4p8Yj5Ri7g/KqY4P4qRir5HfRI+xqOmPN905r79Bxk+/bmlPg71zj6P2Bc+JSiCvdl9M7/PPYA+hohpvqSGjr3jCWa+WdrRvg/otb3ynd++oeuAP4BF4T4P856+dj+lvrrNK7+wRes+YA2ivZ2q5T60Lhs/ASWpvkjnZz65hxu+39yGvyI2075PaZU/B2Z4Prp4hz9fjS8/fgwuv00iNb1pUWW94LHGPZ18mL7j5jY+Jm8XvtONLb5MCjG+a8WkPvFtFj4i750/X/8vPfBInT75QeW9wSuRvgC7or9KT7I9xOXdvtOTVj4toPO9NMMuv/Xjtr8uOCy/4PRjvg7wdT7QlSA+GDyRvpdVjb5aHTa82wfmOcNJFT8V9+y/En8xvyj5uL5X68C9",
        "HZn+vk2pU777DEY+jZyhPbmbqj2nrZw+72ctvymWsTzVVlU+OXnIPhz7jL6ko/W7itOFPdpNyjwCAHg+81u4vLxBhr6aobg+RBqXvs7ptz7BR0S+aeYnvhI71j+AmBW+KCJePc54kz50BpS/PWeMviZdpUBjO4G+bbK/vxWzoz1wAc88l2WRvVN8+TxZZ/0+WlIpwJBEMT8O6d29uK2gv7bXPT5QdNw9CMZ8PpWKjL7i8EA/5UkRvlglcr/xZWO+C3RPvpvd0bw97ge/3yk8v5Igfr5dm8M9+eYOPxsXIcBxLjg+c4bnvScxTL6V5yo/0Ircvju15T1M40LAWkOnvq02PT6zilo/6F9Gvmq5Bb9GdRc/qhcZv3/EVz3kLQu/04HWOwxJxr0heDM/ZShTPaHYEz4ASfY9mIzDvEnaB76/njq+4fwZPiw0p74O8WU+mp2ivZ9rvD488GA/OCLKPgVBlzz1c/o+428WPos8g75C4xK+JcFuvireAD/c63+/N/aSPhEVrT4qNLM+YY+cvjJ2xD+kE+68U0+PPVsFC0DBedS9h5acPa1ed7/VigQ/ZEIzwOqJAT4YLqa8M5JHvtN24D7vx4A+TKtLvZ/fgz4h77U+SOFhvXpUzr4EgwRAEldgvrG5D76gNA69LvXGvr0diz6KNwU/G6FQPuScPj5H24i+oSo6PfwLBj791N69jm0ZvJFJmT6fH5C/AjCsPK3TQT37/Pe++H1DP0HoRr0FFJW/P9ivPmzhBb2Oawm/0msWv2P52b789Ju+dIK7PkRfHj8Y94o+ae4IP2mZcTw9hFE9ZDV6Pwa5lj+N2Oc/CqqmQCSYLLzeqMC+E6G5PzRFob0td+c/w0ISP0o8fD5J712/KPHnPkjtf70hNPo99qDBvmZXkT6OyII+45Z6Pk3Ljr/WBYC+O3iXvooPID/aPLu/x1G3v+NOa75Q0Cc+vBW7Pl5If7+xTHS+u2krwGX+Tz6q+uO+thrTvg+4CD/+CnI/lHzZvgJvg7542W4/",
        "1433vopPbb61nuW+9+aIPz0R777U5d69LzkqvQoWwL7R92E/jJtMvwiy4r4KlNK9/E+bPQ0RCT7o3lE/qBy6PdJipL+1Jqc9NhwgvxvBjz5csBC/4E6JPnUUCkB/kJ4+AcHaPvi7RT+ndIq/ZDETvluiEj95Bg7A6yI0v1Bzyr7F4h++w/67Pi/6ib67O1U9f4CQvmXkIT9cOZW+3viuPhkNFLu5xgI/y1X7PlEmFL3AEfK+XAE0PaNcAL9XyBy/KS2tPjcbHT6sOaI9h5IhvthWtr650qW9elC6PwM9UL/ytJC/TcuDvkRdNL/h4pw+L+2RvyX2xr/4JR/AmpmaPpvJDT+V0mw+QMl/PxBGKr8FTps+VKX/vrJXXz+NDGw/bj7TvrejAz+FcIc+2llvP2sa1j3GaJs/Pa33vZ/bxj7XJQu+mv9Pvu2ai7/Rbb8+C+sFPzMeYT9Z8PM/5hoBQKk5tr3MHuQ+EdK+v0rvr78paHq/WRixvzQLgb8J1Io/PWAJPkm/wT8Dh0++TDjGPkGIWj8D4dK858CyvrYbqT7rhaa+1LkJPUc3N79NVMW+6r6xvlUAHT+SGhU+1c04v1+3hD8A44k/y5+KPvAuLr/Zj2A//TRNvlZyn77vjAy+cZIzv3B1JT//8+C+WwRIv2T2975PYkQ/fbUgv4b+bj6dwKO+aQObPkABXj4CsYq+pioHP1g+9T4OPrG+/LQKPxbYML9rzyI/rrxDP7YhGz+iKBE7e4FrP+Rhgb9OeNo+xKSuvkbTmL/pqau+bj1CP3FQlz7QSfw+f/iHPwINXj7JJAS+KdoFwLbcVr/YANK9CoGfPzS+sT99QLa/kY7NvULw8j3wygQ/fVX2PRBdkD42agC/FHVEPjYMtbzCf46/9XydPqPXSD19YOu6PdS1vtsQxD/fC7c7jXTrvgNyVr5koC0/EtWwPHLEv76o4eK+8KspP1dUg76mbp8+/VX5vmMhDj0FmE0/FCnZvLdoNT7a3gW/8fC0PkgnBsCtgca+",
        "0FCLv3lv6z4rIoG+LTOVvoA+Nj8q1xk8VZk1vgA/s76/ka6+1x4RvzEtML8Ufoq+/ABtvqwHf7+CME+/ZKRCvnNGFD771bs+bQiTPiuerT0hTrI+R5GUP/09wj+XsYY/B/txP9W3+L7SRL8+8WR0P7UKkD3V7Ho/ncSnP0+KZD4cxeQ+13LjvyG/Br+AFqK/Hr8iQFaOEb/3k/o+kVJ9P5D3yT6pM8U96wS6vlMR4z77vN2+Qqz4vOYOmD/GcfK9MVGXvqjkxj97ma2+poFGv5MJHL/KL7c+LyeUvhDWoEDr+i0/EWYyPmpAiT5T1y2/0+WXv4awyL0fNak+917YvtrHvD5yF0w+MjFOPS4JP748bLi+5i33vjMENT/ARca9um/BvlJItr5upNM9sXEBvgGix7xjTxg+p5g4Plcgsr1yyTk+U3gFP5KPwz6wcGs9GuXNvnh3q77G8ua+1Ht6PwObBL5BM0Y/L5BdP7smorzSL5bAYFKgvtrYoT+wLOg+Yn+cvopauT2hV6G+7jYivxsbBkDQ0DO/uPkUvfhL2T9b4by+qBoavT+fAr5NBfA+NC2lvhM2LD6rY+g+A65lPpzQpb6LNYs+CBpzPx3zSj6LxlC+uwGGPpiXez3XahRAvs+5vtID0r3pK/I+15havl0SHT+tv0y+Ny9uP12k0T4="
      ],
      "forward_bias": [
        "WvC1vt9EkL9t2R+/ux1EPypDgL4SWiu+0uW0P+Sdhz3CwoE/MaWBPpQqLL/5nDg87k1fPo45pL9Fyqu/ZAWuPkJ6tr9DoQJASpLWP0USHb+TT9++NSsEvz+UrL85iBQ/dePFPoyalz/NZX8/jFASPMyx1b4oWLy+zqCrP6tdzD1IZi4/mfzDvn+Vkz6Rpqi+vOiSPqz4zLzfncA9Vj8Cv0NPsbxmhIc9q0XIPgjZbD6Kmvy9krxqPqqxgD44oJy9CJtEv1EHNT7bIe4+xtH3Poe9OD/cJpc9wFfzPZ86BL+OibQ+Tx2zPc6wmb+qTDi++m8DP5Xj5z6zirc/sG8rPg=="
      ],
      "forward_recurrent_weights": [
        "x5iPP56yuT7IUbY/zk+7PjYbB8BOFxi8OTZ8P6PdAsBF1l0/fhtrP8q4cMDL3Dm9m48tv1X/er+Yk4++tCXzPs/QjMCUknS/l2hzvs3FWz5lpTS/pR5jvwaVzD4xZ9M+JrwDQDnUi7+P3x3AgD8HvW3+5T6yvna/qHSjPxIiwz2XWHW/STF8Pa2wq7xyTQu+clgmvwI6Qj5LW0Q+NaBsPyzhAL95PTu/PIZ5vyavCz54zhe/Ax+EPhADqb2peRw/scCSwASuWbzKpgs/i6ztvvRarT9pGSA+fU8fv1mvzb5ODjY/c+SJv+1gh7/FdfW9fmMnv5wMGT/aP7S9s2cAPiOsqj/W4n+/SxgmwCDYoj82nRU/ARqqv+lADsB/8Ze/tsIFPx7tDMDr1iM/d5GWP690u79bdiPAbSXmv+rWlr3cgUhAumleO6zhRb8lhZy+XfAJQEzdgT90UD/Adlapv2ga8z99Hky9ZStdvwJ5uj2IE/8/TY8iP/bGpz/bJIS96Yb1von3eL9ELHw9BdNhPjnOZD9UHF2/cKbQPnkF0j0vL4o9Rf8WPgCwIT/sWBe/OyNhvU1XET+L1TW/tiSRv4ZBZ77/ACs/RtWcPnzeNz/q6+09+G+cPx0Y4T/1puQ+9L4jv9nzor53X9+/qbs9wIjdhj/Styi+zoXsP3LPrz+/msO/Px0MP1uIxT/1oEK/3hA3QB26cL7ex6w/ktYEvmm6ND+z/ak+JGulPyoHR7+w10hAPEm5v2rIlz/rnCU+QGKUvhmdYcDZAwRAxIzWPUBJFT8ZHZO/fRO7PgFNib5MS/G94klBv6ZL8b7c3nw+rFmsvl4oub+17Ia/5da5v/GEEL4WlWG+dEZVvj2QZj8uTLa/cyxgvhHf9z7WxWG+xddEPmLH1j4dLDE/hG6MPYH4MT8V0iC/RWgVv2BCvr3LYLU/8EaxPikN1r61EkA+SYfNP6yF8D92ZOu+SLGyv18Teb+INgtA47r+Pk9hMUDMbpQ/BS3TP2gxpb5ZU+c/",
        "ThGwPp6EWb9nrhi//lwzvvMAiz6gXcE/SZ2MvnbbOj8ePk2/GnbPv66Tfj5poAA/iG84v9ncN0AjDN4/lvxrP7l1HED6AvQ+CjIQP44Vv72vyo2/5IglP52PSD+aZm4/FYXhv4UT1r/via0/lk8rvt8Mlb4ddjo/LekxQDwSdj8yqQS/ISw5v5LVzr1ZuWq83yP3PosO3D4crYw+hj1oP69G+r0N72+9a7YzPlKpFb8i7CA/zw2qvXXgsT9rtwu9Mp8Uv3XlFz0qSCE/A/YrP4S6isAlU7M/Lm3pP4kL/r6Z/UlA+TUOQFsJlz8+9SM/AFmQvwirCb6fveM+5REgPirJI79RH4++Hki0vqttEb5oe5+/oKOqPs6sv7/ZxvO9r9EBQIqy5D8jkdc/Tqu7vAgM0zx1W64/VV4uvR+zUr/8y0o/b5NRP1n0xr+tuJY/MS0tP6CyCEBSubs/Y8kNP+CnOzv/LxS+j2tBP77FaT8Xrss++bYRvwP0672lplI+0JHGv6QthD7gOAs/Rjjnvl63ML7cW4O/EnZrvyuMCj8PVtO+bjLqvokIiD27iIq/P/Iov507Q76q7WA+SsvNPpTYPL4dChQ/i6fkvdG1LL+Ge/G+wEMQvxs6eL9+908/b64Sv6JmsL1drgW/UpkJwB/k07+ZHSDAne2OP07xD77Tmoq/UvIhvXa/BL81oPq/73moP7bAFsC8yLq/abmGv4tVaj/KaOa+cILaP/UYtD82ccI8tOeQvo+8oL5rGBu/+Jehv85IAb+OW9E+78rfP8Daoj8m/iA/NyHkv8oTAb/r8gm/lYQCPpBrEkBOTVO/7XmuPjj1MD+Jtgk/1+yvP2Ibgj+vA5q/69w8Pf1gvrtcKmw8VdCMvpsT4j4yZsS9hZnCPsibNT7vJ42+pvlgP/nbhT6BqNw+shhFPmDsQL8NExW/lE6fvx/Lez4oWNu9tvlEvw9NTT7p70Y/EUDUvlnNEj+QeiC/aO3OP1nkjr/SgwtArqIfQB4F8j4wMZI/",
        "zNcuv9cuNMC/cbA/LYHBPf2B5j9wt7G/rEmkvCYCPj/MLFG+n7A6Pxzk8b/WhSm/WfGNviggJT8I5/c9C7vcvv6iSUBdVlpAAa5cv5ew/76iIpI/6vvtv8txHz9mJhG+knTIvkDvg78Qq+E/zlg2vsGdpL4swK2+FQ2XPxgWJz/GK68/kGAyP+clIT9M5wY/dgC4vjqiCMDcnXY979tPv29NFr/RZIK93PTbv4xCxT8ZJxA/825zvl5zET9BVeG+mlcJPyT2cj/LQtc/f+8pv/e1HT8Gu6g/ShWqvxcdMMAgCbO/RJuBPcvgpz8M4au/jOZbP0s8Ez7lqAPATcRHP+swUD/UB44/FFK4PKDmz7++x3k/O0SAv9si6j/G+qM/rgHlPsRe1T+Zybw+h25SPz3/c0BpOzS880nFvoRFCEBHS1Y//Ue2v2YMiL8jLdg+K2yXP6+YQT+Yef2+/cybvuNWMD9mpYs9nSYzv84Udj8MwiQ/apdZPgbzAL4fUgi/zMulP0+xa78cAaA9LI7Fvoc3l7+0jyg9s8+Mv1v1ND8KRoe+wpxHv4Va878e1rg8mbvbvSR3l74DoCE/d7JYPwTMmr+suhLA+fMJvxmQVz/jWyE+i8fKP3KyXj/eq01As0IJvudUU0Bdnku/k+gPP7m0PkBzaMu/hv7HP9R8dL85i7g+7iqXv1/z976y7NM/+W1OPty1xT/xp14/RnCdvXtjS7/HOeE/HyCfP44EQL9lUV5AYLR6P0hAfD0d4uM+WjIuQEqe3r4UPrC/c78wPkPurD5XB1Y+r5SgP2zoRb+oxDW/ta6av+0OH79V9l4/AVOmPuSQIT/HOxbA+l9ePkym5L9pfcM+c2AeP49qFz40yiW+++7DPpjf279vDng+baFlvy8WhL1APJu/weP0vmpHOb2cidm9BRJwvkAFGT9PiUa/mHcjP9HlvD/V6Ao/D2COP1OuAb8MUDM/jE1JPVf2DL4sTp0/L1P/vktK+z4WapC/3bwuQEqiW7/rsgE/",
        "KPZYQDfVbj0fvb6/H6I3QNJ7Ib/X3bQ/Ch+PP81WKr/E6rM6i4sPQOqhWL6qY6G/gXYFv7ZlIz8Fooy/1+iJPjw0Fz+ExQfAOCMrvw/Y7j+9oei+RgDUv5kqjb8VnQy/rilkv/2xs7/f6Yc+iStkv7cDej08qNw+ckrwPtYtfb8o4IC+WxS+Psxfbj8Sy2e/BUwxvwb4qb8ZoAy/BqqYv22ZCj6ehq28GHOXvBvvGT1rhsi+fFWoPl89l75GoQg+j9CHP+0umL69C3U/pCySP/AlPz4RxL0+vwOHv0PZ/T4qRgFAKa7qPij1cj4yaYg/55Hxvh5ozr9x9Dk+MEqNP3BPMcAKzNE+s6itP8VLkT+YfjDA3fA7v9sRmT/IRwM/sK7OP1lFBr8z3/E+f/g1voT4MD1jQPi/0gMgvnCqjb+K5QJAgy8XPkh8dr8Ja7I+KZecPiBvcD/GZj6/L4OOP4tD1L4qhla/OFOmPnXVhL2AyiG+RGWtvktooT/B3LM/FJIXv3n+VL6P7zW+Pb16viMHar0C75e+sVrePk8+1zzWQqY+/YsOvjDZqb8p9dG+diRtv2+Hoj5+5w2/HQSDPrA1BD8ziMC+rXiyPqrBiL9N3zm/3LrHv1ogMsCXVSc/VpGPv/2VSz4pbYU9UxaDPrqmgr//XM4+7Z6ev7MS1z3UvgbApxPPvyq/Rb8Nnz4/R/DwvnyMvr/P7BZA8jZKPxl1bb4c1BY/+yUBv5PKRr7R2y3A+h2gvv4Unb8uaUe+mHVgv83NY788Jga/lySwvwEqzT7exhG/0X9bP9g0HD/bjFo/3wMDvgMYLr8wEMa/TCV+vxEiOj4sggA/FIvMPsIyhz3v614+y9fPv3sJ9b7qETk+p2s7P3aG177Y3SI+fwAiPpIbB7/ujuk9IiuBP9ZYpr6tZJ+/opfXv4N2Er43Tz4+lrSGvwXA4j+wABI/wPkeP8ZSW7/sqnW/b0gnwMn8+r6gEyLAwr0awCjeD0CZ4Zc/OBoKQIOHw79hFHS+",
        "6/OdPg5RIb2uIPi+9aHMvuA5Ob55fjY/NPUzwI2IkL9xg3K+eacCP4G+4j6AfOy+U5itPx7xUz/Lb9O/+IFLvw9KRb54Bx8/WLrVvfx1Ej+87+q/JnY1P+QfSz9AUKk/C10Rv7IxfD9wRos/WDkKP8W8sT92nkVAFBU7O756v7+wFs2+SbjMv1Twy7/W+S6+LgE/v0Q+i79zKdC+Bo8fPzOkur/s+bQ+miIiv2ljpz9xxoU+YmawP6QlOz8oHSa+1iWpPxN5lj8v/TO/1nw9QL91rD8ffCW/rrChP1oimb9Pe2K/iA+TPxKIib5ZNgzAIVAFP0Adrb8kp9U/gy90PrDGIL9StE092Z+sPgayGL7fN0o/JC6BvPGDCUDZQ9G90lO3v8HXLb/OR4TAM+DAv3PVmb97Uou/DOGAP/hwqD73D/G/nX59v3+8Sr0uOMm/lYICv0a/AcARjAW/G5mTPChyr8CiPbS/gDxfv7TlNj/bg+s/gQLJv3Kz8T/5pia/hhlsP3sZvz+5P4G/ezu0PGWp0r3lEfM9ldNkvoCbnj9+zwi8ABeKPqETWL9LDTi+IbikPQdIVD8XK5o+lWqDv1JJLr/3/y8/UM6av6qerb8Mkj47qqqSv8NozL/8rnq+1p9TvzhTCj9Sea8+oO/9v8BQE0D2V6U+D1oyvxIECb+hLZI/09CNPytnDL+VDWm/0yHlPxEpnrxJm/A+bwfrv7KqOT9aTh2/k9/7vzTEWr8E6Cc/tSYqQM+7P8Bmd/S9mFfRv9lAmz7ctak/DZmVv2Si+b4ttXy/fuTkPmL5Z7/M9c0+L1AXv555XL/TVxG+GilhPwLhBz9VBSbAwsHcP59oh75ZpLE+GnQWviaRpL7L47c+9PN3vsuwAL6ht0y+7pOGvklTPb9dYsM+kxqRvuXSCb8S6kY+8bmnv78+dT8sMiS/q6DgvZd83D6366W/9AJJv2KghT/bsyu/CBHBPYP0iz8xfug/da39P17LTL937rq/Vq+DP8OXED/VC9u+",
        "8a0LwJwXXT4I6jw/l1N1PRYwhb8eC5e/WLwAvuWqhT7JUQVAMmAQP6PiAL/SG0S/F059PqwCRMB/uGs+XlObP7gmez/dzbe/UP7Ev3E19z64kwi/YrjKPmCpnL2MtGC/4avQvxCcGb9XxzM+ge/jPr7gj76H8ke+xVSEPwfRBT+pLkY/sl5pPlxAPL4HR+A+Lycpv559ET82z5U9dF7dvmMcfz8YvPw+wu0Fvx4qqL50vsw+qCQLvzDfbb5HAfA+Y9i6P8abz79wIce+qCOrP+5pgL9OxytAtbYdwIVSDMBISjy//jC1vzxM2T6FgXm96xW5O9L2tbujIQC/1wyYPg=="
      ],
      "forward_weights": [
        "fB/4Pr7xqT7e3kM/d8SpvPl5cj8iwMI+vjsIP9c1r71Yfjo81rTlPXHYIz4HrM6+KyuMvwZSOj+IinO/X5iqPi2+i76tsQi/LWahPmcrrL8wEwg+6tFLvNNmij6zbL0+OW+Vv3fUCz1WLKM+7FN6vk/sDz1127c/WZcqvhluHD98B0Y9oucBP6pDZTyzXB+/UJCqvTEcGz4Cryu+Ete2PkBKjD7UG4O+j4Nrv9omFz0WOSk++7a5PWcW5T346lk+SxOdPp7vBb5JJNY+NOwPP28D0b8R6gK/jWGvvw2hKT+AIx0/YdTcPct5ELzHJQE/eqUyQOnwiD4kv9y+uOZAPs2m7j3ZBpc/MkWfPZCl6L7slNU/pU2Pv5htRb/tIJC+XIoNPlSGVz8nz7K+Yjgpv4n6f7/scMY+YayBPqg+h77GlEu/Q03dPnR5r7+5P4q/WOX1PaQIpT7orYA+WyGLv4Z9FL6eI7M/3Y4jvthZKjwc1RI+6IA3wF/VKsAKYo6/NQqOviCh8zxG5oU+SCyMPel/1LyPVV6+kVQLvkMZZb6fjhi+Pl2iPuvpKr8mvGG9c0fuPjoPRb5chfy+AMzvPWGtOr9anlC/5nUVPyam4j1qq7C/02yRPG/cAT+gNu2+MbnYvzb9lD0fC609/mPdP7n6Fj+WWAQ+d7sav90bgj+yPe49MBAVP9Eejr84SgM/EnbcvrcTHL9BoJm/OOj3vp0OiL8Tm16/aB4hv64mIz6Ak6k+qN2HvimIDz8m0DY/wtnPPnaRmz0ujA881JqCvnQJE0Bl9eY/NyvzP0wYvT7V5Oc+F+GyP2GXcz648oa+qudzvocZqD8bbvA+YUE/v6NsLLxo/aQ+0DsvPpWQGT6GbHi+0bhkPtslKL+xWaQ/cdOtPd5VM72hxug9EM9BP9y1TL7hiYC8H6+iPvHAPz4YCSc+oOnKvJ09m71WKjjAqxaNP7GzJj/7rCM/6XeOP6cb3T4iJWc/3dgbv0mVN79MlpG9xIlBv81erL+HNDq9",
        "cDtMvkY6dz9RxDs+cHikP3qBwz9tWc6+Hg48vs1dQT/VO/G+JXguPub5XT9ixb0/mW24vTxiAT6G+7W+jXGEv8s7Gj8iOD+/XlIfvIfYYj701Ni8erdHP+/OtL9/HDg/t1mEvrlrp76Jm8g+GtNnv0dbL78lKg2+Fq7aPrXMej6yw48/eoBtPITaUz0tSKk9vjRjPV8npb7geUE/l36vPaaCqT9zBRA+JP5uvobDJj98fXw8pslHvXJdiz6gOFw/632LPqu2Hz7Mq4K/1+h/vcosv77EyqU/h/jEviJZcb+nMt48EZhtvUkp8r5gbZU9cv1aPz4y4z505d69n8Opvp6Xpryexe4+fcWevLum0j5otYW+wL+Mvqbsij5AY5s+SdoUvwpipz2bIpO9LweovjZMlb7lepG/ql2IPrKv1j5zSsk+wx2tvlGPj78LHiO/CMMQP8re9T09BF6+nHzXPYqPOT8zeBw/oieSvexIO7/re7C+eGPjvhR8Sr7071+/anfPvOrQw7y1oN++rANKQHeO3L5ULNc98zelPSvbP76t7Ge+6LOxPTEDlD6XiMK+RE68vps+Mb54PkS/y/LtPv30Sj6gi7y+iJwKPwb00L91xFM/X1lKP5DvcL+5qJe+fxUIPuUamb8LjrE+P7swP5eECr8Lws4+YkRaP+Z9i79vtDG+jUQJv8P2Fb+s+MA9UTwhvyGY0z5r3Cm/BNwzvjpS+z6kriQ9XBCePpm6+D42lRm/e/IEvQ9hGD4PpUy+XsIAv06iLz/4bCC/ojJ8P0fIgT2bLgA/f5qTvvrl/L++Sb4/Jxa9vhA6wz4XQhc+ybVuv267HT8DjmC9BAIpP7+frj5/odU+TleLvom6Tz3OdVg/gXe/viR1fD9lpL4/Ew2MvsGRrz8MmwU/DnXhPdNTar79hqO+XuKjvcfhkz+a4MC+ygqoPe24R70xyLs96xy3vjGo5r5mFos+x0KAPoZPKz0CTY++buH0vadyRr/+XZa/8vkSwFVV0j5v4xC/",
        "oi+8vmivtj6rjjw/1KIhvr3zKb9LnRm+oaYFv7Hy2L4KmSE+JY5MvVJswj43gM+9W/O1vSggRL7vDYw+knDmPlAehb64eDg9yn/UP1U5nzvSpDo/3mSEP65DCz+uP+S9jMm1Pim/2L5s6ni+qN4EvpUzvL4MTse+al0Ivp0fJr9t4h29huWJP9SKkrwDcNc/S1NAv0fHnD1cHEY+3ALcvqr9s78qX5g/YapgPi5kWb4nWI0+Gd5aPlvkAr0H75U/8HMBPuCGd73jWoY/jW/Cvjw1oT/MfAc/LF6TPyG5oL8/cKA+/WScvtuXTr/1O/C9H0NiwLK+8D6weY4+Zy2lvvOISL6y2cY9bCTWPqb7Vr/lXJ++JiVFPuU2dj+YlLM+Q8y/vsO89j0HnIu+AC0Dvyk+j78RdZa9qP9evrT5nL1BLxM/RBAjvoneM0CkNlJAkinOvl3J3T0f96G/KQ5qP6lTlb5fYEE/eVOMPkTbLL1mcNE/dUElvxjvOD8kczm+MvocvS+7j78SEUw/sK4yvsl51T0m8U49CB5Bv0NsB8CXWwM/7/Y8vzbKQjxBvOC9AyWcPlWhAD+zz5M/ajw0v1ak+L3Im7A/0A+SvXILOL2YBgXA1QJjv3iq4D3XQ7y+kkUgvysVIj3cXYa8WTREPnTWZr5BokY+dLVpvQHPg73vcdu7CPPyPZvCpj4Ogcs94r6cPljqCT+z3DW/h8YnvhDGAD+xlI895zbEPWFAAL+sDh6/0PCGP0I8hD5YZN69BQUBwI4Z2T5Dtes+Y1Uiu8bsKD6o7fC7sODxPhBE87/hVL+/ZseevhPq2z5Jk+U+armVvZvXQT9z5qS+yYfqPsngXDyz+oe8l+CsPk8Hs7+fzVY+4OMbPVYwMb5+q889Pm4JPaJxjT0EzLW+IejHvgsCXD8fnms9KABiP221ur4f8VK/gXeGvt/M+r3P9/k/KXlzv9JWCr+Q6Tk/2egPP9pYz75QiCI/5OtWOxnOhz9nvv8+UyvNvvbdp7/ue98+",
        "w/SbPrE1ZL12VEK/3oIWPmZ9173bBQ+/mho5PWXwgD6dhs+9QHLavtNZ/r5FIH4/icnUPmW5+T0MqHi+is2Ev/WM4L0DZ/49krEIv+dqJD1BR089/JzrvsN5Tz5vfvu+jMLFPwdWND+5E3A+eKyDPgKatT9D4A3A1xH3vpTd0r1Z2ae9ck4nvy/bE7zv5WK9+3MEvvi6fz6lf5O/Lnj2vmaFzL1qWnU+OTmfP1JpKz+cEmG+ECWkviVVSD49ndW+upg1PS/KuL41kz4/AUoovy9V+T72uTk9xpJNPjdfab70S6K+hrhoPhfGhL8q4Ku+12T5vnWQkL8ZCiE/98MnPdPk/71i2hA+jXS2P7h0Ir8K7/y+nfciPcLZMr7OBGC9yt69vjATCMBj7BM/1TI3v9r7CL9tUyq+CH4VP+QQvb93Ytq+e4WtPs0khD+cnQfA4m06v3dQdL+0kEa/ghKpP54+Ej61yXW/I4zqPsgHVj5mGAK/aJisPqtOQL86kJq/pcaKvntYHj6aSBw+pzU9vsLtaj5i7h6/6y4Bvn8dDj8GdYK+YEJDu5n86zuDCcO+Lm+7vpEyGL2/nEO9Q533PvPdA7+5xU89fouNPrwXJD7RiIc+kANVv4NG171LMIy+nZnBvgeT3D9lv1A/qCkcP+89Oz6O0XY/5JOKvxXiPz/N9/E9ddVeP54TRD4Q6cy+cCa5ujwCqr7fK4o+m3CPvpMWOr6OvUG9/EaMP2Lymb7X1Eg/EUvJv2Mz6T5z3U09xY5ov+dbiz7m2H6/qnz1PgE6SD8leBLAA7uZvQsdKz6nC+o9wOLMvh/Bgr+AGkY/nxUHPQjLXz2xUcA+dayiv5HBcL5X/gc/7rC7vvGimT7Jcxm/m7wHv1uFqj5wXwM/rMQGPovb/z3zg62+YktcPV9vcj5CMxa9Me9dvz15cD4TQA2/EVbiPSiJLD8Ir8q+EJvZvnq/Xj1pTbw9h/hgPj+487ydTSA/g8Wdv7sMbr5zUe8+eQvhPwaYQD8zJac/",
        "4XvVvvQDXrxdLFe9KJ2tvmnDO75NBKy+6u2Gv68q0D0ee4e/G3Vrv69ccj8q/tQ+a8y2vlCuS7/SVis9XJbsv0CAdr0pyk8607kMvwg4WL9oGI8+n4LEPtD8SL0Pgxs/FtPJP0aZ0D7ROqc/tA+gPv3RuL1e0Bu/OFhCv9BIw7+KzUm9g2covml+tD7b/1k+UDMcP5zSZT1ffok+9y7FPyIR+r79+3k9II0gP/Oduz5ALRK+kqO0vgLaf76R7xg/afd+P19JIz9mCRc/clDivqqxhr4iwwa/QxMhv82xrj5J2rI+iU91P3Zs9rwuvuu+OfL4Pdw2Lz/hczi/H7FpP16R4jwi/f6+WJG6vsJBwT0NUOE+UOoPPtVIgL5QfRS+6+BpvhfAIL4pfoS+VKAzvm5k07t1zB8+shv/PWkcSb+RaGW/qJflvO5JrL54qYg/1LHYPVVIRj6FDN6+DOlQwHZkuT4Bd+o+CjYav0X5rD/AmYU/5fUGwCeX1r5GYBu/INUSP2XBCL/96Bu/hh1jvcriHD+q3aQ+QE07QNRBx7/gKsg9IceyPqxesD1UHx89FKKYPgbnEb9MKLA92zeLviROdD7cdN2+aOqbvz0V7L0MVcC/3b4DvmoiID+2TpW9C9ulPXoIwb+zUJm+aLIYP3op/b3NemS+EwjmvQ4Og78Lz0m9lt6Evm+MezxWVgE+cf7kvX8X5D209UK/YB1vv9xHEj/sVM8+wl6EPjBbuT5tFt+/2wiLPSAlGb5qLRw+j+O6vuUOOj9X0HU+t8OEvurptz58wak/fTSqPnR/8L4FULw+MSVXPgQrhj2iu5q+OGR8v2aHn7yj5cW+6YysPwOPAb2Yx4c/FkiuvLHLGj/IUzE+PtkuPRVEhz54TGK/q0Qjv2qPIEC3Zig+E3zHvbEo0T5KMsE+o0ZYvR7uoz+vtLC+8wskPRQCYD8+Cju+v4FtvkrxWT5KDME/GBxGwEAfOj6ebvO+A0bXvlmrpD2L+s+/bLm1vdPzpT/GbaC+",
        "mjEwurgqIj/Ft40+7GcIP543bT/OuxC+Aa8HvlvBDT5p8ve+weZ8P+vF57wPTpo903CsvYX6lr0M7XI9leX4PhrrK0CmujK/kX4+OoR9Cb9BZZa+DOjkPNwVVb0H4lC/YZUOv3A07b4GMYs+9FYSvof8Hj7Dmjy/WQhePoVk977/0I+7FH78vBw8mD1S+LS+mwmGPTrzLr7euKg+sKB8Piakcz69LgK+ss+bPUb/bz42ZCZA7uv6vbzcsj2lYLy8i9dHQAOT+j5oLKW/xgIGv1NLHL8l0XK9S3SEv7ZkGj7BAoq/ZlfrvdXZTD/9/QQ/PNgkv2/YFr7Aj04/J2rZP7sVbT30TLw+LkYgP6qpdj9Lyog+W3J4PNoPoD5oI9s+l+oJv5lOGT8t2Ia843EGvwt3qT4VVBW8dgjSP2cGOD4I2XA/h5FxvU9l1L/Q2hs/UJ4BvwIbvzy8HKS+FTgdwLfpV7+VYVG/VXQFPiShs77Y4Vi+5E16PdxkhT7MM4S9CaatvMx8gT5YOyS+antsPZwtSb9QHak91yqgvhkCi79tfPG9hfrQvDsBOT7J+ou+G9QOQAnCjr0rpGa9oc30PelbFD+lp6m+5imEvyrnUT3FAtA92ZImP+NX2b7H28O9EOQFv3FfqL/ZYRM+GvF7vSBX/7/F9d6+66T6P1CqQz+oU0U86NIEv8X2t74oCr2//JGrvkOhgD0J2Ee+1KwRv9qVAT5XTlLAb5yNvIvMhj4mAfe9JVxxPotTrb7HLMe+eiqYvxtQSD+XoCs/RBYTP8Uafj9Ntq+9da9pPkbMJUA920U/AMO9Pt/d8jxnaOc+MFrTPf0WlT5WjVe9wgFcPps2qjyf8q69PompPZun773uwiA+hQkGPtICC78Kig4/bo4cvTpfmb6E03m95NLSvskfsr9mChQ/BJzKPtEXl72PIjO/hri3PkLRSj+6ipY+Q7S+vVLFt70H0ok/ohexPbFuCT/Pxmc/c8wVvu0f574X8mQ/KSqUPq9qN8D2BWO/",
        "ihrSPTDD/L3/6te+9LPDPltXvb6uXwg+3SEEvw90r79HwtI9u8CYvSW3Gz/uMtU+5KOuP0EpLTxxkKk9nf8NvdHZ477chC0+1Buxv0dYe7+v3B09sGK6vqhZXT4Cq6K/6SgZQIQPNL/+vYe+sMbRPeyQKb9gf/Y+INLGPRm1ET4v+c897yIeP3LATb+sDgC9l+azPptmLL4J6ZA/VAMDPwYXpr7rtxI/RUYhP5dlejyRNPa9QI9vv553jr7vSkA/M+gIPteymb+GSg2+HwyavVxeA0AYSR4+PNAoPa9vwD79Lcc+L5fHvYtnD7257Hm/yGr1vl7hbL+akEe9ovGvvPF2sj6PwkG/18M0vw1Pnb5kN1a/AYVQPwLREb8uhvy/K7ZOP/SS1Dw6Ha0+EMEDP+U8YT/WsEa+yQI1P35ubD4/som/IVJ0P5oQE78/RGE/C5uqvGeaLz42GRa/o8fUv3FBhj8Fn1O+8LDgPQaK5L1oRjq/GCuYP+ylZD3wn4Y/xiOVPgRM5T4Lbk+/l052Pn4Pyz4HBZ6+W9ueP6uGa76xGxq+oly5Pkw6/T2GKgu+zw3pu0ieq77Yd8q+GhWdPkKYfL+/Ir++JtwMv29EqL5TgQZAbYwdv0BhBD9auAs6VFymvlMu0r5Ppi++/B8jv+rlZr8JBeC/tsApP0Kwpb6+ttm+3tcLPv0NTr80kxo/mOe8vjAdrb80HLi+KtQDPnYvwT7SkfW9B3WFvndsfL53/EE/2Vouv4p7gD65Y26/+HQUv+1aMj+38ju/231cvywrOb5VkYG+QPduPzc+sD+bpnc9E0Aov6I+eL9mNH++Hd0Gv73wF7yBLNs+Fzyqv9jYob6voRe8GLnfPDrDvD7Xhy2+lzfIvREdK78puAg/0j5CvsUPkL22pXA+cOIBPlMqF8AanrE9cPsIvlIasL4PdoK+KeYXP2efd72Sgau/rDzMP/lujD98M2g+/iOAv6x/J74+jR0+20iZPdmbXD5hWKS/emb4PjGea75s1kA/",
        "1KuTvfMJ4D1e3a0+nbVJPqXUIb/dim6+Oe72vl5Wr75vK+U+Zv86PX1u5D4nohc/qYLBvfRlCD7hjAi+jEfnPtZxkb7IsFs+CqnAP0k+iL6Mtws/+Dl2P6m19z59ILe+e1fBPsKmHb9MlyA8pO1XvpXEbb9EbIa+zkd3vhK9A0AUzqg8N92BP+2ZM73sthg/8005v9ZXQjoY60w+3EbBv8rwnb9y76g/M1kfPmmomb36Lzs+JA5fPoTXHTxSFv4/j+K9u8NVO76RHnE/hmtxvgX8DEC4nAc/uAY9PyWBnL8/wI4+MTPSvpDXLL8DjOy7maHsv7cmTj6CZg0/Xhv1vg5FBzwmfrg+LLStvWfEpr7oPuq+0vh7vjlpRT6gqPq9EwThPay9Q74HChY+dQCLPhc8mD5HVU2+Er/bvIEbKz97AxK+PT6tPRpBCz86n5e/9KAOvs/yOz5pG0I+V1c9QCbD7j6QKhG/S7DlPKHgZL/wPy6/hmYNQOAo3jzmmqs+vY2svtSq9D4McwA/brELPpWAy74eRwu/qIiqv+kxDkDvgTK+nIiIvoOg/L3K0uW9TYUawIwPvD6Mow2+eP/dPnOQpj3vxiY/C1fgPnAJtLlAQQhAzjK2PeklBb91+xu+6hk5vXy6nz9Wa08/bobLvlkoSb57WPU+LOMxPuQXUj+/HAU/7XBVP26TV794z3m/NoBUvlD02b7+Tp2+KEsFPrKK4L4J9Yg+CaOuvxfEMD1q9r4+mKUEPxK8CD9sSVs/9JkIP4BGlr63XVy/fduuv8YDND+4QqA+GqCbPgYa+z03PO2/KXZ/v60a+b5c2je+OwoAP2pr7z7QgQO/YJymv1KVTL0DH3y+8rAZv+0p4T5zHr09nT5GviXICD/ORlM/KcBnv5aGNb7Na5u/i6yEvtprID6CYdi9Y/4wvCTSor9jH4y+C8/0PicICr+AUHa9Az+EvhR44D8/3P27uAe3P1lkHT6uzS+840FxP92d3T+6Ho8/fha8PrdyDT+6cGY/",
        "RIoBPtN5M70H6bq9V/DMP7z7tD+yJ4G+rloXvqLiH7+7Q4S/C7YAP5FSr75I974/STAwvg9yVT6MRAA/bZjGvxViNz6P1KE9d6mgvkeCMr/BGwG/NAYHQDrzW8CVjw0+qL+pPxU34z5cD5C+crhUPrkgKD8gSL8+vc6oP0j0Nr0+2bA/5wuWPLlr/z4bzJ09NHFLO8W9MD5IfqQ//r14PPwcGT6YsO++08D7vr1vxj6idqs9bGAev2HrsD1V294/IW6wP7/KK76myAHA7RJ5vpmqub75Sxc+o9BRv1pVgD8kmfc+ikdhvYmnzr0Zf1M8p/AKPxpuWz4WtZ0+k7ptPsjTKb+HTOe+R7F/PiuKgL8DyYW/RDKLPiWHUj4Lp/k9felUP4WDrr/n8kA+dT+ivYsxCj+R9si+7CFQPhIIbL4/oR0/KOEZvjsRSj4vL1C+eZ30PsnixD1WHWo+P4OAPpNjDL++2OU9Mpctv+j1Xr48UT2/4s4Zvig5C79pKm0+e54mv6Qs4D6SzAe/3jNsPjBnOz4lgm++Ckopvy77pL732eA8vtzGP/ncs70O586+cPCWvjYVoD5WYrm9L0SFPmCQDsAylrK+eFQxPsDqcT36wIw/xlTpvVAj1z9i8AHA3YjHv+Z+4rykTbS+YXaqvjPl3716yEo9Toazvx/x6L4kkS++IeGrPg+uur/4i7Q/nVLtvi0qvz46pbO894NdP03SkDxBrPM/p19ev8DDA78ns1y/MBsyP6+FT77eS7A/n2AIPzVQer+Qqvq/OuX9PuGS3D5tsmU/rK0DP+eF67+AKSu+K1xuPjkCDj+aLzK/aueQvXGEz7zOx+I+wJTfP4M/WT72W7C9097wPjm+wr2UGYa9ITwwP677I77nsZu9D+iGPFAFD7vCPJk9pFutPDhfrj5O4zQ+T5+SPiuKpr4ottw+LkzfvnVIx76QYjW9wmnoPn+7oj9f1Py+QkTQPnu6mL1TgoK/+SqfPhu8GT8h3YC+L1Q3v/lfsD0PYua+",
        "NzSJPT8n8T7HCdU9ISQBP00vAj+S1Eq+I+iUPqvfR79GXoc+jHZwPkBre74rwye+Cb74vlLE5z5IA18+iVZevrKkvT3e0A2+fj2SvzM50MDT7Na+7fsuPv3fh76gIww+HIxFvq+YAL08NrI+xuuavnEnhL0U7KU/HUwBP2e9ST6Ip9e8k+pCP1OeBj3GYbu+ALzXvC9ydz0f9pa+mraoPnyVhb4/bIm+KfETv1ezUD17NqU+RcEKvshfMr44rOY+xJViv+glBsAk+FK+usRkvbiaAj5paHk83yOrv6OEhD9fSgs+Oip1vq6WBT9c4yg/ICkaP7FKMD9oP3W/Ka3vP1bJj71twTE/yCLivQkOyz7TT1c+lBk2v8hyGT8Jujc/LmNRvxzBpz5lvPa+03DJv/8tsr6UTzO/MIV1PfboZ75IeHu+ngJmvhbhF8DZPS0/AYiRvjVg17+Osri/Av+rPuD67T5rMsk8BOULv4TdgT1YkKa/no7BP3Dqxj7K10+/iu8fvqeoGj5PGxs+C3cDP6JuVL96wia+tRMnv33Amb3B6Vg+cN2ZPvDe9b5sUCS+nxkxvlbs2L2dJce+cH8xP5cHhb8rDOm98kpAP3tVgT01qQS8S0ghP4VM5L5Fa0k94eIevwfm/z1EHBC9eJwAP6uTrr61qHE/m3GtvaSZjj4O0Oo9Y10GvrwNpr4RilM/85qgPwO3JL9Q8mm+ct0hPoo36r9WcJc+wnnxvDPnwD/au+++mzY1PlmqGj+rhta/TtbYPIFf3L0kT0S+s8ySPik41L6aDhlAGFf/vxmr1z44DrE/Dj8Svg/+CD9qRnW/TbUcvxLDcD1IkCE/NVyJvFK2xT50Ud6+Ba3QPpwPmz5aqCy+v2+MPrrR6D1k6RG98bwgPwUyW73ZvKm9rxPiPsTEvz3E3By/2JZHPrgJfz9eMsc+sFsKP8pfQT9lyEm/fD2UvtcR1T//GQ2/UH/3voFfvD4lNks9tQJOv5UbUj43CKk+y8cqPsHZVT5x+EC/",
        "e71kvD5qFb5dVry+EkBWPiWNFL9qZgi9wMQavjSOnb74egk9NWotwPVLFTyQdl4+57tvvpYAAD5hWJa/HPSZv8yi+796Dbw/nFM7P8XHdL7EGPQ+SqHZvKWzGj8WSno/BTsbP1Fvoz5rEEu9vZ5APtAyPL5rCiM+L/4rvozxRD3uPCu85V4DvuEqez5DMW6+oSbyPSILAT4QzTHAq8lWQBN8nr6aIwS/BAF3O9IjFL5wMEbAEJnmPu6Dhj7OD5G+ify+v2jdPj/4yo0/LO8WPMAXrz5mqca9sa9KvT46nD5vsvk+AO8vP2v1mL6I3kI+Ecm+PlVtTD4AN8e/x5ACv1Bc2z1G+6w9TjozO6BWP7+dYX2/Q8fIvbUsOT5OHpc+N8uJP+KKi71ta7o+LvvXvjGnjD4g746+1Tt5vh0oBkAskRK/V6dEPvlW9D1o3S0/ZVNjPlUG8b9wby9A5BPJvrXcn78jFpy+9bMVveup+73GFIW/0fS8PRWKh7/mgSG7GQ6vv6KZHj/cGK6+l8kNPAmoDb3oRBK+SUuNvy7ekj5fr1C/dVhjPvV1ib5iglC+ha8qvt8sUz8jLzC+y7agv9tItr/s7LY9B9gkQEjNxT4UBq0+IVdNPPtfaD7+Tho/s52qvcQgTjldARQ94IBuvqSH9r5sPse+BrfGPo+BKD4="
      ]
    },
    "bidirectional_5": {
      "backward_bias": [
        "x7TFv/Pmqb8DOMm/teHjvpT2Jr8y8gLAdOebv77+Ob9nuIC/wnnRv3pt9L/+5gzASiLFvxieU7/sJaS/Z5/ev67EJj9yY+s/r5SrP6OIVz+9GqI/QJ2YP4b2nD+2hmU/PVCTPzQ+jz/JIZA/fzjvP6N4mj0i2qI/2l/XPzaV5j9aA9I9DqUlPl8So77B4ju9zlS2viHjpz5muGu/KYGKvkKeGL0LsDs/fba3vvuMMb61EPO+mZTnPWcHEb9doL89js+qPUkBCL1I5qs+OlbIvatCcr5L/Yc/ysP0PW22AT//7o2/CLxyvmHHQb7aMYc/X7bvvRfUsb70ylu9ijimPQ=="
      ],
      "backward_recurrent_weights": [
        "USPIvkvaNL68UVs/flF9P1neMsAD57O925xZP++xzb7opL89dw9AP/8OSD/7Uu8/c4fuvnI5xj67zPe+ZS4/Pmo7Fj+lDJW/gD4KPuNX9L3LMCRAmzw2v+hHlj8aSHK/4Fhkvh2inz9YUIS/BvU7vhzP4j9253O+IbmVv5flbTvQWg4/mskbPqUd3T43cB4/3E7kvuyYvr/7AjU/NGmJvhrrMD+IWVc/qobpvgisbz+d6Sg/j2piP0n1G73Yvdu/2T4UP+sJsr/6NQbAFBDiv2ewDT/EMC8/abb2O8KWtD9ZXSZABNWUP7tnAz7vNGq/Vfv3vhe37L7a4sm/E7bqPteFJD/AXK0/d0HCvRHdCb+nBZ4+zgADv4eEBD3FZwzARvLSP/dqpz5fNUU+VgClv20EZ73YH5S+832Tv5JfzT645cm/MG2cPkcxuDye5K6+By2Ev793xT7ACUs/EkyMPgAetz4oNYs/MWIXvfnkgD8ME7G/IZ6cPiMC9j8ZJdW+PgPcvnqfG79fMv4+NG5SP1lWlz8efTi/gV37P6Jzuz62CI4/VgV5vmxvkj3gv0y/YW3cPp0Hxz+s9sW/hspQvgsG4L5/zt+9gznXPg5w5T2zul8+aLr+PWmRob4bA5e+AHsmP9IMIL3ceUG/bHWmPyxmLT3LloQ/W+zvPwTjyz4lYz+/qXaIPgHOd78ODCA+4hxzPd7xBD97O58//Qm9P1n/xjwrqcw/gZrLPvzqbr2/oNY/nce8PgsyRUBP2dY/DmChPyk4q729kMY9xOCmP5LeqT67gwg+Qo+lPwXOkT7XOzA/qKVZP2V+JT68m9y9uYeJPT+0az8RvEW/OdtdPv5bED/mPzw/6B5kv/T3gj8EaOc+4W+GPzRrNT7Q+ApAeIOhP3mmxr6XWWA+IJtiv78knD9ZC4s+07jIvgAFWD6R+i5AjoDdPmXYm79xttU/rPsKQOJRQT8DtCe/EFWtP/JsJr1VZgfArFNHQM6Taj5Ll0i/t7qiv6GsXb+mwBS/",
        "1ytoP/buSr9YqT0/4Yv+vufRE74EN0K+MBYJvYdrdz1uUxE+kc2IPyF6JkBtaSc+dlYCvxwxnL8dKPc+FLWCvkf5Hr+BqS0+W3VEP3VR8j88Z/s+Y92VviNmB768L5u/H4VfvdVF3j6E0IG+6fUpvl+LrL8nZgi/UZ/BP0hd9T4ynRe/XvkCv1EDB8DW4EQ/gA5Tvkl7FT4fxXs/ec4hPjVIPT0j6g5AT+f1vmMT/j4J/qs/tdYvPZNztb6tUAq/gd9SPoUL1D4EeLq+9oiBv1SG4T8DjTC/Oj4cPm8qvL5p3EW/BNwfwN5ZKr/mLwzAdQuZPZ1vzL3OiPE+T8k9Px+dLj/OpOM+ZkriPitcr7w49xs9QBsGP6X5Oj+Quw6/V9g8v1w0yD5vTkK/PDKIvxbWVj4SLdO+7Ri9P7ujgb9Nqgs/ufU0vqsuZT+rKe0/2FWbP7QQ6j4Rzce8DO3AP7pY7r7ynSm/bs8XPBQRqL5qc2m+Q28MP6sEOT9vaKC9rg9LP23Zj73E1o6/tUf5vklUYL2m4dU/ZcecvxvaXb9s5im/V01PvzWRAb8HKy+/ACTaPU+k3T8Ft7s+7UhjP8gzub89zus+HuiUP6BQjD9rG4A/RohMPkuzEL9YRn+/OVzuvmGHQz/b1KY+gp0hvoHLGD81R1690FxRv6Fym71D5P2+6kYAwOcYMT+hJk+/H0kqPzdjhb9riMy/HIuLvuWgo7+wgRI+yOICPVRaCT8F7KE+wSi4v6mXcL/JtbY+zi0wPVlrBz9RuN8/7VAyQDMBmr8Mcks/i1lHv7eKiL+6z0M/cPSLPyps2L5ItbY9CdCIP8WN8j7ydvG/EkPtvqczoL8NHR6+DwU+vlEnHL/XJT8/NpKBv+9AIj+KTuc8JpU2P6ffhL/k3iy/TtCCP/5zDr/eDeg9qN+sPXCpxT9jBy1AlLV2PqAJ9T+xUp6/ncEGvh5U7D7nSD8+jeD6v4/Aj79hkkM/n/HZP9+mib9ujjy/y0ObPwhawL893ru/",
        "Oi5KvxsZXb+P3uU+d/2/u4ATpT/t0Ha+Y6iDv1/blD9xryTADd0gP5dTi73RC3E/qVmcPjFtljyQRwG/6kP4vZ2Iqj80pzI/w+iBvzCwXT85/rA+TZlqvpw7MD+trghA+F2tPr13fT/rtYG/dwtAP5lUiD/B+S8/F5/bvh0Wiz0SIR075vcePUFeG78xRIS/meMtP1vKqL3UjIk/0t/zvzepGj9w5tA/OFJpvl4ToT/Bfco/kok+P8BHC8DGY/y9D12UPwNrdr+n4GE/g/XDP76aFb4bJJM/3YJbv2VusL8hSJ8/wCwDv73SND2ZcaW+Zg65v4M9HL8ZXLM+7jwOvg89tz81CA+/eBZHvlkrDz3h4dQ+shQcP19UM7xorNC+s0B2vjAnFr8fxeM+IHiDP3Zxxz4FaP2/afqTv0/MmL4MbhTALI8zvzt6nb+yZI6+Shagv6+cSj9wLSu/UQOBv0ku4r9YT7s99QWkvhk2jz49Lqy+1BJ6P/mqbL3UzDu+xET+PlILTb87FZK/2TEnPzDNoz6+ZbS/ZOPyP8ebpzzPj1s+r/b7PZD9pD6f/T099pGYPj99ET6PxIY/RFDkO4sNfz/akxLAEE8jwH7Kej6coLy+lKLyv3SSOz8ojeO+RH1kP/8xir/PoUs+280jwIrPq74TukO90tvePtebCz+8ecq/lQ3OPb6y1z/N/B4+WgntPsCTmD+2S5G/G5z7P/noB7+9CgY/+xYfQMD6sT1yrKk/IRQtP4qHyT4Br3I+tDsyPh59Gj3+MZG/KfOaP/o1kLzHzoi/kCXXPoYpD7/xWOu+Z2/9PwUGEL9qJ7y/p2luvLkRnz4YDCs+QFbQvhyRoj4NLci+dqSovgLo278LIR6/OnHmPqc+Tj7Ry4W+cn5QPR1RZD6v0Vc+9QCgvmG4oT+RXY4+RX00vi+qKL/yQdE/SVpxv29ZYr8DBPs/I4/fPy9yir6Am4G/OKE6wPZ1kj5aQo6+AhU4v7+Rpr8ndcu+mnLIPmDFCUDMXY8+",
        "JcMjvy2TSL8WCn8/1rJFP3Ji1LzI+XE/0YP6vkTlIL3TDkQ/x9mcP5HfR77iNYc/UXyEP7R/GT9cWm2/T/exvQYDKj/uVRo/4PBNv2C2i79zybQ/LLeyvWiT/z6k75E/GeZWv0Qw0z4pWFE+NQoDvo9OQz/NhRa/3YsPQBBlpj9U8C8/k3vDPsUd0D5pUX+/EqGuPvygHD7/LW++aZ5Bvrt8Mr8UGj6/TWVtvn6+iz/0BIc7kzRUvscZgr7Q2GO+geedPyIruryeTwLA6Iu/Pnzkg7/hcGy/8SSkv4aqB7/kys2/ORCqPxkTgz47ppK/Ol2sPfRoJr/lq+m+X/mFP7qMTL617Lq/7KttP8o0/b6cRCq+LvSXvocQ1j5XwTk+z7TbvrXw5L+y1YC/hnnxPzukgz9qQo4/zMzJPyKpIT9PhfW/Z8oPP4xaoL9zhNy+c/2zvvqAszyDJtg+KPf8v64RwD+YQgM/eqwnQKU7kj/4uJY/RBg0vhsEbz/iiZ2+YC6Mvuzier7IdJE+btSivrhUrT7q9u8/lUnmvw9XYj8o70E/71ePv/hnDr/2lfU+rRcQP3AtD76Mt2k/QAEFQJB9IT9/FjW/qCcvPtciI79tq0Y/t6Kkv91gAr936mK+3jISPmdMtz7aKba+GbuqP+jXpD+XpAI/eKkWPvk5k75LHPi+5PitvpuFtb+bd7S/1AvovyhNeT0yERHAN350PgHGRb8THFu/HxSgPnwgtb/7SL+/1amlP+dKAUAylK++zCS7P1NSCEDZXga/PAe4P8zocT6n07Q/f67+Pjrasj4/pew/uFWwvqBuFEC5Q3S+pNgEvwVlbz+6GZ29BiCQP3d7ED1BA9M/RqVaP9YXTT8h/xY+LTvQPhqpU77VPN8+x6w/v7E8Mr6aDhO/J8eav4BShj6wYzo+0xsBPrfEab+XijG/wJwkvyqFuT7t2+G/xS+GvxAe+j/0A0K/x4AHv9qrsr5uOpA/93USPyZNC0CwcC0+Ravlvyg6KL9x5dI+",
        "XkrhvgBbhL6yDbQ/qnRtvzEhuz8DGYY/2FHbv2n2jT+shNI/11EAPps7dL6ZAWo/rwWxPzAoir4x7kI//KN7vjOqSD8ZSkVAe3gfP27nNr/DgZG+GDoJQAHcAj+nDYM/zS3lPtdxOz+yJcI/vw66P3jtUj9tY2O/4XYiP3MA7T8WLBO/St76vm49Az8Uv+2/NapbP4wgeD9cL0w+OKLIPUAhhr+LRyg/R0iKv3W4AkCWaKw+yNeLv2oYmr81KR6/P7mMP1a4er/KYca/kWRHP3lK+L/gV+S+7qxuvwj7gb6VS1c/9mutP+QamDxej8i/bqykP/Or3T2BYRa/djSXvo4MQr+62x3AqVyrv9QqSb5AjQ2/ClsovwTRYL9eH/u/Vk49v0vCvL4nPiS/pZBNvuJPqL88V+S/08KPvhPO870piWw/z5HcP1xwwz4H8Le+OupQP5wM9z7Lbwi/SRQmPxSgkj/kVgY/Rx0LPetajD9V9wY+al3AP3lQYL4lk84+m1OevD7SBD+vcys9NxBnvtiKLr0dCcG+rtH2vlED8b5sazQ+rlocv0MYgr1Sype9lAt6v1ePWr6Ky1M/hyuGvWuA+L7MmlQ/RterPra0dj5HgIq/htYavljF5T4Nx7S9Myc0P/pX4712Iza/uqaPPyh/oL68awBA6XjmPSodez+cguw+R3duvmOaQD9bRGo+fmOevB6pBL4tamO/AfPLvy/FAL/xwu6+/BaRPqHkJD8Qb9G8lXY9v7dYmj+W7Ia+S/kqv20sZL9tYJE/leklvhPOgr8tIm+/IDS7v4SYXb4ZY0M/QZsovsV/RD8TkG8/OryRvN/q8764Wqo/I2EKwM8+Rr8FyaY/10BzvgHR9z0EwxQ/Speev0sS3j6fBAu/5ovJPVwMHr/m8Fy+/VfFv7cgOL5t+zm/vUEEvpmQgD+UK8A/3bhIP2bqsT4m3Uk/QYYgP938oz/S2LK/1yBDvyp9ob6qVDo+/5RJPyI4pz8HTSK/egH+PQRLrr875nc/",
        "F6H/PW5Lrj8ks40+PBemPsAc6b7z/hM/nO3mvsWtZj/bIie9QIhtP6KMO76qnqG/I5RuvupsgT+Ypko/Qj+gPqrSn77q+/i+HoZmPtify70g7Aq/wGLIP/Vh0L4OE2g9xHkiPtaEDL+YT+k+xvGRvmPjir4bxVA+CigRQNaVbr5A2529tgPhvjS+az6HlTG+zzpEPkdaiz/LX/q9SQ0IP0/nxj4tRoC+Q+XYvoUOjr/awcM/y5QDvlYqSr8EM7E+T3g3v8e2+Dx0X16/JLTavu28477jwUw/FzYEwKYcmb41IIS+UuiZPXKiFD832H6/Yx1IP+vDOD/8V8w9C83Mvg=="
      ],
      "backward_weights": [
        "n77Pv6sFiT9KpDE/vW9vPkrt/T76/yW8wkRiP+PynL9j9zq/EVA+wG0ZBj+oWW8+Hd8KPhyjxL4ULMq/w1Y8PzYXlz40jCo/EayuPY52Dz8Tm+i/vUE4P2lHuD+uKyA+IXbfvvxzB0BYJ2w/uZiSvrOzh7zesCK/q1sgvOgIGD/Mzf2/QBW/PfvZ7z1F8FU8pBUWvpnq0T7WoV6+mG4SvwAJGr59Q96/xm7DPVJDaj1WP1k9jCPIPNyeMD93Rrk+JIYtvzVRaD/bAAjAaOo5P/PcZT9AzqU/v3wPv6Q3/r7bu5o+/aCavrsr4jsqlWI/gBwmPrAIsb/OV4y+HMWVPtPFKb/b/4q9/AXmPvN2or6BkiY/3vT6PQZ5jj6cbqE+AT+fvvObZz+Ci0+/sVbfvhK5lD4Ual6+1YEPPSnF0j7qQnw/FwA5Pvh5oj7i7M2/fpCdP5dz4j770UU/UVoOvyl2lr4bQDu/PcPGvh/n3r5pYY2+arxuvjvIAr9viAU/JcJiPZvNFj+zvlk+4i83PvjBVb++UBM81YkSP27NcL6+Ifq+rImAvhBrir/F89I+nPb+vbC8hj0TvpI8Be/pvUisJT84HQ6++8OrvaM6LsDs9Bq+NqjDPnwgnr6IPA4/+V8svwhyUr6zpzK/Hm0IPY5FTT+6BTu/sLxivuTQVL/Qzqg+ZSWfO0Rajj2fufU8nXrkvlJQD73kYUa9BKAIP+fxK74ROGw+YDqXPvvUp779OHI+mparPZvPWT6TMHU9h27BPjOWA79hnnQ+EUlqPZcHOr8YpBw+AfSPPVcSGb3lOCU/0Gk8vUgQe74sw/Y+fyHcPjSFmD4R8p6/f0zJPk+MkbxaHB2+7OtpvWLx/byX+1s9bOKCvt0exz7O2/i+bVJrOgZXlr1L8rQ9fLojP/uVZz9r2c0+3wBwvg3DYjxiY4u+kOXxu+1nPj20hEE/QJD8vhO2dr5JdNc+z1EIP0ssAD8T6f4+Qcf4vtF/s71tqQS+QCUwPp+OWz2WTkq+",
