{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              20
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Embedding",
          "config": {
            "activity_regularizer": null,
            "batch_input_shape": [
              null,
              20
            ],
            "dtype": "float32",
            "embeddings_constraint": null,
            "embeddings_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "maxval": 0.05,
                "minval": -0.05,
                "seed": null
              }
            },
            "embeddings_regularizer": null,
            "input_dim": 29,
            "input_length": 20,
            "mask_zero": false,
            "name": "embedding_1",
            "output_dim": 32,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "embedding_1"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 5
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 3
                },
                "kernel_regularizer": null,
                "name": "lstm_4",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 4
                },
                "recurrent_regularizer": null,
                "return_sequences": true,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 64,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "embedding_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_4"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 11
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 9
                },
                "kernel_regularizer": null,
                "name": "lstm_5",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 10
                },
                "recurrent_regularizer": null,
                "return_sequences": false,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 64,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_5"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 4,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        }
      ],
      "name": "student",
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.5.0"
  },
  "hash": "3e33280d81bfac33bc3321ccdb392acb01a4dc6544956129275a183bdbb60bf6",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      20
    ]
  ],
  "output_shapes": [
    [
      4
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            20
          ],
          "values": [
            "AAAgQQAAyEEAAEBAAADgQQAAEEEAADBBAAAAQQAAMEEAADBBAAAwQQAAwEEAAMBBAADIQQAAAAAAAIhBAACAQAAAsEEAAABAAACoQQAAqEE="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            4
          ],
          "values": [
            "CapmP1XUoDvuBro8siCSPQ=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "bidirectional_4": {
      "backward_bias": [
        "Z/rzvhPIwb6Nd5e+4fU9v4BVQb7I1Ye/OYoVv5fHzz1PHoG/6boEvrY+8L4RiSe/hKP0vnZlK7/jYQu/dtVHv8hhO7+EQ5e/3H4Dv/A7675C3oW/4UKNvu9NCb85FGG/qE0Pv7taar8XSa++oq4wv8FKHL9OEMe+IRoKvnm8Jb6xg4q+DzFtv2akMb8FWM09RHidvRNYQL8lr7c9IUEAvo+R5b7mayS/o37lvUo5GL8WNCe9gRNWvy6vwzuXg1u/k9S6vl8J9750qTi/me1FvhGkPb9E7JK/jWUkvyxL/L4YHh6/Zd1ePl82yLyO8KG+DAoMvvchSb/97tS+WqSxPnIZKT8U1fg+EKKfPWWpQz/ixH8+nXb2PqjUHz9iCH0/t2oqPo8kET4RFdE+dOf5PhbStD7V8Yk/GFUQP5pXLz9RoK4+knbtPvbr9z7Ecwo/T9oWPx+emT4i2Oo+bOMnP3qzJT89OCI/QYegPp5AKj9TCaQ+JRxLPwMAUL3O/wo/w9mlPpgx9D5W6TQ/bO8iP7J52z7Wwc0+BWPTPpbM2zxL9mw/pmxKPp530T6XgwU/DQPPPocaMD678TY/cOYyPytuEz8ptUY/k9oTP8OO/T690/49dSkmP9NX6j5MfBM/0eX3PmoWQj4US4I+Kv+GPq2G7z5FGTo/8LJWP5m9Fz9VnSA9UY/bPSnbrr28MSY+kuqCPTESnD6Er3y+jOvOPkW+0jy+jK09V5C2PSiXDT5aW5+9Lv32vD/xk75wHNy+2PUhvQibiz7c/SA8ca2DPsUCV7z/ucM9N/2IvuCcEz5WCLe9+Nhfve/ver5ppVa+WIjYvcdLBb69b5295li9PuVHID305+Y9F2/HvVcy+D1D/V685BZqveqJPb4C4Xu9sF2HPaiZ0j0tI2692GyhPopDWz4+gKG8hZeIPIKJNT0Kuwo+uEI+PgPFprxkAgM+WfpZPYypmD7tUJc8gnmDPm8t0r5a9T49UoJ+vpiwLrsQgqo+I17pvha8Ej6IsMs9",
        "RH/kPb5Opb6ArZm+tpiXvWz1pb2Z8V++E21Nvf45XD2Iw4m9T44Lv4dqZ77l7LS+PagQv07KkT4dywU9DfS3vYNVgj2iVpm92pWkvJr7jr4j1UW/ulcNvhCe970511u9pjGBvndDF74KXni+ddoEPsr6RD55tji7WGwJP9K1Ar4d37a+Tx4fvwx8x752TXK+V2fIvoHopr6fV9O9mGGhvEmkFj6c+OM9MHhmvobnwb5Obhg9iN2XvHXIwL53jxO+Ca7zPjH6Jr47FyE8DmvLvsip2LzM1tu+ppGbvsLVkL4QtDO+Bpt4vla/6L3kt4e+rNbZvjseEb+xnMa+xpPJPQ=="
      ],
      "backward_recurrent_weights": [
        "yJ0TPz2/ib0tiQQ9jVDLvofxXz4AepE/IqolPnZt8T4zho0+qtvMPnUgkb5e6fK+GU/XPR/jE7/Xe5e+/ksYPhAoEz8E/0W9Ojwvv4LPoL5Xel6/dX5Bv+E/Fz8icVo+qlGKPV+Ngr95UIQ/Y9BsviMz8D3fb549m+6bO9GANT3Fj5e+YRo/P2dzQD+1Uqc+a/qBvZmekr42y6e9y5pLPt9F3T0ILk2/MvoBv6OmBD+HpWy9m7ADPmUCBr9V564+DlyDvjlxQb/0p/y9jF+avkmqML5q+gQ/m3W/Pfn+Mr8wIV++udS3PrhFpL1+bYo9+ljDvrr7zr2D3RA+JvVsvxYgKT7Ifwu/A7+iPWhUMj1njtY+I8JwPlH39j7FGb48Fj7+vsoOY748arQ6HCMuP+IXND6ExM2+h5Dbu5uAvr7Gyma9sZZYPw6JLz9aQPK+4KdmPxrsEr7sen4+9HHZvozgID8im00/KIWKvmzImT5sHmO+SBQJvoQ5I7927ba+gECIvkZr3b5hy6a9A6vXPKPA5r63XA4/Mysyv9KPdj6UlQo/Xv7PvCEJj76Ix6w+wFpQPwt6XT9zD5C/XuFsvi4cLT9rvAS+9FuRPotwpr41L0Q/jkwWPzxmK71zf0K/Ki4Vv/9Ybj+mA7Y+rAazvhz+oD6c/eQ8tux+PslN4z1c80m/QYD2PT4e8j1dLBY+enmWvkDPGr5Z4Fq+6YqfPf+v0T73ZXE+ogwkvVX7XzvkfM4+mO3nPlsnMz04k64+McIkvrnV9T70rSE+UdpCP0tWB7/bhrK+Ps9Tv38rvT7eUtM+Estovp5rjL4qDl2+AkW6vkJNuT7eZ44+t0f3vp/RzD5awgc+503Du/UJhb/1DZ4+cKSbvnhkwj3RSiM/Qs0+Ph5r9D1Gi5U+06OJPhmIPj8NN/a9JYAMP2vW2j0Q0r2+MyqvvqRKWj+SZdY+nxqnPnDg/L7UsFA/+L3RvfI1Xj1QZXm+5i5hPKClir7QsAg+ybcJPokSUL7eZFe+",
        "ZWxFvuDl3b7poq0+0rYJP7zRRj/8Ifs94s8OvpPTTj+FreC+DEm6vnRjg70EgTO+D8oqPps1ur6SGvg8LDoRv88Yqj9OKmE/jUeYPZ1WoT5TvsG+WPliPjh/AT9hEpQ+zKs8Pg02Cj+1U1s+c90Ovl/Fhb5uTE4+4DEXPrREV7+N+NW+qBC3PQyU0TxFR1O/ZdEvvnwIUr2W8YW+ixDHPtlEhL7oY1I/hNV5v0Z1hT9kViQ/GR2ivkYT+r7yUy4+212dPvUTgjm2Y+A+yuw5v+ZF2z39n7i+T0Quva/e67401n2/Um81v7UNg75ucKk+CFTuPhQr6j00DoC+Ssebv793Zr49yNk+zwIoPpQHZT8uXYC9Lps+v1Ap+b4oyIE9D/jgPbJDhz6CbFi/Fs+SPnZwcb8KTY6+LuucPwsSnT8oJnO+L+kTvkZt+j0agla/cVpcvuySmj7RgOe+4YBDvgucyD1NypS+vQx/vz3pKT0vI60+gJkjv+xw971J9C2/ARTbPTHVjr3oSKe+hZ3avUtX/L4IKZq8E+ndvLfVSz/kmf0+KG3+PqxAOb/Cdtq+dpWPPh+RHj94pyC9/cUxPsd1sL5HpLo/H3dMPwI22T5kVVm/Clshv3z96r4CFZG9lITPvfeLnT9RP5w+KPuOvxHOP79bM7I+WLyvPr6zLL+UkJA+eFIgP1X53r2AZVg/Kgoxv0AEDD28VJW+5c5jvtQ6Ob66mH++QKVMPoNWBL+IzBU+oc2LP0tWNL/UR1u//JuCv84bKT1/MTO/2/7UvlVOLj+7neG+G9qkPcfMJD+WLiC/3gwbPzdLWr+oTiq+Kdh5vpks/77igqC+6qzvPYtYaL8dGMw+kmwFPzczBr+44Ds/+b0/v3vYgT4vj4+/fSTKvtxG8LwQRxc/UEZZPoh/8L2tWQ6/DwETvyhCLj+f4Uc+ZIMov2CrEr5LAgY/x87jPpN8Bz9MmL8+20vAvYrtYT7DppU+h+a1vUesjL5wcFS/M96Nv69Auz07k9O+",
        "LztiPlLOi77vvEY/6eXePnX5oD7tnw8+SGYAPqInAL8IPmO+dAEKv1HQrz652Ls+T6ByvfthKz6W8di+YVX8vjjjqL7VVI2+H9gfv7pYlTpVPUc+NV4KvunGzr7c+Qe/5QJoPgsFtD7mIoI81EodvQxXuT0+utA+EDMuP+JVJb2KlS8/NwkOvuTunj5zx1O+8uILv2JqF78M35q+2Qm7vnERAr50AMS9UVuWvKLNFz9zNq49kpUDPyNVAT8ig9S+XEhevVPLwj67wji+Nou2PvUw7D47QPC8YgrWvstwbb2Mx7M9E7t8Pgc8AD8H+vU+877LPmpxET/tNV28bMxrvo6Xdz6khtg+3icwv4FCvz3dHJ+++syCvjyZGL9m8Cm/7wkEvRfpz76J6xS/1AX5vm80UL7oeeO+geI0Pv/Ktj/yV0o7duHsvYvgY7/LTHy/4vFUP8Ok/L6a6Jq99o2/vMoZPb7ZhIe+MDkcv/8dVr49eh29uv8cvxh7FD6KsyG/sCo0vo/Zfj5ioZA+Xq+uvQMBDL8BeC+7vmutvaN9HT4rQHO/lhnRPiPcED+6Jda+EXZEvnxZ5b1VPmi7oBv7vvuIKb8UvIg+GuPDPcw7KL6o0QQ/KnAyP7cCT74H79a9HujAvBevTr93lLg+dTA1v9oBCT+hsHe/Q/9ZPiCD+r5+iQI/ZNVdPrzUgL8dQkg/I540P5e3vr6DGWo/N0SQPozEET4LMR8/mvUvPAkwtj4tgE++FngAv/mIVz/P/Qq/auifPKvbkT9M8DM/I9HdPQJCpD8hjue+x8JWvqzPdD/nUnw/d1EbPkEZjT4N65W+vTppvrbZG7yD+58+e5K2PnH+7L4Pcb+901uOP+LuCL+qzwc/YzeOPQgKeb1JfTo/TYCSv2ESvz7A0eO+pyxevmDpMT7JzwK/DVYnPzYA/L2zvoM96yINP0u9ST+1OvQ+ZIjMvjO2nL5xyqY/Uw4yP0dd1z5aKew+xvFAPjDiCT7nwKO+PSTMPlGt0r7xvha/",
        "jejdPhQ4l75WNB4+ahi9PvA3h77V4k490v+tPcwbAj7g2Ag/JpYMPzgwm75Qla0+AD6APlGjJT6csA4/td3pvu7iMj/XUNK909AVv3Q59z4Le4Y9wekMPxEY3D4Mgmi8ncXDPbHxVL9dlge/njsUP6kiIj/bKow/VlOtvi0Qj70WYhs+T2d0P+ZgAT+m1oo8qzYQv2zwPT84LRM/Dy6sPiPCeb0Tcjs/9F+ePEuh1j6BC+29jm8RP7w8SD8n/DE/kW60P7nPsT7C+bC+3xNgPH35Aj/Z+5Y+2keuvAUG4j5/3Cc/kTEgP6VHZr7O4b4++9kAvn9Xaz/z1Im+Rf2lvpqJJj4h3CY+VirlvuPorj4JqxE+QsErvunZj73sJSq/RA/cvkdrqD6TmWC/j4/1Pc5hML8ujnI+byhVPtR8hL7VXaY+XMoJPwxa1z7HPZg+W3XxPhPrRL2yhsa8vhyWvmxHrD4FRqa+A2A4voUejb6cZYm+o9kuP+xUlD3HZti++O1bvNXD+T2xrV8+GAmtPqqUGD4r4Ds+mdEvvY1d2D4gpYY+AwGCvsQyGD6PXMW+gUr+vqMs5j3TRca+DPQcv2VOMT6/9cA8AGxyPg12jTzqkvc93PR2vjs0/r2A2o2+1ZNGPolOUL4klCS+by2svkODgD9M83m+2tsVPw8w+b5LgzI+wpC+Pl/r6L6XBOs+aTgHPp/3fL6SuVi+PBimPYQp+j4x4J8+85qkvlijiL6NHhC/44E/PAVHFb3Ws0c+xMXFPYi8HD56JLg9dMczPZ+lpz6vnUk8Cd66Pg/RjTzCGfW8faIBvvjDib7vrQ8+e1m4PsyqK7/BgR0+2kslP6Aro7478gO+nUs4P0QgF7+GZ5O+ivwIP0/7sL4ynOo+PIcRvzSB5j6v5Bo/ASvgPaC4WL6adtI+Enh0Pz1rjD6YIeI+TW9yP5gGFD8bKX+/jL5rvaXDC7xVZa4/vdKUP13erT46Mou+LM8sv6SeFz5juD++cOu9PkM+ob5tXcS+",
        "kUqgv6XlRz66XHW+SLAvP8HcWr4H86e/1TmsPwbczD2Y3G++gVU3voqSk76dJlM+I2SzPuFy4z3DYpM/UIdYPibwH78pq2I/RAWwvYH2Rr6xG2s+LxeuvmYK2r22zag+EtwovxbXID9YHlG/treJP22swT5uOH2/LTsIPpy+q75gtIk/7qT4vmg+0L6m3o+/IxNAv0F+Vj8644s+N3QxPuuP5D6g9z0/84+ZP10Twr5MFn0+B0iUPj5VLj4kr4K+a66RvmEvk77SHUm/D7B6Py48iL457iy/iNJmPpCtCr5dGOA99DmTPmUi3jwlQV0+0mm8vhp+Gr2b9Tq/AQ6GvP76HD4lBz0/2gn4PVvKxz60Ybe+KDjIvsupgr6oIwW/Bjptv0stCT9yEys/NvX6vlXmhb7OfUa/E0+gv02o+z6coDG+keMbP1Rwm77n12e/TKfgva1YJT4pP0Q9jnXavmZ3rj71Q0q+B7NUv9bbsb6d54s80quAv5K8kL47Ace+EB31vjXYHD9u7nm+Vo1wvsl9ZD7Sy7c+eeaCvXJ03b5fge6+5jTdPNCp/70eqaq+bCM/PawTEj4QA6m+T/+fvtvBbL7LLbm+CESLP3KuJ762dB4+fPikPvzxIL83z9I+OpwSv8TKwLx+nVu+v1YmPrAYjb4tjL69uCYqPWUtlb5jdBO/EJLVPrm+Eb7oOZa+kbCjPueBHj+Cz8M9bpVYve7Suz5EjYU+c1TLPdVy9btvWp+9lUKHvtz5DD/aqla+i/2yPbRykT77EVO9Ej/rvhZHgz4H4yk9QHU1Pr575r0yVR2/PsOIPpeFhz5ReO++wTBIPqCzx73g4tY+xRMtvqrEQj7YI0m++DjOPYkj0z5Qj6K9sCxePsmixz7DEMy+d/+nvhGgKr7KAB6+oNxFP9y4GD7httY+mO2Uv32pQD6X56m+SbcCvztJkb7aaRW+rnejvT7KDD8MrLs9RLPoPRtiVz5vHxe+t2YJvVZ9/71P4qe9OVaTvrfwV75qi+q+",
        "RpMuPw/kmz2QpTa+mjvdvc/Z775Zeok+ehKDvvnn7L6E/Si+rWwmPzHltL6d9DI/J1iCPaXwib5dTmy9rxuLPtsd477K2hE+pRyHvpCqQ79t6fU+61YTvwAYAT9ddDG+/CG1Pof5wr12nYS/UaEfPmDpiT/AbiS/CpM+v7z/bb+n/ZA+W5ZAvy+B+D1KfrW/vB+ePpB9Mj92UHS+nr8Kvw95ST8j6Ku+9OkmP+vdWz7f51U/GpR+vcwOiL02kZe/zueMvudHoz1ZSr8+GwhIPjZuID6aBBI+dYZdv2LH3z6G6em+pcfoPJlJfL5Ecaa+P6shvxsXrj6Tb6u+4JmSP2yTvr74HKo+AaAZv4Lbg77f70M/HniVPgjhGjvWHEE/uO4+v540Kr4ZJF4+Rh6aPtfFvb/7hg2//q1cP3JB8b6W3Ke++CwfP4vk+D0AZXy+I9+hPbTo2b6EQyK/wyVwvotyjzwvizk/4pEgP9N8MT+yO7E9QawfPQ9vBb71rle/OVS2vX9Ahr7pACq/zmUqvwjBNb+ngRg+E6iXPJcYFb4tcmU/Jnsrv1mHar9kvfq9B1dJv/AsEL3D2Te/h2H5Pknd4z7YO0S/RiaBPz145L6e7ck+0hjIu01VXb6j/tu+3SuZvl/s7T5b6i++pJYUv/0lkr72WRg+XCXJPS1Wub6FfkO9eAqJvqhGQz7r+Eu+sxcqPY7yurxaCWS/digZPxuKdL9RKJm/ToUTv3tPR79fT9e+dQKWPkw0jr92NC8+auTCPQz+lz42kum+Znk2vwQOlD7s8ZY+Cd/7PRK/QD7eLly+RGdHPonyrToRtni+MxtgvCvr076I4x6/BNiDPpJmjr7lWAU+YPUhvuv0Pr/gYQw/ZquFPwngvL4yNBK/daePvtyKtr41DYe90aEIv0pHSz7An4W+GsqSvyi3Db71Ofm+NcIFP2zh176lvgq/HYOHPnOsEj90dj89kuGTPwMgU75m8xo+ZQHdvhebX7+3KyA9akZxvyx5qT1W82C/",
        "QZmPPhkFmL4TysM9t4I8vbD3/r51alA+lM4BPyTgyj17f8o+Ic9rv3q4Kj3i8jC+E8jZvDsPYT6C1xc/fdXMvSIGNb5vYpU+xhcAv7PcBb8CMwQ/SWrWvvlDB79bjKE+sqlfvsfRF77BBh++kWbtvoIknj5/dc8+A2mBPYnEJb6O2oU/loNbPfwWBjzrd+694ujAvpCq3T1pfik9xd2WPiDpob71xBE9rdnNPiKizT46Nae9bzaEPhClVr5CM/y+en9zvuSEPz7RUyi9LEUgvsNrAj8gDAy/MNudPi5rYTzuK8E+j+VivlGgJb53/E++2weUPrPsWr2RuAi/XnAwPgX9Kr4vcp+/cod1vv+CZr04uA4+XxobP0XnNb+JBUI+T5p+vrrlGr8EFT6/M8jlvg/RkL/5kei+Pb1FvuHS7D49nJS+jSrEPYiFsb5Yz86+nxX5PNdCk74yUSS/DhKAvuherb5S45E+PSsxvuzrJT81I9492JX1PSz1B75NAPq+Dyq/PhWQMLtEvpi+zCsAv20xpj4gN+8+U6uKvjglubxUK2e++tsDv6Q6Gr7rSjg8nQ3HvmnQXL9x5kQ8VCuqvkGbNr9ZSVE+tJO5PiRD3L3uIsY8atPyPjB5f7/lsX4/yMcuP/A9+L6ZLEW/SU/LvfTovL5Fb/K9F+M2PpY8B7/VT46/ucg6vmxiNj8qAQe/wyMkvt1Qgj1EogC/RxfbPqmNNL4U2FO+hJL3vtCdHb84zD8/iDWLPDUGL72UKtU8SicJP9k+mD7XFFO+DelSvlzIzD6bbOg+sd1mvsCllb4bMAO+lvTGPtvu576FhCW/K6JPvyrjL77YaEk+ET8+v4/BP72HiWk+1OyXPuFmTr+ngt6+opL3Ph+2Zr8raYw9B4XtPf3mdL/SEQI+Ccgpv56aDr9O04u9Hmm9PjmWXb/+e9S+baWlvrPkGL+Ep8u+828YP/y6Ez4iQzC+iizaPi4anb61e7S+3ECkPpkaHz7lBT2/NGIkv611/L6kxTG9",
        "SxapvnNlyj0QyGK9xSQXv2Ycvz3G6L6+KgotvzG+hjuNs4W/BGPdPpcG3T5Ql5c90YwEP2IYXL9Qh26/9xMMv8NwPT8y+Kg9VR96vmX7uD4nef6+R11WPgYp5j26cji/sDqsPp/BiD2pulA+s6snP3/fFD8D3/O+9Jn8PhI0G76NkSW/ADj2vhsE8L0RXB6/uq7KvoK9S79oZw++es0vP2f8GL6lBDU8gTHxvjvHrr6utj2++r/evqm7qT6iTCS+Hfaav/H9LD7Ljde+oeZQv/B5Zr/0rBM+1Kohv4mINz+iy5O+KYjMPrDdLj6+rQI/xtCGvlDKX778Elu+uX2DPsis3Lvnyeo9mJEdv8cJFb9v+10+It6Bvpf7QT5GFAY/a6aWPo5CBL5dghq+7NyHPnugcb5zJcO+Q7QqPjpt6Dy81ve9u+dLP4P1qT7SZsq+mj2GPlL6mD1kWiw+NsVkvkBxeb7GBoW8XKfdPo49+z7F4NQ9CkhYvesAVT6Ndn4+7sOCviIXd74SgCg+YUAZP2F6CL6mftM9wegeP8m2vr4FJZc92tUCPly4FT/Q4509/3alvnOyxz4vTY6+xi4tvDtVWj4X7Us+AoIcvyuluL7w4RW99JZ+PvoTRL4AE1E+ZN/1vowGBL+BC0O9mVWlPmrR3r4hUxi+nyUFv/oi9T0JfBi/ChplP8WzUz+I9bK+abdTP5PVDT6GycC+CwUoP73V1L46GYQ/n6zSPojqNT+4K+I+DLQJvzaIFz+DvHi/DFkfvZVlibt25g48HQjdPY4hhb+DeM0+SKIpv8uc2j5g6NM+6+cBv+2wj74kxag6sYZFP6LYGL99J0Q953xrut2psz6G26e+QRI4P+GwN7/I1tg+xn7OPsaSj79kdwo/brWmvYZuWD4nr5G+uyB9PknEHr7YmX2+awtmP2DEXD/eoSi/EBfVPpFKNj4tqXm+ma+tvpDyuD4k09W+HsCGvbzhKL8/5H8/lpr0viQXGT/KRNQ+HWbJPSHXFT7OF589",
        "/5A/P5Htuz8UdwY9xD4Tv8YPPz22iV0/XG4Tv0cPSz+sqJG+w5P7Pgnn0z4wpu8+BJwEPskslL7iOFW9iA4TPY0fqj0eYRW/TnlgvxP80j5fDQS/ab77u77EDT82Vvi9N2hPP+Q6jb4fBKM+hyAWPo4zJL6r1z881M/ZPsQa6ruVBJ++oj2xPjL/774ldEa+ox4Fv4A5Nr2F4eS+RQywPgoL4rwNWLQ+xYGlPjXc8j6zQJu+tAHuPP0TNT0YA2e+fvfVPZIwTr9sNWk9xDPnPS0vg71tKGg/CN4KP59myb5A9gq/IB8kv1mnsj5oMaw+nchxPtvNYz7d/re+2PLJPWYFSL8Ni1+9k9IWPgQoI75U81C/TM64PgRKZD7d9jE/FXedPnxYGb+oLdc+YxWOPW+/6T49mVs+MxLavQKRTD/svZQ/FjESv4qPwz5eJ9C9uaWcPi70Xz+sAq4/ZvwVv0XODT678xw9mLLxPt1h2z1jQsm+3tPbvlbKIj7W/Pc+WlRDvpTA1D68j5M960aEPoNLCD8/6A4/URLoPqVObL7Cm8i+KgYyP4gkIj96Xqu87JZ4PbMwkz/cquw9fuIcPZk5Fb8s72Y+J3KWPqAjh72swzc/zLmRvgtlPz6J9+a+p3/gPsNKbb3yDiw+9pAEP/OG3D6KwAe+lg1FPvN1E78+OF4899bevkBLZT4kZk+8QFY0v+kSzz58tS2/HDcLPiXDxL6hNkS9S6uvPYHCxT3PshK/2wSEPd23yb4mFoW/BBMgPTwN9z1IsKw+FhpjPc0gwL5Vu4y9P7IZv2FLRD5Y4sO8ar6yPkUvAr8nEqq+O5nWPv43Z77qBTY9GoMEvzj6DD7RNkg+wvayvQkYvT4z1Fe+Yk6VPb4m3j0g0Re+DX8GvgA/iL5VqqC+9NLxvk5Ysr706A6+Dnv5PvzP3r1Us489omVVvp2zbD77k5y9KoBIvszzhr4IicG+r10gvuuLP77CZYI+ZXkEvKU9gr4Hj5w+RkREPjAViDvhqbs+",
        "r13UvsFtMD+Z76w+XiEMv9BEhL0W7PY/2z6MP1+BFz9qaxQ/O/oCvznsOr/LGHC+r+/0Prz4TD4BNGC+D24BP6wtLz8uPQo+LufTPocaXr3wjqu+ciPhvtqtNjxrjDi+NCMqP3EIkz5qnHc+iJEWPxIyab4Pj9G+cDgUv2M+TD+YoqG+MyX9PSNqp76cJpM93nlAv/DeDz9uXg2+8X6Av9Wr9D5/GJw/UAoHPv9lL795c5W/KSGWP51qmT60tSg/idJuvyp74T4aO1k/rv4RvursBz8dueo+Q4zlPpTsCrxonpY+6p62vouccD9DNrs8UYsWPbAJ0r6ggh0/lg5svYagXD8xMr8+0IDQvpyIKz8uU4e/pmAjv+Tx37uDrbq+i7npPqrbRj1wv7S+PP6TPg5CCr9Y3TS+PgCuPk6Vnr6rwCG/a9lQPduWAD+kGkA+UAq7vYTEEz9Fgxq/i4X0PsTndL6hJ4u+3GRvvr05Ob+Rewm9NxWdPoY0Uz3DqsA+wYTKPoLwbr2Ri9+9JOkOPijGXj+85ps+Q4vFPaDuoj/bRk+/Ww2rvmfYPL5RrzO8qk1kPgDPpD4VkbO+qFBrvhZppT1xy94/7JWQPyUJHL+LSKO9emcPvtQIMr8kz8W+ga3NPmNJ674qO74+HnHQvgw/q7whmLk+4A+RP/Y7iz7pO4U+UiVcvna8o76yj2a+g7zCPjHpdr9Vxns/SHUgvxmVXT+K5g+//B2qvViQdr6MjCg/9OY+PZQtt7wwgWC+Gb9LvzNQBD5A+O4+O08GPTwE5T0ZhwO/8iarvUG6Iz9689O+n1DVPmL7gr2jy90+8tNrPmCkSj+Y/eU+Xhp5PiEtKj+zh18+27PnPqfeCz9Zx04/4imrPhFnX74kCLW+bHEfPqhRn74R9L6+2ZHwPtCn5D0jzIe+ieQGv+717D1doqY+4OxYvTX/6b2F7MI+RvJnP91k/z6yO5I+i9KkvXCxrz9aAdc9x8L6Pr8ptj0NzAQ/mJiLvhq0cT4Fu4a+",
        "0905va3gur1xgvE+8d8kP+KZ9Dyz5Cu/oJNoviAi7L5klhO+n/cFv/u0WL7k4/S92kQzvncRCr52SNS+VqrFvt+sd77bFTy+XoG+vVnv3L1wWfG98OICP1Djez6UkUu/U6hDPh26fT8fRT49PKzcPTfmPL7sI08911evvYkvJr7vYyQ/dm90PhB3dz6Wp2++QAVWvo6upz0bLDS/BNDdPpi3sz6/KD2+B/nOvsr1Jb5ap4m9DxhZveZiDT2CWRo+emxpvoRJVz2HaQG+dNizPQudhb7VL5K+BWuPPn/IFL9SVuQ+6W59vWQqCL10rK4+zMV/viqO4z7iuks/YxIKO41d4L3tX40+UTOPvt64ML5T5hc/RmHovuYk/bwlxT6/DRNGPV9DNb+U40C/VObcvlew2T5oHNE9XtWavhfCWT1rLt2+BZa3vkMGPD25xT4/xhtMPyQzjD7ydqU98xLqvpo5Ijws2Os9pDxdvtF+vL4Mhx++x6EjvyrkNj7qchg/AfsyvoXOKz/K+oi+OliLPsQPqb2wVwM+SEwoP4wWkT6Uwdm+IP17vnuQML8z1aK+IF6Qvmz62T5VTD2/kMmYv1Fngz4pd+C7wfonv8pgl72yQh2+i+4aPvXHmj0Y/z0/oVaGP/L8Lb9jZDI+99WMPu6FCD8u54O+TR/gPbN1zj4Csh++fycAvs52OL6x8Og+boteOsfQzb6GN0Q/JLU/PypLyD4VXjm/kgFhvauIurwdcG2+wEwhPvGVhT+Cpjs/yELNvSvhdT/KbIM94O/Dvp4Prj7e3NM+zQIwPVOrz76vedG/Gg8IPhX6SL/Mvte7kFjTvmTiXj+Pjjm+baI8v1UVrz4k+sy+qcg6P1XZur2dqlo6pD83v7hY6T0VoTY8/6SXvUAJKz9Qz8W+95otPiRy4T2RI26/cXiTPcSqZL6uGo689LwrP7myjz+MI3g+yHfsvjQ2Sr1agzg/xVQYv+49yD4Xins/tJweP7YVWr/2SNo+eniOvofKNb9fFrm9",
        "WBYlv01Umr4YSlu9+UIgP19SDj7sdV0+M6Pjvl9hPr81kXo9sz4ZvxP7SL8g1Bm/+VlBv7FTNr6XiAk/9Skuv7+ehj4mwlm/LZWnvtWSkL1Qdum+nlhkv3QLUL5NsI8/hnZfPuT1Sb8J/Qa+rKcRP50XC721qok+z6QLv8z3kj62g6S+bk7KvtqsJj9EUXg+5654PnTEKj4qxpm+CJrwvbhlob4zU/i+GA0wv0a/Uz6aXQO+0PdePsl5Nz/Eopo+nPM7vSRuo765psC9FTvOvpLmSr9Dkh2/3qMNP5VFIb5DLMS+FNtXv0Neij49rNY+q0tTvt6UET7f2gc/PJgFP6MOvr2gZVi+2S4kPlSgvj7huZs98q7wvkOGE76A4Ce/uFtSv2kwC78Uqza+WRPuPodW8L1yfuC60leLPZjePL6JlCq9b8mTvi1IWb4xhny+4TGtPbdcnjwyyh0/CM4HP6SR6LyUgFM9UuoRv0Nc3T4hdxk+9+pEvg2OAb/IDEI+iaMnvj0xoL67K0C+tgwAvxAdUL6AJkk+lZPtPhgBrz0Lo6Q971WxPoz9nT05zok+PI/JO2KuND6i/UA+79hiPhjjm77Flhw/Ju2DviQW0L7AHSw+I9sEPZfkCr5sCHC95uxxvRus+74uAki+4NMXvhV6PL5Rgkm+LE8QvVh2xL38xoe+n4jHvvPKVb/9bvQ+qCcSP8fpg78s5zI/pc73vvYvsb7XHke/VtMMvxjf7b4IN3O/W9ENPF1zUz+fmAA/Ts5RvW7BFzyGH8y8zzBFv87xiz3X1nA9to29Phh3ID+Pqo+/bkegPW0Or7su7Ju8WM9qvWvUJz+fC/M+kG/WvrFgMj+yhg+/SvRIPzFDKT8dONW9BkYlPoP42r4qdjK/QohFv4hmAr/jYvE+dotDPwAwFT6vgK++lBo5vnw9JD6kRyu/8kuKPt1YjL1CQnW/DDSOvW0C9L79aks/YYBJvmRSNj/7Gk09504xPBxCpL+s07K+xBKcvsOIgL2fsOs9",
        "apSSu2qimL7p8I4+/Bi7vkfQD75rvYI+9X6Xv2yyv75mPCS//ZwcvxwaJL8mZSa+zf0HPzCzpj4fnZm+YCXpvqt0z70Hqqy+J7ndv2aJf79Rsnu+1rODP+544T6zKMO+uCASvg1wl76HETk+whg7vquDV7+Qgzy+YiBAvukGMD6KLBK/uETrvQ7Cq74kwu69dQOQPvoFhz+Zp4W+Rf6KvtD8tD5r1ue+h4kTP3RZML+r3xm9+kPoPVcRMD8oMJi94scVv3nBiT76Gc6/lmQpv02rXb7dJgs+zttBv+3GMTz19DQ/Ntgrv46yyL7hFxW/RdI5PaHuEr+eC7S883qfPsIgmj4HZ3Y+p9Xevn3YA7+7C4o+ONXkPo3Ovj6UjvQ+sSjkPgQc9z6gvYo/BigRvQ8kLj5lqom+hmB/voVBHD+Txti+iM9KP0A2HD6JKxo/+BLUPMp2Gb37Anc+90N4vYsWl71GBx8/NufUPXaWxb7wW78+YmchvxgvIL4MgUe/ZoV9PsZQBj9mWAc+kPUivz698z4csPq+2kt9PnIdeD2qbRA/kXDVPV5i9r5b8U2+w75Hv/hT5r6y8ZE9uzwxvz0J9z3sDe4+1CWKPm5WtjwAVR09TGO1PuG7GT88zOQ+UvXgPly7iD3yfUA8+VSsvqLHDz6a9Ry/aJ6BPsPXrj4e/BY+XpykP5XYLT7NYJy7AU89Pz69uD42hsc7md3vPumCJT90N0K/P4MHP3Q9zD7HO4I+kdU8vl3R6r7u+pq+VVtFv8Ys4bzOeXS+5CIcPsqWQ779AiO+ABohv2EfSz6tPgm+QcT/Pqwu1rxu386+FgyYvp3jfjzxbng+EdErv5epkT4SVSQ/U+qpvF+U0T53cB+/K8YPPzIpG75yMHM+KjRSvcGHfLvynGk+NZC9vbxnp73t+1G+A22lvca5kr6kpF69OhC9vucMhr2zWq++KexIv7D3sD4qqzs+JToMP2IRib7HIZo+e0S7vFDvSL2ERx+/4g1APp+wkr4z2Yk+",
        "IhAPv8Vw8z2qQJM+eUs8vwz7ej6ujTo/NyUDP75oIr+5lcu+BAu7PneQRz9uU7I/mk9UP7tZdz2WGgK/Jm/KPokTdr72lse+VV+cvRWzsj6rRgy+LZNhP9rQuz4F5SO9BAeYPtuoKT5D7uU+BLA1vwPmo76OZ2++JZIKvkbuv70PuWs/C4nEPuL53L4Cjty+a5xyP0NCsT7I/+i+uYHHvt8Koj/PVJQ8Qsp6v60qcL4Mp/K+WpOmvrwIIT/0dQy/uIxGP4wkNj8Cw4y+rA58P4wafT5V5w49iVs5v//BIz96ZlU+lG8Qv6Hr3b6Z2BE+WwkVP+yWuD4ZXo+70KVNvocwpD7qSYk+fyd7v5r34r0GPyO/i8anPnSjZL997Qo/lv0YP8gRWr49se2+kOpHvPXL0b6iTHG+dWAcP21j3L627Bw/JLZxPteAPT4Tw3q+MZmqv37IcL75kMg+CiO7PrbgIL8EFok+G9doP5rc/T6LItU+wVszP6Duhb6RApM+tz6aPoK6wT7iFo4+ucohP3AKCD+NrW0/VItLvSbdK7/6ree+7sFlvnYjdL84CLY+ASYCv0+YFT8XToW+R+mivbtViTwdck69PJVvPh7Hcb9mgIy/cLohPyi4CT9eHzO94qBKv0yM4j4GOYY8WZyJPiysAb+7aQa/8x8lv4UHcr/HCzI/irMcPwa34D6jpTa/w4iMPZac9ryDQCc+elrkvgUAfr8YTC++bnRrPUl0lT7u6CK+X0UIPiW+pL4FDSk/mWuLvjFDL78wFJ8+paMlvk1ihr6CJP2+CqI7P/986T6nytk9pfvMPSzvoz0tVbu+dsLgPomaCL/3w6q+l/2cvNq1Z72f88E++ybhPX5Xgb7WwII+EVofvv0+2jw3kuA+dlWCvk5GCr+maLi+m/UcPuq8Nr9UqK48HcWWvnquYT9zl+y6kZF0PsE1jD4T2Ka9ufgivy2BdT91aX+/PbMTv9Mtgr3p+Jm+PsxVPxAwib6yHnA+lfUQvpzlxj7jSHQ+",
        "IoLpPDFrAD+leQq95E0xvpTpTD7zs4C+nc7KPjifg77FipA+t0sSv0DvB75ygru+Tk9UPvyn4b5EVRi/L4UFv1pu4Tyobgw/5gEEvxz0kz7cKRC+iTIwvpP+Fz4vpNK+uoQdPCvzET6DauK+1BqjvmeEGL1MJdS+WUcTPeaALr8gQNw+lqdsvhNhAz8Tqyo+kPHBPWm89b3H4u8+rKqFPjLnC74jRlC/1G8NPgWaA75olmE+CoyePclOOT45/pu+SjwoP2QdRT5iVgm+kqNyPq0nDz/Fw06+TcEJvt0CD745NAU/+LB4vL1HZ71L16A+dTuNvsjJ0z7Xgri+C6qzvtXJvz/BUpi9mpyLvq7t3zwSoxW/CtlbP1ddVr/dEvc+ejkuv89mKz6WCZA+KUeHv8Lvjb9Xh7I9I2imPW6d6T5aWP++gc+Av8dkTb+7TCq/lvOgv1hfUb9claY+b9fWPcgVYr+uw+a+LqIovoC9vD703dg+IJySvtDTBb+kJ6u9RhP8vDEuyD7NZBS/+gQVP1vP5DwZRDy+6n8vv2+Fprt5g+m9ajeTPFWfPL9OT+g+lffyvjxK9z5X/1o+Xlv4Pgqsy76WQu4+NRSwPgVGL78IN2m/oc22Pvpn2L4vias+06T9u2nBZ7+Tkhu+OaQEP/TpJj8YbCi+dfeTvlUfWb8l2sm/7B5Gv5xfNzxEg5Q/av0ZPyQvyr4EiTY64eLQPtlvNb9BznU+OO8LPGNuFL4r1O09GsPsPLfQr75r+F2+uGwrv5vnKr+6LTC/RLb7vilRi7wTkDI/6JMAvkhaAL5rNB+/Z8RwP87k8b6sZvW+xv8mPsTMvz7Pydo8XRIUv5WgJz8alZq/npm0Pjpo3j5L1Hq+pOSLv2mkj71H4vW+pMhEvuXJKL/8tRq/uxV0vFiaV76jDCE/6y/5vk+LWr8kQi+/mnxJv+atCDl6z6C/hNaHvcny0r5q/ee/iNzFPlfxjb6sRaw+sVLpvaWvCb/kXT49g6z2PR/BRj9cdTU/",
        "vBYavO4bxz3sM+07mTXnPlm/nr3iKMM+VYBEPd3KRz++r3O/UqGIvusaFj5fWdW+fKbCvSEHIb1IWJI+qBISP+7XYT9KKFu8xuIcvj1vpL+g5fg+0z2BvqtSRz4A1Qu/+5vaPtU7pL7/1Ug9ZwU9vrcbOD/xo3c9OgQIvhWhxD4CHHq+IROePpRziT6W+A2/Tk99Pvuiur7hDxy/2p/8voYRij2Mdhe+GLadvuXUQT0KLKg+KU8iP/K9w76mpAM9hdf6vg1mQ74ZtgU+uRpzvqUQS7/zWbC9qLPbvLuiy75NMaW/eTVDvw8g3L7Rxpa+IHjEvly+mb6vjgy+uxMPPkfbirykBpG+/45zvnYd+j7rCmI+sX2pPmYpvb0IYNM+fiIavO5iPr5hdPg+4qkaPIKSSz9/nq8+i2wzP5ik2D44g+i91Lk3vbd1J79hViW/qB69vtQOPjyKRUk+dBt6Ps1Mlr6tg469UFcSPwn32L1fU6y+i1wBvraD4T4MJ/I708N6PFMqdTwP0/e92a/EvQHhJ78D4wu+ZhayPrY6hb0ZLBy+Fy8Cvzd0jL4AztG8cJqWvV5TjL7FGtI+lyECPliY5T6wThw+0Cy3Pgma5b7kDh2+hoUBP/RoWD6t7tu+Oce5Pk//db5n54Q+drKQvXXEor7KgV2+g1yIvoUzaz47DMG+zSDhvwsYnz5BdY4/xZ7rPia1jj7BXgc/OTjRPLLjIL8O0z+/uV+UvjMFWr3UU9G+03tCv7tmZj953uU+9eafPlkDUj+9Pq48FmnivvZUeD84nYc+mHWNvn5oPz/3QpK+TbjiPlfOoL7IzII9e5KRPuUKMT/vVcy+7dNPv87P3b5oIzA/ocv/PuyQDz/fPYu+IRsuPgCawT4XQC6/ju4bv6vBUb9j10Y/jD+KP4RDh75aR9k+qsmFviVmEj7M2AG/4ovWvlQBRz+WyWy/KBdovtbFCT/utz6/o/pVvxbxvTwvcAc/6Q0BPkaHQr8bCiW+95miPolWv7tlcQ4+",
        "Mm/QPt+uxb2xsbm9M7hSP+BAnD5vYt0+Sj60Prl9ST/lWLG8BjhEPmpHPr8hzlk9CsKnveGmsb4dwxY/Zft4P019/77I/SE/j6GPP/mNgT5MhMY+i2rtvpg2Er27BuQ/X1d7PbfxE79pAh0/9ZMSP80AV7wNeyM/tP98Pqrg4r321ks+Nr31PlpnOj9Maei9idnQvtT5ez/3NfK+2XGnPm+LY75Ogyy8AmgLv1xoDD9NNAG/mQ+2vh0ZoL4UTHE/Ckjcvgjw/Tw4DW4/lducPu5T3L5ZuJi+ric+PjbxAr99GUC+dqJhvXPVHj/bX7K+bPLvvfnUrj26Nwe+JpQuv4Vfsb7E1Ay+kqQrv6hC172wvgK/w6b7PSTx8z1ilqa+8ImiPkNYFr3PW6y+qugWv381LT5sxC2/CSxPvhG8Vb8n5KA+WyyqvVVXy776W1W+yplsPgDAz70T2oK+hw2hPru4dD5cyxY+85rAvM8qQz7KuTW/8dh4P1wkjr4wG5k+Ofj4vdPqGLtHq+27tlg3P/+th75aVAe888fwvh3R9D72848+DGHWvp99Zb/WRNg+TxmYPdrqCj8v3Wi6xxSIv3mL/D5iekO/bsUPvqHdED+URGS80uDaPs6DLT4Rod29k8Nhv9hbpL6KR/2+1mMlP0kgvzwmzo6+Umb4PhO+2T5Y8q47+7yUviD0Yj5MN58+bN9tvrwe5r6gxP8+zOVLvOEcHr2W2wM/mlGFvmoNuL4FTx6+4gIxPi1V7r4CF0++iOejPjEQnj6WuEC/iRSzvlprvb74zWk+j4CAPVf8AL+Dq8o9NVAmPh9R+D1C2yo+4qTdPtiepz5dfmo+Q2zAPoOWRD928ou9lo2pPvYXBb1KG0a+LkuAPpTQUr5s+r4+3xItvafvqL4/OSU+6K5JPQUwuz0kkVs/THLHPvQcqb5hR5y9xXTau2rzZz1gH/A+GyCYPCpIWj5MUTo8oMvivbWsgj9b056+8RNzP80gj75Bi5i+ahS/vY8rlj3tpgg+",
        "pFbYvbvRNr5Ejry9RH4hP70bZL7w8hm+HC75PQeRnT6Uk1696FYfvtSLir9H1ka/oXErPnIa975zxsW96jeJvqmqHT9CoLO+rLOjvlJbDb/gz3E/nNP1PkOu6T45TGi+BgQZvo6Gdr5fOJI/6BeyPv3TE78W0Zg/LK5TPjs8C78CuB2+1eZhvlSHMz4yfBI+gvLUvfOSkT92Qqq8noyOPpKrEr9jrqO+L6fYvWZGub5onTm+RV0Hvw1sGb7BnyG/WQA+vxnDhL7hAbY+iArTPB+Vtj49m5u+gEpoPcGm/r482x++nJYmvw0tSr3K6cs9E26ZPg25Sz51CVu+E0uGvg/1BT9OBYA/l1A0vRB3GD4RETY/axRAP83+pz7CERk+viQyP6IbuzzNRN0/Gyrcvt8Boj3s0vU+RGTAvtarUL/EOnk/MxGlPvzIUr5wC0s/Gncrvq88X729og8/6w0mPz/8AD3M6oQ+sVrhPjicUL46lAo/RlTLPjMeC74WpaM+rp+MvyRQzj8aGT09iXzvP2wX7z5esRw/cn34PWf/n7+6yEm+dcmYPymnAj+ek0k9zUqAvnx/u761ag2/r7eePx6lHr+QLsI+S7FnP6M6Ij8WEra+fqrZPuGyCz5rmWE/+myUPmVczb5uTvC+VrlrPgjCBT4ZtNW+ToAfv8RcCD7/oh49vByDvuwrXr7xHU++xedDPsOGir9mZJY/43BAvxRU7DwODwS/F7M+v5U+Eb38Bo4++y9pPsDdEj9CVlA94YbGvYY81j68llu+eSXhPFkKsb5VkHc+E+QqvwOvVr9HJgI+YWZWvwiV6b6/Tjy+n5sOP+MtMT/F6Ue9yb0Ova1ghL1Iwts+B+65PaUV0D5wLUM+thRxPkn4nj5Lo3Q/FCG1PvxKPb4L5A6+1HO3PeQpZr1Hpb0+V6jTPWrr5D35ewY/0AWlPou9WL9+Bla+j6ZMvcfMpb6DM0I/9Ep4vsT/Lz5DtwE/YpbEPsYivrwHrA0/CXqaPb+lhT5FGKA+",
        "H0mrvtmKVz5SrDW+WU/HvnRyQr0z+/g+my4DPur6hL4PiBU+9Y9MP4iqZT6OGoy8Lo1lPuQQab7uk1K+R/kkvs+lD76+Y8I+m8VGvQeDPL95OvC92ymIPN52hb2lDFs8kTTOvvzTpj5wYt6+Kv1NP40W+r68ZTK+KslYvLgphD4YwMY+Zw6XPt5GmTwATt4+lJzePX2mJz6erkq8SwaxPnSLpD4w+Oc9xq0Lvb0QAL8tzaQ+ib55vqy0+D5S/Aw9loDovQJA3z5X38Y+yzo0P8WqCL/+K5i+ldgRPiM2ur6/nlG+g5m9vqgmkb6CQDE+1DbMvvEnFT5ZvAI/iOEgPvZ/DL9hnXe+4irBvccCsz7C9M0+MuiFv9nevD7TwKY+QAGzPqq+X74W1ZA+ckIVPyWdSj+dmwe/5h01v8iL5b98zgG+hHOdvluxJ78Kswg+gVspP7EXBD1AIC+/0yLOvcOy6r4WFm6/2H4UvgGZmbsYJy8/NBKbviVfIb3/vh4/8cW2v1diCj8ScaK+MZpTPxrlfD7QiwM/EbeJvUj56D7pCUe9cOMRP/C9Qz7N/1S/wVEjP8Fcmb6PJ52+n4KCPlZiCT9VjmC/tzocv0wzWT9kkic/j+g1vxerrD4Bxhi/7pURPhL6Ej6fPMk+DUlIP/7qBj9vUOs+jbsAvwRCjL7yvSg/qWp8P428jj2e+dy9/7ycPvRNXj/LXve+993OPmRSVT+ZqgO/ZcQJv62ivT7Cjbi+wasUvikWcL7nlD4+ms7hvBi/Cr7I3h0+X6ceP3yJUL/APk691n4gvj26aj84998+MNKIvxlUQD/GVV4/MPiKP5G2vD6SuAu+RoGrPloiZ74eq4A/3M0zPspFLT/EbYu+fKcIvvWIAj5VO4y+xCtPv+Ro1D5neAG9g4GuP3pCGT4ZD3w/V2SqvpI/Qz83zvg+DtlcvQoWdz8x6MS+1QMEv6vlHz+Cmfo+VlgovjPDqz5NNxm+ZJCqPsAczz6MVcW++YOWvqBf6L6Ulec9",
        "44LTvrQ7/bz3Wc671B8cPibcqr+2j1y/YhZAPjBpzT1wfYK/1IocPn2yLD7ehQm+CUXtvDcHiz50Ce49O07dPcuhB7+T9XC+7RKBPuFG2L705ow9sqVJPuy5xj1QxKS+w6lwvb86dT/iDxm/oGTFPUK3rb6QMpQ/Dj4YPQW2rb1HIX8+TDgrvsM0qz+j5fi8JMy9vs3Jjb0ASl29FoWevlbkPrtlmLa+bQ9fvXzwrj+ZVSm8Ua8qvsRQOj/imCW9zQAGvpskiTycPFQ/s89FvoVUKL44rWe8OAJ3PiM8I75G4I8+2HkBOuuBhr7GjnQ+WnqAv3BRQz8RSqE9zqaEPuv7AL8xS1q+sSpNvkMZjr6fdk2+JuBcPpy+C75Epui+Wzv9vTaOCj9T66Y8qmK9vhdlyz3kIge+BfnMvpB0kj7GSis+HXElPxJLGj86zz6+18R5PFLABL28zp69IukFPu3+lr0+k+c+Y1oVv1m7hL6DMGW+PVg2PKHbDb0tnQo/oPvmPjfKRr78cRo/2jBkvgIMnr3ShVw+0ZqEvAP9pb1FGBM+s/32Ozpqbz43NB2/g/iSvgf2hb480Eg+sb2TvvI/0D6Kmuw+Jwr4PjbHGj89Vdw+i0w5PZKYED5Efmw+Ga+IPhqUKL5HUHQ+If2pPhRbX76nRp0+auRwvhtU0b0rSWI+nPFSPwHDoj4NgbY+mVcTv+0Rwz60t2m+Fo6hPorlkD6BrGq/bpq0vyWmD74V62c/FIvLPSLIg74IBOI+5yAiv4PH1jv8BeO+iiLEPn/Ucj70MR49pn0Jv/1EOz85fyy9idYWvhCg9j0k40Q+fgsVv6P+Pj/H0ZU+ZgkKP6wBnL+FRDw/HyBCvQMBXD89eIK/VHRkv2kVsb5gQ98+bUqUvgYYKT+cC1Y8la5qPoMkxz5lUEs/faxBv+bN8T6SzhA/pALzvix7X7/InoK+M3NNvkXlHb4MFvY+SzOzPJ2GPj5rR4C++62cvSjnVD/pY1W9ZpUqvsRxir53ohS+",
        "eNwuPznbUT+YzXM/mjk2P+QhFDxdab8/F5FQv9cGWj4j99E+NBufvlaJB79RY7w+TH6XP2LS7z7oP809x+hyvyLn+z4kgKK+NPTMPtuWhT/Frua+Ics9PimIkj5xUKc/YBc7P6r6MT43uDM/tifNPqyYsj5NSBO/xtMuvo2czj6OjAu/188OQC3Zur5b61U/zEgGP+BEKThJd26/UknAvoJqv74U/Gc/qgzKvCnaOT/oQgS+NA3nPgbeCj/I9Mw/mlGPvQzxJT+QaUG/tujNPrYCJr+cwDw/astsP8vcWD3mVyC/mzuZv8J1rr4DO0o/rpzyPioBwj4HGfa+b6uzPR0nsb5kdR2/UqX9vdrNHL9VLRE/ruEVPrUCxz38cmK+vV8DPi6R9z4oZvM+0FTOPcO09D1O2Cm+XZTdPn8JC72Gy/y9Th4zPsEpyD0mge8+kzDCvoRdeL9pTgi+8lstv4SW3b1Grxs/g5hjv5cAgz2j+HQ+MRZNvcedBT2Qu7U+lyHEvly7I7+wGug+xqMwPwHx9r1YNu6+8LdmP6XcfD6byA4+BbkCPgtIDb+atRs/aWwjvXXty76AQw++I7C3vmuexD7PlI0/ca8gPnfTAj3JL0i+t2wbPsQlHT5GmRa/34goPw67gz52r4Q+KSbNPn0chr7WV+y+pcctvkzYoD4nAQC/O5thPtuVWr/5WYe+ViVIPsBe6T6thX89GPuNPcrJqD6pSrA+S949PkydlL1uNhY/naXivvD5EL9v5NK+ZtivvXe80j7tsyq+/bAGvxY2871foXG+9iqiPlw7gb680o8+fevTPt9NjD4yMVm+riisvVgXYr6pxiO+CV1bPj+nnrylhu+9qMsyPS3tgj5Vh5W+yT3DvcBeCr+Jgw0/B3g0vLpC1b5wbFg9nzmfPtcDQr183ww+0W1tPvznWr5IEfo+keTbPqFdSD8Dp+4+oXv6vnpJob5seAm+MWZjPMCGCL6KPc6+JRzGPfciLD7O9iO/5EI4veP3qLxgSYg+",
        "urYMv5hzQb4YMMY8aHGavz6Mi71ZfOg+yB0Ov6HCSz6RBKY+nL/hPqcFYL6EH8M9ciMbPPROoL5lMem+iPGCPjRgn75/UQe/QVGqPkA2FD8AY7y+X601P97o974wEdC9woJSPtj5iD4uu3m8Yg8Ov7lTG744Qmy/437/PU+iJT/ijH2/JMFvPpZqZz1IKUg+MIWUPuXBmLzalVw+/f01P/TX+r35Cb4+HvKKv4VIqL1i18A+/utKvldttD3YhQg/JhWmPVGZBD+tEjm+hBBgPys4KL/yvDY+Z/eDvkyg5T5h0B2+w28lvnlEtb73LMc/L5oNP38+pzxburo9AS1qvyfMer6X4Js+uiSUv6xEVz4CX3c+ECebvrPDvT+UqFA/g2m3PxgfIz9Evfg+7fpHvx2Ioz+cCSY/DQ4kvx+YMT8+kos7MbWkPoDbgz4jLAm+MFxGP7LaqT+wXVQ/u7utPtiKAb9agrg+ksyNvqwR6T38K+Y9cvlGvuFgyL3OlDS/MfSWvow8yr6/4GY+rBSBv2FSpb5jsSI+nTUkvqIhvj3vFMc+oVG6vpWjEj8vjwi+r98BP3tcEr8hgow91+NFvu37Cb/xRY0+QOglv9X4qLyNxxA/1jVhvckiKj8Xt0m9Jjg2P43Dqz79Vz0+/Xy+vg+3JD9jOIU/PdpuvyklmD//EUG+0TI7v0O+NT+DduE+nAwQv8tJrj7JQo4+sYv1vltnDT/xxRy9LTCyPkdJhD/qPpo+RJr3vgK0lz4AMzY+4euEPsawHj+5EyS/eL2XP/fEIT9EE7e+6Up9u3dxV7+aoFe+EmDCPnk+6r4G88S+p0AUvdwIPL6l1DW+YB0NvivsWT8D5Yg+kFyKvbe2pDynoZO9vqUAvowfQD5nDKU+4zVNv9Z/jL7XGou99JOIPw7o5j5p15K/nn+SP/ekM7//2hW/BN4MvmFQlD5qG2K+la4Cvq3wpD5JfFq+h2qzP4R2+74Xkb4+tDFFvsj5tz7F7x8/jEg4P0uVaz3tCIw/",
        "C+4wPfBE+z4aTye/d+Qwvrx0pj7y3HU+pq1Lvipa475x8F++rz16vhb+NL6MthY9DcUSvmyYrL7WTSA+hsQ2vnC7Vb3xkaE+FZEWP7Okhb4eBL+9lEKMvsivnr53P82+bJJwvkDrlz2CdP0+cqAEP5h8j77uuts9SVxaPs0Yu70SwtO+eCXyPqwmOry8dSg+JXICPQI0KrzregG+HqndPsc6vr0W1Aw+EDOyvg+irb4EV2W9UoYmPdlkVj0ADCS80/yevgr0oD7cYVq/n4yjvto0Kb1VAbi+ESryvusSLb1kE10+tVP1vlN5ir6bqYw+nkG9viFUeb5rCkI9X/sjv4TEsb7WGrg/riOTPgbrAL+hJ0W+cWD6PXBryz9F8AO+IqmFP0YefD9ysGI8m6AKP3Lk+T2TO1i+WhM6v5ZFwL7nvl6+MgzwPoKrHT/P+e89XfRzP6GwOD/eSEy/ave5vJFQRT1Hrq8+nTbkvmH/Nz0LFPi94XUIP3Mh+z5d2Uw+U+I8vurqDb9KQ+A+fT+IPkP1cb+uXGy/S0iVPe9LtL1X602//8Q8P+cwEz+50Om+BoA3Pykahr9F+IA+mCMOPxjpvz0OYYm+rB/+PiYFmL7AYL++j2JYPzn7QT3ODNI7MKxFv66Vlb2bCmq+fQljvovlsT5H+pE+eg8PP08omz+hhPa/Ru6ev9XtNb+s9Bw/pY2JvlFzrr/g3JQ/MaftvnbbeT6mO8q9AtVCvFwYnb7qm0S+9IHJvWq+jb3oio88mkUUvl5mnz6pIY8+8KP/vvUdTj88xna+iFfxvk2gAr+p+XC/2s3CPUSMLL/ezfC+GRbmvm10fL7PdgY+Ay7LPdLEgT8ftom/+RXTPk6XwL61eEc+qzVWP62kwj5D8eO9Cqf2Pkx+s758ujG+e5ccv7/QI74RRvi+XBc6PpqwEb8i0iO/GwASPwvQM78rq0g/Xy5eP+G2m7+lkHK+DqDtPVBx4D0h9Rg/bfwGv1iMQL+9/BG+EFOFvk9elb3u44K8",
        "8oZ9Pm4iIzyXO7O7r3WoPg0QiD83XjG+FGn9vHgxdb8ZAsi91PL8PsXPOT9Nh5G9HKlFvSSH8jy67yQ+PvK/PULJRL5QaV8/x2NVvx3LFj5FoZW8ZPYnPlaevL7XziY9Ge0rv9+Qlz2uWdy+3ASZvWXnWj2UOwa+6xcDv7yGXb5ABKI+r2RHPudx575MBq++Kw1TPhwYKT7/YBK/rEEwPyiyLj6+w0C/PqF7PkIKqT0yzXQ9pVNFvxfrkz3qexK+vZEQPvLAsT3N1qS+kgqdPVPfIj7zvwU8QtR/PmUgGT+NnOU9qfFFvqCSoj5zp2G+YtftPK8KuL4IsbW+iKIHO6pYxz6P13A+R/AGPnqbA76njBg/go/yvg6RKD9/4a0+dM6+PhuJgL6Rf2a+fWgHvfTbEL7d6hq/WJQOP4VAab0gbp8+NT64vZChaL6vvj2+UWd1vjbOlT7p3ao+AFjDPsefoj4Y2BM+7HQJPhh0BD7cQww+YcqRO34Gjz6GQa0+5+3/vcDhBz6oh8++bDj/Pb/fHz6OHMW+ZrTLu5ijZ76PDMG+RXoCP1gi5Tw5f5o/pUInvqXLqT1nEbo9w8bHvWotOr+ToLO96rZMvx17Mz5W0g6/PWfXPhGmpr63MBO+/GAkviXVFb6LjDc+fYAePrjJ2jtyXaw800baPSM7kb6hwUI+umAuvxfIT78lCh0/oZivPmpCmr88NOW+kuogv5KhFL7smDY/R0KFP17CAj+SScM97irQvoTbKz+paKG+6dYVvlWsJD/eOXk9hMYxv5eNBD/xarq90UVQvgEpV75BNCK/dYQUvoN9zDzHA089GSELPz/voT0Twye+JVbivkSiZD+6kia/DY0yvg13gbxtpVM/sKnzPpb3vz1EwEE++vZLvyKLsr+EVPM+A9YLPrcQOD/vDCLAcwCZPshKl79yAwO+Lz/vvs3B+71Dq9M+G4VZPt1z/z34Qo2+ew2bvuKDMD4lTDY/QYUnPiKgwb8d6zQ+iQymPi0pNj4k97k+",
        "lH1WviILML8J3Ls8uvNoPrKGJ78/C5m9HpI8P7o/ab7tpew+iNcXPo6gaj4Zbl4+reKLvQoFO74OXA8/Z55Cv/yClz6CXdY+PBfJvXIHFL53sTg/0+qBPZ1KMj0xBtm9+C9SPXUHpz8zPRE/NLNxvY7sJj/wCsG9x38Tv51bFL0VV4G/CKJGv7P1x76vBS4/sfhhPzsECD+4mla/mN+TveZjK78tiRA/T0V/P2uOHT5lEdy9NiXjviYkmj4RrPk91z1UP5WlGr50ukO95hoJv/L1SL4L1+k9xL0RPIluRT/V2QC9q9WEPCd4I7/VpTw/g+2nvnIA1zznj/a7hdEEP64pqL28V4o+hOyCPheUmrysBmk/YziKvki7MT7dsp++yXBIvZmgHD9qWZg+qB1tvkczIL6VqFc9cUWivXErAr/zcr0+9/npPlM4qL0mj3A+mSzePtcPab+YV2m9DCpZPZ2AlL/VT/c+W7J9PzAVqL5fgbW/LuVgv9ubFj6Qz1K+qQ+uvoZfML9Bn7s+Tnhmu9O8Lb0Gwsw+cKbjvPRQmz763Ku9e/KSPiusn7/6jhO/fCkyvrqW1r4CBIk+zznLvsPs277nTyu8AmtpvEB9Qb8YMxO/O04mv0qr57645qQ+qE9GP2dZ672NvBK/gCYhv3hfSz+faK0+4bGYvzrVEr9hF9y+5qsrP6hdML9SpCw+09FevauvnL7XjOO9PtsGvUwPnz6sdNW9HOiHvgD72b1RBY4+YihbPsYvTr4QVwU+9sGyPTKYjD5t4FC/QXb4vUBxxL3QTRm/trrEPsg2er6uB/I+VYm5vu0Zlr6fV2m9OMv5vVzUKr+1WTs+foDyPSgyqL4O38U9yucBvjZvlbu8404+Os+mPQHi5j6STpg+rhD4Pj9ZOr4JVIs+n31pviHSYb1GKAM+qtO9vmIIAz7hPVo+fmoCv0/wV76bXXY+Fg8OvzJQvTzeiTa+DJ1qPk2mVT7jNps+bX0Zv7gUxz6YipS+HgbDPgk5w75F8wO/",
        "nD25vr+Ub76gIoG+Img2P9DdhT602ju/AIJMPpOZvj0KunA+XfImP2UIHj9uE6Q+XX9FvwdTL79HuoC+9/hDvyBlZL6AmC69brwOvULKP78KOdQ+OVs2v/8cvj6qA6+/np5OvzQQID97rak/rX3vPri1lb5MgXI/S9IYP1Fgu71senI+VobLv35JyD1rHH09DvjbPi4F4D0N88W+4b8Xvi02KL9xl4m+IOyxvjI0Fb/N4X4+94cUPhif2T2z4N2+f0XqvZ8t67w1EOy+vXuEv1ExfL5PiCC/9Kf0vgW/rb7g7T8+gnq+PvI8Yb/hMoi/4YUpPv1wTz73ktK8biNCPSD1OD16Tyo/nFXbPmxzfT5JlKm+2c0oPnVuxD/JKX4+g1sNPw37WT6OsZW+GQo7v+YFlD6lYhC+yqwBP9ZgNz5SMTw/6/LzP0IBrT+hSf294rhaP/YALb8g4S8+kOnVvvXs070K5rA/fRyCvtgyOD8D5o0+jfVSvRdNy77FF4U+xMD0vigpOr4zKI2+7JG7vmBe3j7cPk0/ahOFv1ddx719oYu/vpQyPi8ZZj/lHho+N7zzPbVyAj9okAa88cFMP7lXJz+58eE97MFOvzMXzj7lNdm8CAkNPlkjQz4oxn4/iuXdPl+1t76LctW+n0mNvqAM8T2NVwE/eQBFvEe0YL53eR6+kEJPPn6G2TyAAEC/bOarvu0AWr6NLPa+MPOOv6yDwT7UmJw9ZFYEPx8KPT+0vsA+hbeyvtyJP75cbea7tHTKvQQA2ryLeke/dcFWPkai0zu1SiA9etTwPJYElD3avO++69nxPnOp9j55HF0+QQXjvoDuZr3sOmk/cDijvQ8J9j5jZwq/oITzPoXrvT6Z8Do/u5a3vvsAdj42qZ4+GXHyvFDj7j0QRCC/XinkPrJYFD+LyOM+q65mP2GnIL7WwdM+skXHPRaS3DsI76S+XNCOPvFUsr+Ebdu8Z/QNP2OK/Tv97Qk+LCEFvhg/KDx9BCs+Py5CvtITi7w1wDG+",
        "fUyPPjTy5z2KjzK/kn0zvbLvlD6YMV69tQ14Pm7TOj6rxyG/mDOrvvRmmT2jP5W+wSxrvlV5JL6BmBm9jtm1vbrOvL4BXmA+y8Owvhg0CT5r5hC/htOavrSD5r7fF2O+pmLDPrjiBz0HRy8914hBPEvUpD5GVeu+1GBpvplelT0Sqkm+Uwt3PtCNrr7Du7c9NR8CPZ02tz0h9fk93+ELP3/hyD74Jic80kjtPYWuDD8cAOc9tp7NvU8iC76wQjA/IVq1Pk2i5r0Xjfa95Y9HPu7Vrr6Eu5E+yuulPKwc6rtzfjE+tMAaPWl8W77lAya+stCuvQiwGr1AyMq+MHeBvotNID6e2ae9HiOUv/HzNb/3aGO+K/vlPDqf7D4tpwa/8TPTPrJyRz7CMA8+SLsVviS2Sz4JS5u+km7ePpCwJ71bSA4+GsSuPKvgm719bQ6+xsMAv9v9ur/HlzK9de8Mv722g74/rOY9YUyYvrtv6T4fX5i9ruC0PhNMwD9YO/8+CWL0PQTVHL+uruq+E/MpPNhw2j59T1o9JtUWvUmkvL43iiq/BhPxPDJ6XT7lK5m+XmSzvTtFYb7IvpO+hFztvqATrD32OdW+ZzT3vh/DR78vOWM+NXzCvozf9L30lBs/duzbPotiGL4OuF2/ESWEv3GfZ7+4p4++EZkjP4J2ab6Y6uk+MKdUPzWxOD//Vxo+KQQsPSOCiz8bP8Y9j8+gPh6I6j0FhpE+R1fCviGgT77j5gq+G7QcPx/DDb/G5JI+w5wCP1QgZjww4Wu+XxSfuekVsz4rfqK9jAyRPlGtPr0YqdA/H4u5vv874j5z/GY+RqkePwlYlj70yv8+AiT+Pa/6A7+daSk//q+TvYBJLD6hG2U+Z8dRv6teYT5RYh8+PyqlPSIjFD/fGZO/uBCMP0akIb7sqiQ+74Csvvo7Ej8xSSU/Hil/vhpgKD+EM7y+xbIQv+VFLT9zODU+owatvXLsvr7F3Iu+ZEQJPVNfF75zRhQ9XUEOPouvvL2isNi9",
        "fW0zvpReAb9pm9Y+mjoaPlc6X74HDMC9BUWGvlG3Or76dDC9WO98Pe83wb6X7Yc9t/0ZPypNGLz/HJ49TVkxv34SrL1xYSG/SLrFvlQYnL5zt/E6VjdAv4pcaD8d86Y+ogcHPgVJM7+sH2++I94BPmaJTj7qHkA/Im2zO4u82T0TNfE8Flp1PoXN/rzuEhY/Ugvnva1eOb+RMbq9fTx6vRd5I70dnwk+DPioPgAnqz5L95Y+sywQvfT4UD4YRAQ/rG8JvpAWur3DkWW9mRazvm2pGD523kq+gVDmPs1cCL9my5g+eb41vpp56r7Nh3e+rBIXv1TSKj6qali/2D6gPrxXvr48HDy85MBePsCEsT5o9kK/wNv5vplXJr8ptBc+vi4LvzPbzj5q/QM+PEFMPsfcX75BtPI9bkuBvQ+bQr0Injc+grsNPuza1z5nigA/0cU3vhMKK77sk+U96tsLPnbmlz56K8W9XxmKvlkOQD5zzUK+tKcdPz8NXr7ws8u+R/SrPhJO7L3FXXa+dSDevsNZ5z4PvJa+N9gBvmuxEj7XeVo9KOwHvooE7L0kcJ++x8zDPrR+Gr4OpnY/vh7bvMCyFj9FlrW+Iq7MPrtJjr7C5Cs/Hj4xv+GPkj7L/IG+hh1ov/5wDj+R0B+9Mq7zvqhmY7wjUMK+2QsNvoPNCD/HSqO9TrW5Ppapaj5f0JS9KSl7vhW/QD1QVgW/bKZRvj4TZbykY/q+gBUSv5x1Or8X8xm+HLn/PhaA4L6Gqiw+bXlrP+wWAr/MzYu+LuamPlj8lzsjYly/kTGtvlOm6jsAdsE+bfxcvOeYUL+cdb4+HNyovh2SNb78BmE+S/ZOPP2IP79hQDw/QsxjPvh9Xj9ZBsu/wcX5vlMeeb6ONjG9UliCvlaCNT036jm/b8fIvZK71jyVVxo/W30JPhusIj/e9hQ9/aXpPDPpgD5oA2+/t0aovhGurz6JcjG+C2+EPQs/JL+8vyC/NFosvnurdz/2x9g+6B9wvnqw1b7sZT+/",
        "YXJRv++J/r+/RAQ/Vvk9vkVdP72eXZ2+5pBEvjPZAL7DuaS+/H71PTKQxT7PG82+QAgVPwU9Gz4KC7I+b6e1PRsLTT6h0hK/Ejl6v3C0L79cO/++tBNRPq0FEr9Ev1q/Z73OPEhLlz3F1lm96kTZvr73AT/UeLu+jgY5viNu9D3E5/k8/iLJvnqncrxasD2/qbyyv1ittL7QrAS/ZrjhPv9wsT9qSUa/WWbAPtSQJL/4f/E+Ovtxv6zQH79UZ5+/gLnfvr6JHr+aNj2/GHiqvp75E78DO4u/II3mv4fC/D6t+Zk/SllrP2wv1T5vHGc+Ae4uPtXuEj+lJJ++mCdIP6yejD4q3Mi9MwSQPTZ5zb5u0oM/sNMAPjvO775SKxc+fom8PUwLFT/ZIhU7N/sJPzG3l75BNxS/DtXuPniY+T3BYww+932JPr7FWr7jqr6+4wTvvse5DD8wN5m+/QFYv4L8ej0oXhK/TeARvqs1zb4S8Oa+FTDEvQrZIj5jVem96MAMPw0m4b5pZgK/docnvs2Ksj6aW9w+qrScPj3bej4dJqS+Hai4vXphpT5tYii+fm+lvpNGHD8lqYI+fGz/PilWHL+JqnC/uf2SPkj/bT/MZLC+ZP2qPra5jT4jWDU+Pg7OvspUzD68EKs+S9lZP9spYz7/jQi/WHEJvjIAk76Epb090Fg2v4T4CL9EJWu+ykUOP1noxT1QTQS9Wno7vXfFLz4QZ9Q+l50/P3xMKz0umpO+R+S7vbfjuz5baKQ+r0i0PjWGxr4h89Q+HlC0vgVXVz37dlC+alUQv0DePT/IxLg99YHKPdJfJT6keSM/b5Z8vqQUdr2q9f2+F6gxPmrmc77WfcW90pzUvsYM2z4GDOW+XW2Xvn1d1b6IBRI+AX5cvVdwEj/gK5W9+UzSPriACb38bxw+iCWAPppBzL7emJQ+TfxUPp0eC7+u7h2+AHOCvh0+tT4a11u+ZBy4PmBMUb/dtyg+x/nzPCMKgL5pFYG+JSqIvjrreL4A/Bi9",
        "HVSgPUg0db9twRo/ND0xvrKdcz4qdxo/U16qviY6qL7Wa06/t59wP2S4Qj4nark+GcAiPAW5mL8cFIE/4E8IvkMTOL5WaMy9uYIOupN4i77dYRS/XHw9PYfolr83+4G+zEKJPzf9lD2Dio882pY8v5wgS77Zm9E+oDsTvg+DED4WK5Y+gL63Po97+T1p1d++I/4APg9gcj9BzHG+04dcPkQOiD+qlnq+UCILPROSSD8pmZ49p4TOvp3HST4ldUU+cod8Pzl6Jr/PYw6/jjNtPskxhL8JcrQ9Z4XKv3m6Kr5ft589E7e1P2HaEj9h5OE93sPHPQvzaT6v8aC+8BA+vscp1j4f+d2+fNwlvhcRIb/bg5k9wO+/vl7oMb4v6pS+iXKKvigvRD0mLMe+tBc/PxQn0T3e/IM9QU7lPuPPuL1tgwC/zH7evmwQez6zb40/8FHjPT3M2j4L8Lo+lbQAPzURF72pKUo/yDehPQKe9L21KX8+83obv1qlsT1Meo4+m9WMPvJdJr55PI898JSlvn1KJT9PDg4/rhZ4PyiK3z5m7EU/rfUMvztUjz/sGSS/qyqxPnUAOr63t9s+Mlb4vuNEzj351dm8GL8GvyycJD5pzUu+f36BPmAyJb+InYe+Z9PKvanOLD/hpNG8nIymvmoTXD46ZgG+YLc/P5dtCD8tT+M96lUlPz7FET5RZII/jMDyPSlSLT8u4p69kwU0Plyhij9avjc/fp2XvkQqIj+lFVa/aDcOP3/XCT/GISA+NFGzvDPYSr7fLx49hXcaPYdOxj7K2/E+uPWIvVpdrj7iLCC/yULwPqBzQD9di4g+NNcJv0w9+j39wiK+qdwovvt2Ez2NBZ09qGdQvlQvgj9A0CQ+L3aGPzT+7r5Rzy6/M34Wv8PquD621gq/fL0jv/VuxjwfgP09zHRpPELLRr/uamY/mxG6PRAOeT4msOQ+02KGvh4HNL/VIxY/wncjPwxOM77zA1y/VDGHu3s1HL2wJnQ/VM5QPwrBKz/xBvA+",
        "7T8WPodetD3XQ46+b1HwvV/DOD+HfPE+d/CKPiBkw75gCzS7gEj6Pts8Dj+B3xI9EvG7PcbVE74Xq28+fL0jvq1uEL5KISe/LxNIvgL/UT6iB509v/KAvk1KCL+WtN49q2mdPDPGqb5fxzm+Z4IrvEaZDD4KDty+3g/pvE7B6Tx4J66+bwkdvZugTr/bWWU/PffTPk9Oxj7Sopm+jDYPP1F4Qr6pv46+zqFyvPBtqz4oYhS9OPHjvl+IcL+T1l++GQulvsPs7L3o06a9sKBQPqxtbb7SF6I9bGcsvo2+Rzz2pQu+5CEwPx2YKb4tVzO/TmZEvnKoz72foDY/S/kav1rEjr0243m+15uHOeBaqD1oQ3u/CNVBvjJSQT6SK/m+G4k9P4c6CT/KpvY9EjMUPyc09L3Kais/+5VCP35ZMbxU6jW/re9hvTwUUj8iwQO97Xb7PkZ9eL6E96E8wMMFvs26j7zMvqM/Ht99PrfyCz5KKNy+MBexPpFrNz/kZ0a9Q1cBP2WOs73/HLa8Znj0vreGmT4IUTE/M4UfP3vpzL02O5Q/NJC5vn3a7T5C7k2/++gTP9EPDD+pfjW+GoPCvyWlFz8c5AM/2wmMPlaGpT62EYc+Xkj/vTmevD4KKCA/ZJ7ovjxId70xqDU/5s92vrf6Sr9KNDI/p2wTP1Loij4lnAC/cZ5wvwQcHb8VXrc+DpgGv4p4Er9QgHU/ijOUPXYoKz3XZ0S+JMChvFEX2T1hwzQ/3sSEvqsvAj83aaK+CoCbvpNHzD8NMri8QH5IvlZsxj98Rru+ToAIvtGRMD+VmbE9xirRPitO/D2Yc/I9HeCOP4ondT5+wZS+g+MSPsy71r5f9rS9rB5vvkDrfj6liYC9H+BrP887pL1Qg1Y9S2+Nv17Jyz7KgFM+zHfKPpCamr7GR+69S4UvvidGTD/k8aK+iYfHvuKQYb/hfwo9ObI1PydZiz4Liwm9svwQPwXw8L7ZH2M+xSwfv02eD76K3M++SCc8P+dLF79h8A4+",
        "wPwLvpfPlD0irOo9b1JAv0Ylnj2fiYG+78d9P38N/76moL6+x+hwPzirKz+/soQ+l/u9vbcEvz0Mz2W/SkM+PsVRlz6LiYy+RJunvuxw3L73AtC9bHKcPQt+PT8n8Ea/5CbXvTqyXL5zEaY9L2myvYSZuL4FZFW/VQXivkW+2z4pRxs+Z482P+1PrL4RF6y+DJMNP36Dpb4GoZ69mLkQvz2MGj3vMye+QHRav1koDzvLJBI+uqs5vtsVKT8KYAW+7nK+PePqg71K1zs/hpUMP90MSb8G4wG/0KNjvi76Kz+rFrg+2tg8vjJG2r26NBE/moMEv8Ju+D4Hdg0+1LGePXmWETye17u+JLcmvV2Mrz73UpM+soglvoh5QL1I/7U+jk89PSLYkb75RBM+/YhpPtPH+7781SG+q4dMPj8p8T3JfG++byx7vnjTpD2Wvi6/BDjgPiqpXL4h+8K9ikG5PCxDtr7Hf1++KpxKPsq3pj7vYs0++ynyvkASfr6TWLk9hJbavsf4/D51lU2+Oei6PumXDz02BDK+kPaePiBLSz6IjwW+ZSgmv7HY3z41MYy+YGZfvihoh74dQ3m+LC69vcVlwT5HHIg9THUDvSvYbb4Td6M+fqaRvpEBrDthb0A9cf62PAkGAj6rUQG/9j+ZvXVzCb2haLC+uU0cv0it2L1hr7g8m9Niv/13Z7+fYYG++dnOvpM83j2+uog/pZQhvmNLGD7rMik/UaLJPtHBir+ycKk+5zEXvdthZj5sxPM+8pg4v6NhF76VxY09vsN/vl5Zbz9vmJq//q4zPspNCr+2hmc+nFiWPwKD0L7RAwU/WjoYP6znwb4EntA+aLeRPgM1iL04GFc+53l8PiBS1b7FatM9/WPSvNGbRL7Ntx2/9sm2vUbdHD5aaWo+m9R3PpBADT8U3ZS+IZEnP/+WMb4bt1+/ZBWpPqfPAL4Iopy+QumOvroDUL9/oVi+BzFUP4ZzTj7h3mS/yEXDvopjd78yb7c+S8UWPvWKvr7y47I+",
        "tVmAP5ITtD15b9A9i1JjPd/B7T3cSkG+soIIP5bVNr86PBY+nqJ0PnL7uT7WeqE+ipmfva+Wnr59+Ww/sdszP+dbTD4bhXY+PLNyvVmqKD83nAc/8cwgv2vT4rtqYkg/fp06PiFVpby+P0G+K5vNvmTY5T42Mhe/SkARP44tX77G0yy/in/4vk9pXD89XG8+NoKuP3fO3D5BYcO+76AqPwF0Tr48x4E/H2pRvmG57b4Gmsk+hA8Rvnlvrj0qSwg/nllyPaMljT/mNia/8psEP06mkT3J+k8/dcHjvv6SQT/XYgk/ITJkPtUtpT7ZkOS7wwtkvnOThT+HygG/lpaivhzg3r1ytiI/SiAPvurgGb+0ZJw8OHwZPyTi6b1DbUS/sdlFP4qQxj0h7BK+AJTdvieYE70x5oE/2SIrvh71oz5jdrE+ZJUtv6r9pr242qQ+YZtCP9XLSb87v60+J7f4vsPfiD3Lvic+NzfMvc5OFD6JlVC/ix4GO7H2C7zlvwA/AGFOPxi7WD+DzXQ/YZrWvbwHDjtH+3i+Ixmcvau5Er6yLDS/Z/r0Pm6/1b7Dq8S7KXYaPsEw7D4Yr1U/CPSZPLkfMT9FEwy/ydoBPxul8z3Uy1g/iqegv/CZuz6AWhw+yT1LPsZDeD+e1Q0+xGWoPQcCkr4dgxw/qLgnv0bQnL4X6y4+6URavv+FAL6hSg0+XEGAPtnWAT/dEhq+lDApvkSrwb5996g+FiN8Pg5XvT5sBYe+vgruPijriT2h5ZC+iNW8PvfpdD5rNYW+bH8bPuSME75G/Ro+4rDyvXD/mb376OW971EyPt6zTr1YdPS99L3WvkcJ2r77DpE8oTgKP2Dbnb7Gwsw+gksvPqgsUzzanO89NTAbP8/dGb0ETSs/CsTMPtRCMr/+9kw+kSO6PUWPVr6/s5u+LJzDPtLAkL7ETPQ+AXC0vrY4Kb7Dp/i7CLexvnKW+L4eneM9TDOPvPq63D06D9K9fL6ZO3it5r7X9r0+cMyPvGDCVz3LDda9",
        "qAIFPx4gLT7aLoC9UmexPguMW74/0P2+nMJkPuCLS7/Xy3s+c1TGvsX1CL64bEa+O2PzPpmXQj0jA9Q+lUPHPqZB4D4B06c+KY1NP3MDDj+nWZc+XMFIv9j9XD60ZxW+p7C7vtSSKr+/otk9onWUvnDgvb6zRpo9InofP4BtPj6B1qW/Nnyevs9n2z6XxQ++P2LhPg1JI7+w/9S++uS8PZVnJ79rrWw/nd/XPg1/1D61Vte+hXQaP1V/5TuGnCu+1KEQvjhC/r5F7hC+WVflvwyQHL47vdK+BagSPlMHiD4QDxm9xdTovjtwdz4KsIS+K++Gv+o/az8/T4K/sfA8vwlAtb0vNxo/1nYIvhA79b60326/VTGiPV83SL4T8oa+L0wJvywcLz+CTva9/zMVPsVVaD+mprq+c/Z7P31CO74dGHu/IKdRPioeMz8+UIQ/7CjuvTKbpL4WoC8/bmF6vlpNQT9dNn8/4w1IPc1wtT8psAk+qBJSPtxBqb78TqI+BFFYPyWtLr9Vc0Q80YAHv2PtcL8znyK9kbM4P0KaUD7rwz0/9PLEPaAkQz/aRqi+yoRLvUQtjz7jRjY/6rArP1Wa/r7S8LC62/wev0ZqTj+X4Sc+fBbTPeH9sT5nqFA/UA5pPnpBEb9A7N89FO9lP5Go7z7bOR6+6Xe4PZomOb3Hbxy+SMLJPm+HE73tQwM+oLX0vnz6DD+I+Bq/arPfPaWI0T4RelM/VFQ9vsSaYb906UC+3up0vtuW177VO6E/2GKUPGWS4zxocai9Esm2PYilz76oIwI+3IzuPkh3Mb9p2Oa+XQowPezVlT8PpKq9oMHbPBekx75Zpjs/kDAkvx60Hz9D+3K8X3M9v5Wp1T5SIQu+FYv7vZKuSj+oXu29Zdsqv2y5eL40lCW+wQdSv+PFcL3arHI+yG7Fvt+8yL67IF8+5aM4P9K2/72i2So/hyVivZGiPz8mAWY/ITwCP9l7UL/r4WS9y8kYP7DLQT+Irwu+4r7+PGzvij4f0x+/",
        "Q22PPdvOab1CNPQ+4NqgvjmO072Ahms+ZBmevr20Jb+Fe7e9bf6rPE0PIT09iWw+7wDQvRNGxjygZ+2+S2ZYvlIHPztcz4m+cNwPPhVctD7LjYY+2MyUPckz3jveK2s+VeUVvokOqb3oWde9fdxivapZwT75ckE+B2eWPl3S8T0bACy+k+tIPgVP9L2aLbc+cb0qPqHZtj4u27E9O9jbvZb0wL2KyeO+9++0vhn4cj0Vit29fBYlvMihB74vIck9wBiBvswfIj1UWf29P8T2vmEzxT4D1J48rtg6PlYwyr5Gn8g9bZ4rPtyMFT6x3Ia+xRDaPp3DY77+r16+GMiRvkk9Iz7lYRg/c4XavYmhkr51/K6+uDFDP+5skr0/3Ga++7YlPiNNRL6Qzyo/8XoQvnQvi74pHNi9iaeDvs2rrz2oo6e+PkTTvlD0BD+k/hK+/KBGv/kOMr/qTPu+t6eSPrhjKj7ogaA+bDasv3xubb7UZXM+pCsivilq1r6jpzQ/5rgSPyXlY75GsQu/r3ARP3kN7T7Fs1A+3IMaP0VSq7+21Rs/1b//PowsKz470669F1vtvdituz7GrCg/1UcIvrVeub7m5y4/ieOaPlJMuz7Fy5s9omhSP/lpwb2hMNg+8OC8vne0/b2p5X49iOezP9BYNL8wF6U9n5oIPzR7Fj9j0Qc8rIxfPndbYD3RiZi/EaWoPQq8Tb2L6e4+KButPoWzqr6Yazs/WnlEvRkpYj88v42/4AUNvmOQMj89zGY/mDttPy+CQ79CuYY+OGqQvmTgqb2Ogek+CSPBvkHZeL8duoK/sxapvaD3FD7A3fS9JyTFPixcnL9Bgji8GzXzPtxs4Lw7g+6+qd8Qv3rfmL3RET0/6murP+TYjz4SYVQ+AhQIvw6otb49ecQ+72DKvh97Vz9axXQ986NWP6GOhb8lgCM+jfW1Pk/YC70MUdA+WyE9v2PS7LvaLFu/WxmxvS/ZDD8MA7s+bEx+vnwFxj1uCwc/tXitPtpiYj7QIbe+",
        "F0e4vl4wL76Wsi8/g2LdPjXtPD+GnRU+bpwfv2/LSj/E4eE+RVY7v9RrjD5eMYi9K3jIPproS75ewuw+29cTv/YglL4KTM6+fcLkPAtfN7/zLm8//jZWvgSdLD62Wo4/26lzvbViYD+Zz5w+0Iv+PsYurD3VArk+6LFQvmzGsT2pQW8/4IVDvunsH756YSG/jKaTPqvpqj+ekFW+hC+ZvllQiD6Axve+WLDKPtuaqL5IoBs+WqinPpbZy76JmoS8sAi/Po99X7/1lRa/k+nDvS4s4r5wJAA+lcgGP07FRj1nU8e9o17sPlSeZL5XDLQ+Mt0kP281yr4QiQU+JXCOPoOyEL6DQFG+V5v+vnltvz2IfcQ+/O4UPOJicj5RXcY+04M2vkrCFD+rNXQ+LXzlvWzlDb43EmM+erAIP7Zwur7Swe6+llzovZ2nPr+HE+w94U9fPpI7qD67fzE+DaDHvgxA5b2LAUI+mCyJvlo5eD7WLgU++YcAvv5+2L52Nx++D5amPuOTHr1Fn52+vw8EvgZOfz7Bfio+IAIBv+l0MT/wKUk/QLTCvgOkC7+UtNY+jAVxvJxq/L5Oo6g+OVihPnAMPb4laTy/gBNpPmleS77U7U2+xETNPcrj2b4Xj0g+eZudPZG6Izwp9LY8+Szwvn+lK70bniG9786lPot8lz6ueoW+ovKuvh7yNjpxwlY+rJ3OvDhUJT+/nTq+cJ+/vYpeeD4C7gG/YDcqvzhupz/Zqc69X02Pvr/QNz+NdhO/hZodvndhub6FuG+9zKvVPL183j4mslE/kj8Tv+/Iez7KV0G/RuyaP6xbnL06q2I+xdFNvlin9z6zLpY9472vPh15cj784DY/MlhUvT8IZ7/G67o+v7naP+dDg76v9U+9InITP2yx1rxG9my+0Xb6PlNNN76kH+G8XSoIP2ShLj7lbjw/KYeBPvFU3L5w7CM/XH4Mvx2B3r1YPiS/9Oi/vmZqLr8V3oU/PCX9PqLQpL6q562+ikkmP++iUr5HGDe/",
        "Dnt6P0d6dj6FnZM+XEaIvjkf7j7UYmI/UuXZvkZVib6omXy+gn0rPmsCJT+vNgU/KGqmPjSMl76bC2C/ENhmPU0y3r4OBVu/giZYvj2Vkj396Hu/T/ARvlQhaz9aCSA/9fJ4P5k/jb4VasE/sgVlPzRayz1RA4i+8mUwvzCxQj/GQ0m9PxKRPyuZKb7/5i++qffEvgqU1r5WTIm+ss0Jv71Zx7w2io++KIIKPui1Gz8vD8q94GzJPgmPez1GrhQ/bZVWPhAwar8GqKe+lnlYvvewFb/N5i4/z1ZiP4iJfb8BAxe+Z3OGv1dspr3zQ08/d2aEvr6Mlr5rWPc+PNORvgdQcj2WtyO/auFQv/G/l78SHMK+eLGoPDIR5j5yKo4+10DnvoqE2T7H1sQ9mTDbvn/WoLx7ARC9Lmyxvvwh3b4hb5++4MiHPsC5dT1t+Ni+D4Y6PsvN1j6rFL2+2WRcv3ATrr45Voc+p7omv1CriL+2JRi/1vIgvVx2Dj/35ZW+4lGxvt9rHL+Ohzk+cYuOvVrXYb+wBYA+xHi0vMCf/T3zKra+713kPlWalL4o/2i+dAOVPPYLhL4cuB2/J8VcvxgLWbyrega/ksA2PqEngT4yhq6+c+UDPzNdPL+sE0C/7lUpv93ak71oLhW+WUWHPmIw273WuxI8USUuPw1nJb2DCRO/WrOUPfH8db7zeYO+1WlFvl0EMT5kM+G97zX/PWCQ/j6oSks/N8wPvPdh0L10TlE+dDkfv38Nzb688KY9fjNXPm/0qj52zBM/pdzqPPBFmb7bOKY+f5ntvQ/Mfr6fTPw9gnD9vrIK4b46Dh6/S38Yvuy2kzsEff2+4MxcPk8h8r4b4809P+wTP+7Gcz7q9Q4+tAW5vfB9iL2ZjII+EmoNP0WsWz1AdIc+J2wzvmvtmT7hIfA+IuwlOz2beL1UsHC917MOv/wnDT+LW9I+pguTvNQO0706Mii+n3N/vkM6iD6QXmC+jnp+PfiNHb45VmG9vrihPOPlojw2E6s+",
        "VZepvhyUSz6Mpi8/57qlv0gB5L4un94+5aINPaI6Bj/VgBc/oXnCPq5DFz//Xrs+lT7cva50hT7u2m6/mq4wvm6j/zx0E5k+zUj7PCe88T6B4/e+gSXWvsJFnr5Fxr++pwuCPQKxgb5L9RA+wf7BvgbuPT0nBYM9FSRwPqbuIT5xSX+/k01IPn2DB771sE6/wdJFvYSD9z6RKSI/0RKmPsJEED5nvDk/eBTNvjhq2T7Wlze+bhpePS3OsL5HYH0+ivkqPwLpNL8pXOY+HULFPuspCL9HZ+w9JotOvoULtb7nHSy/52gUv9wpP7wvo6s/mWtPPlRwgb4g+zK8ZAnePk3s3z3Qzq4+J3CPPtGvP7966UC9xZfbPgP2ED5Vi8e97aHxPhCb0b49u3q/zn+dPnbrLL+tos88Tz5pv5JiJ72cZhk+Qou+vq7oH76ei+O9Dk0Ivi1sFb+nmgW/w/SCPY6nbr7Vmg6/vMMyP1UH+r7cose+fpDZvhAyqD4wKK++JvCFPySNHr+UGnc9ZZQkvdo4hb5DTPS/UimUPVmu1L1O/gC+0BGGv6XXjb5jyhu+Y8P5PfZsJr1fpj6/ApPSvgtyU7wrJfy+bb4nPxb3/b7GmgA+idkUPfAcIL9/gde+aidqv5H9yz5hYjE+Ukjdvvvn/D28+pG/fl8RP3VnJL393tM8UsZkvmpgdL5EAkQ/PsOSPhabAT/Jid++T9/6PGcRgr8sx7W/0IXbvmw68D4eDy29RxhLvok8gD5v8UW/ZO7jPZfuFrz4xTg+mWq1vstKrT7KtQC/p3mqvs0jh7/7ZNU9CxKjvdUP0r3FjRY/Bs37vjWpaLpvdQS/uFzWPvyRzr6qjt++BK37vaQs9L1j96G/p6sovZ6O17+qYDS/GWq6vR3Pyryo5ya9BN2IvhGVzD2Au2q/zQhYvvJ3mr4Mx1Y8IbUevg8gQD3RkZi/V7GtPqO2775giW8+8W6Jv4LC3b2p9EI+AndcveyOOr/DZ3m9I25TPjTKnr77oC++",
        "/zmbvVfx0LqukWI9LqAtPiHZBL/bmA++2tUZv8NIoz7M4hE+8d9kPnMxM786JSg9nRcVP57/Qj+AfKc+yn/HPsTDNz6BU36+MlTjvrM7Jz4Io9e+ptMIviTKPr+7fga+r9a7PpSuG79xrhI+TV2KvdEMLL9GhTU8cGVBPa+Zab6obbo+dLCSvNl5vL4sYby/vvLKvYhfP78/lTY+iKxnPfPCJb4Ll3c/Azb5PJ37or7S3ZM+T/F7vqn5vT6RWgC/SVAsvpwcnb5i69A+F3DFPk9hbj5OWFu+jZ+qvXTb4b4jVum+Ou88PvAnJj8P+Us/6r91PR9Djj7u4Te8neGwvk2OOb+BJJg/x/LtPVEquz7okNI+c/gUviz14r6BSQY/dClzvOiVeb9lpga+CwsWP39U376GjYs/qWU7PvxSCD4/aWg/nMD5Pqn/vj7pm2k/j4aHv9hTqj1/dJY+n7/ivf/wWb9B6By+rGRYPsXsbz4EjQS/Okr5PqA+rb4t7w++3GOQvXs70L0F3Ys+PiHzPpQnZj6hM02/aWXRvq+FY78UZby+3SkiP1n8lrxYCRY+0jTpvkHWUb9QwiG/yqDwvmbBYbvUqCY94aiCP9zPXb/owQo+DetyPopH2D473l6/aB0lvlQqkz4+ing++ij4vjUR4j5SjLa/eST3Pnhzs75wDHE/yS/DvstxPr0mFeo9BD5iv/BQET8k4JY+Lokkv+g3oD6I6YE/ioS0PuoU6L2f5gk+0QfuPaKFcb5wa1G/Kb8Gv0LIVT9VX9I+T1JaPtt0az9TPdY+78ICP+IZwD40Y2C+aZbePw7zoL4sMQs+Zm86P2nAH749Sa0+5PQzPw4ecL7scvg9LbVCv54g2rsphYI+iGuxP4oHrD6Hiey+F07hvn3brz5ZRgo8qOgrv4tlVT4W9xE/hf0WP+EIGj7ZDSw/Id7pPusde75OoZw+97k+v2779z4FghM/t2+KPwWtLL5Laj6/PeqHvc4mzT6sSrC8PbqRP2mjkz4PbeQ+",
