{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              20
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Embedding",
          "config": {
            "activity_regularizer": null,
            "batch_input_shape": [
              null,
              20
            ],
            "dtype": "float32",
            "embeddings_constraint": null,
            "embeddings_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "maxval": 0.05,
                "minval": -0.05,
                "seed": null
              }
            },
            "embeddings_regularizer": null,
            "input_dim": 29,
            "input_length": 20,
            "mask_zero": false,
            "name": "embedding_1",
            "output_dim": 32,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "embedding_1"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 5
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 3
                },
                "kernel_regularizer": null,
                "name": "lstm_4",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 4
                },
                "recurrent_regularizer": null,
                "return_sequences": true,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 16,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "embedding_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_4"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 11
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 9
                },
                "kernel_regularizer": null,
                "name": "lstm_5",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 10
                },
                "recurrent_regularizer": null,
                "return_sequences": true,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 16,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_5"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 17
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 15
                },
                "kernel_regularizer": null,
                "name": "lstm_6",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 16
                },
                "recurrent_regularizer": null,
                "return_sequences": true,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 16,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_6",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_6"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 23
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 21
                },
                "kernel_regularizer": null,
                "name": "lstm_7",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 22
                },
                "recurrent_regularizer": null,
                "return_sequences": false,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 16,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_7",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_7"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 4,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        }
      ],
      "name": "student",
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.5.0"
  },
  "hash": "f76a8fd0e7b383623ee36420e292f8f9be712a7706e1ae63735fcb4160e0f992",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      20
    ]
  ],
  "output_shapes": [
    [
      4
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            20
          ],
          "values": [
            "AADAQAAAgEAAAJBBAACAQAAAAEEAAIhBAABAQAAAAAAAAEBAAACAPwAAkEEAAMhBAADIQQAAgEEAAJhBAADQQQAAgEAAAMhBAAAAAAAAQEA="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            4
          ],
          "values": [
            "3tSmPQ2E6T3oEoU9h1I9Pw=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "bidirectional_4": {
      "backward_bias": [
        "qoy5v2frAb9nuuU+AxGVP/oucr9KJRA/4ltOPC2Qsj4rieS+hMa3Pj1ZGj5AwbC++EoIv4afH79CIuG86S6Hv20oED+2/xO/bOFnv1IQKD/F2pg/x+TSPQxfRr7ysYi+CqczP5Q+/TuLbQa/RtaOPwOVhrx9xXU9irUGvXiElb/FQaG+daVKPogiLj2fTga9ZMyFPYHICj9zE/a+nS/KPs1MGb3Qc5u+B/ybP9BbED+x6gY+1hadvi9yXr7k092+o7XkvsYU4b3Gip++WkZ3P50fAL4ramU9eAcVPrqaVr+sAs+9pR7Qv/4peb440Gg+ulR9Pmu3Oj99Mvg+tr8ZPw=="
      ],
      "backward_recurrent_weights": [
        "Sv34vvBYOD+7snO/eYM8P1cWyj8jI1k+t3BaQPOLxT6qB7W+M9wNwBGVQj95Uis8Pza1vmnDwz/w5xw/GQQVQH62pr9tmqi+VApyv2Kvtr83B7o+aQ4dv9AZU0BE+bM+Wl0gP9zyw7+d864/PHrGP4Gfk75cfDvA7zGSv1jf7z94FQs+u/UNQAlnVj+q3l0/4uiQv92J9T0TZ+O9jDBxv0UbLT+XHCG+mLgaPzIyhLyGqfS/A8blvCDdEj9PldG/vue6vzroa7/i3RXAPzkIPhYgE8BxFaA/xP5OPzPsnj9Irc+/vQ9FPyuWMb8Js8W/GNwnwBpL5D59GSg/KQLlP0gJTcCLg10+7CnjvyvFEz7ip72/PlrPv/H8j7/KRTk/sQSkPwVklT8FuZO/TrIUv0J24r8X1ww//JfmPpG9iz9KnAhAjnATP/8PET9vNKI+DMPZPzSOsj+FU5S8yKvmPo1fA0CGLqJAEVyBQBUh774CLodAFLvWP2rSDD02da6/hU0GvIBnFD+RXZw9L0uaPfTZZj9OitS+KLHXP9J6iD1md2492mZtP98RVD7xpI+/g0vSPTdLXT5C3D6+x7O+v1MNAD/TTWc9CpyjPxMvsz9WG988PfvKvu0SXj4s+NC+ZfsjQBfyyD9xKiK+zUY7PupGmj7OlVS/oP9sv8HV5b6XZnm/BOkBQLkBzD9hQwLAAADIv8xgNcANI9o/84Vav1T3mr+u20G+q2JEviO4rT9yu8i+LMWwPi9DR7/pPyw/U2Lev3bRHUDJ9ae+yaIGQG7EEj/dbgm/JA2IvmX2bUASkAM/HngwP6sKQT+drQ8+I4VpP7GdXTzG3Fk/YCdaQAT9Fj/j6c29MHvqvzLrmL5LtNm+cruQvbc1jr5TOFi/qteLP7beZT9auKC/E6qGPo0l1r+DH9M+R1jAPtpdib9eqMc/hVSlPXTWOb8OQ5M+N9qKQJVEiT8CC/i/AM9qPg74cL+ysCpA3ytIv//LsD6OZQG/WNh6P6gykL8QUPc/",
        "C1y8Pdtmfj9nKKs70D/zv08cKT+3CTFA0AchP4X9v77JO7+/1k8UwGdxnD4jpxc/Nb/QPzEZDT/QXs++2XzxP9AtMb5oghS/vcOWv8C3oD4CBDs/Uq0hO9tEPUDulGO/QMQsQOx0b7/DgUM+6kLfv27atL8szaU/HjyXPvVxCb7GWp6/0NMMPX++gT/oXFm/uMFsP5739L7Cr5M/192UPutikL99946+BmSavnGEb7+QbmO+V5MlvuCkgT+DR2c/MeFAv0UlHD08Eqq/UQFPPwHQRD+YLBZA0+7QPd3uqz+a9Yo/3sUtvmKlUL3N8Ds/+79Tv6LMpD+M+ys/TwDJP3U95D+94jVAUcqAwPaMhb4NJ3g/7v5ev1MATr+Njg9AJBBjP+4+Y7+dBG29IWKUvhjiBb/ByyC/h2Yqv9rJST/Kh4i/HGGnP+JdI7zBxSW/nogjwIqHOr/bzgu9prccPz4Xgj9AdnM/VNLXv9qqVj+hpiLADhCIvgMGmj6HvABAsk+zvhYwPr5PQ8s+YLd0P6ZYT7/2fem+9ugtvyczf7+TvAI/WGaBv9yuib0QZkS//b0dP/Cy274rlSw/x6JcPzW+3r9o/oG/dIlCP6piyj/LJOG+NaEywAKWrD1R9JO/lcYvvr/2QT8ZU8E+5mrnPjnVmz7CZmO7Y12wuM0pb79G57K++xxAP20YZD41/S0/kpZavwxUnT4yzY2/0j8mPZ73m79Zu88930f9P0jHIMDwrQ6+2ngEP1oxDb6wk40+Qx21P4BfkT/P5oS9k7UuQBMCtL8C5VO+ToURQOeSUT7Z1V8+/WEPQChysz+gzlu/dFEKP95hKsDeVTa/c93KPkSvKr8WnKu+8uGcv6dnVr8MSrq+0HCNv29slT9tpP88GLGJPwG8KT6D9ku/mtfWPuS1cjygyNI+GxsMPyBTeL7iTZc+oK38Pome3T4iiaw/eR+pPjKIsb+cuhs8ajcYvjIdnj9lWhS/JoawP9K5KEDYqss/fxSnPhkXAj6fRWU8",
        "+Sq9P4yBFEDF+E+/xdf5v/DDoD/2CcS/4JMBwAKNHr9eA9W+i4Zvv7ij0L6WYJw/8P/lPr+9CsCPuJY/TWYgv9ISb74DHD+/u6OKv0sC/b/0/hlA48wpPvz1Wz95HgI/bhTHvqHHyb2/QFS/5e4KvvO/K8ABAAXAAjJWv6pG2z4s/IY/puG+vjxnfz3TkcM+evYEPwAZbb6IBH6/eRSNvoD5/j4s+bu+HAI0v96dwL39cWC/q7G4v3Pxhb+rc8Q/7LxWvmgp074LxdW/GJqiPSLIwb+P8U0/XM+vv2tPJL+hg9+9BXwWP+pqOL6uraq/eakov47eUb9yEbq/hoyZv+eqiT8ZNNa+RmsqP4ocrz/dbHY/Ote+P1gn7L7tpC2+VtuGP+NwgT+3vMU++yyaP8vaEsAQ/wjAh1ytPg/Dpz7i0Ja+ZKc2P/mOwb9b5FG9A+mpv4bxrr+xkpa/dvAZPuGCEEA2SDa/2/3Jv+lfmz/1RNa+gF2BvessRT4Z4ta/Z6wtwN3GMb6dDB2+yY9Cv5D4Oz9xVGi9DHiJvW7Veb+W9QI/CnMvv97vIT40q3a+SbHUPxywy75aiYw9nzb7vIgg/L8lVOU/0gmwvw4Oiz1WYUQ//2tHPs0Un7+D0b6/+jm9vwB1175Ch6U+3JfIP9AJi76qCyY+TM5gPwpM1b6gF7+/J8iqv7FCUD1M3DC/jyFVwLsMmD9f1gg+lzWAv7MhUb4KH5k/pc2OP+s/sr+1AmI/BuPRPzu7C0ABAQY++TCOvxfmmj86Z0q/ubsEwBOycr20zOw/r9MEwBo4DD9IQ7e/hzuUP27SZb+519O/pkZgPsdecj73NkA9wfCiv/3Fc77v05s+uI8tvxmwyj6wP12/JUhyOxstpT4yFli/l4eYPkWb3b67ZaU/QIUZPbFygD8TKHm9Y87hPvioXr/saDq/1LXlvljQnT+7qlw+42IFQBT2dT88YWw/aNF1v5WePr4Dwac9wYtTQER+Pr6bXjk/OjUmQDgU67/vGgZA",
        "0n79PyW7PEDOs0W/B+FVvwYCFkBg1T0/HQWwPyZc1j8Xo8S+K4pkv960zj/GcBJA4JPaPwlEF0AoMCm/zERYPpvHA0BhjHm/1LiBPtEjoLtSNhK/f9Kvv0kHpL7yZek/deU4vAB1sL3ANJM9TYHWP/bKIkBbA2i/0JqNPrFiM78xbjy/FuWfPusQqT/NYCK/zslFPrJNcb8kyLu/rb34vrVLjT9i7u89+YlLv9csq7/wGDy/TcP9Pie6Zz5O0/E+9fLLP7Se7L1NdCVAaljvP6BdfL00n+a/LeqNPxPPAD8GOTG/BYv0v1jrmL4HF/y+eekswCZuiT83LyQ/LyuyP7JhvT/5nbO/dCYhPvDW0T6tZ6u/6t5PQPFnSD483Cy/m1MXv1BxLr+K8qG9nueHv3MD6r5IwZ8+8ct6v/3Zwb489Gg+g99Yvm9t7r9bigNAOu04P16tsj59HrK+7VCtvwzb4T/My6m/r4RnP6HWdT74htm+y5HtP0ywcj/XWOQ/QCYUwLlRFz+i3p8+ok0kPQUKQ75JvHU/8BxFPzHaMz/LeqM+/meGPhq3hL+kdqA+4ncbv9HIdL5E0ao/qnSGP1GDTr6eF5s/O90bv4rVYb9kryY/78VOvxeZCD97lXG/mFIGwKu8K8Aco4U+vfmCP0uV/T0w75e+uJBgvi8NRsAWOkW/0S3cv6ECvzyzfxG/x46Kvv9hZT/y4nm/Ilkav+Cvbr+etOw9I6TIP1Mt1L5r1PC96YZGPu1BnL/aypq/6QECv2KHiT/FXyQ/FX+IvlHRKMA60na8KwUmwNZlJb/SIpy+EQbxvk0sBcDjAZU/qc4PwOvIDb+CQ0W/FEnZPoEqiL8JLOy+jN/BvnvgHb75Xb++M/m+PnWaOL7dyvC+nLMvv/G8lz6LnDg+92yqvkUtrz45s7W+pKe8vrxokj8bpVi9cRfhv5NjsT36qri/AOfBv01rJECFYik+JHqYwHydvD8prw0+sLVtvoT3dL8e8oA/k2GZv4fh2D00fXA/",
        "WDvnP7u8kr1OlL8/34KIP+lHwr8Tfq4/TKpDQBJccz9dnZ++8vNcP9oD1r7uqsK9uwdePiXG174QeBW+p/tBvsjgQb5mbDy+dXyXPuzVxb2z0EW/OOcxP4GcEr8huZU/Rye4PLVW8r5kENU9zzSHv9r9Vj9gZNk+FPKEPm7LNT/Djq0+fu+IP5hTXz8Ka6S+ewVFPROlrD4QH2+/5T6PvZjsVL+rh4A+K8mEPUP1Ebw8uSa/W7pMv3NOGb7fj4Y/6NmwvjzlJb4J3I2/0P7LP7FWjz3wQLQ+COjKPT5+l793Ti4/hAjnv2sQEMApWYi/fxFBPyIDD0Cbl4g8YihoPzE64D5uczE9iZMqPmOTrL9hYWA/Ooiov6AtNb97bPs+799FPozCNj+oNsK/piZ9vgMpJj5D0Oi+ns/SvlF10b8Nnna/MbA+P7pJy78pT3o/BW+HP9rSuL/0QO4/tmCNPmesbT8gxzi+AjBAvXD9MD9L84K/VfZlPnX+ID7HwYI/v95vvwTWCz7FMEk/k54Ev3qYjTxMB4K/78XKPR9h5zwMc+M+GzhCP9oIjz93VyE/Lf1UP3y5ML9HGqq+sF3MvjkgFr8d0369E9PiveOvk76IfwI/OsLqP0BXoT6wEdE/uFGZv7wGc78mJc89BT3uvYeIQb3W3ZE//oUru0JpaD+KFxbAvOtMwBaEtr9seR1Aufelv+jcTcAClwnAUWgpwF0vZD5jQ7Q/nI0uwEcp+b+YZp7AIC9MvxPfO8BaTTjAxFe2vku5jb6GBRlAmsGjvxlegj+Ch0K9w0iBP8YOgT4GWua/vrVOO0ViIUDC9RY/TJ+gPz72EsDOAeE+N/xXP7jYvL70hQk/aQS5v7vPCD/+a0a/BwEnPpjEOb8jVvu/n8d2vxXrVT6IQSq+0y+DP+W37b4wges/7lYYvS3Rfr95vCDAeQ4Yv5B7DEAN9oc/YdKjv698cz6hong+c5Wwvz8qqD8BSA9A3ni2PUaDIb8RdYO/n2wVwFgSFrxQZOy+",
        "/BnZP7vl1T+TJdU/onE/v5FtkT8KgIs/qrRSP86VF0B1Gc4/hWgmwJk8B0AQmxg/JXhgP8ZmL7+QFilACq4Uv4Dp7D8Ipyw/5n0IwORkvr+J6XM/CLWKvzOsEsDmTYU/x8EnPwIPH794AaG+QcuFv4AqKUC+3TDAOIeLv8u6xL+69rG5cdrYP53fED5t/vu9eQBMPxFS3Lyz1Na+2LlEPhkzt75JYR6/Tw8GP2HYF77If3s/WzMjP2oV8TyFiNq+zLAcvzkiQr+Fm9g/bcTuPvyVTr92RZs/6G6Lv9Usoj8nwgHAM7lSwC/Lf7+nV+A/VT5cP7mAPr+pFRS/a1ifPw=="
      ],
      "backward_weights": [
        "IHENv6zKkD5eUTK/VRTEvzbRvL+Mqca/FoIEQHdLhj+QpjW9A2W2PUAzNr6FXSPAupuaPrZmRL+Y4OS+nzUmvkTAb79sZB0+H/mzPyYAMb9wKCW/qHyKv0YP17/sf5nAAo2SPRqnqL+dLsG/gY0JwHau577fD8C9T0dTvsOr6L344zE+UwS5v3LY+L7fR3K+TotqPjwMhsC99aM/BQCtP4Zz2D6Hqlo+G9Bgvmf+bDxvru+8yrx9vSYqeL/VRPY+fQZRvn7jz75FlcO+5Br6vq8As74VZ76/PRVqPdeCm7+b5a2/b4klPzdgSL/3C4i/oTbJvlVnsz5YpFg+oXoJPuGnD7uNROu+/g2KP5RsiT7jsxs/iJWtvICAIj9ZNSS+41ltvqdIxz0vzDm94ohNPubRFD2TVbI/0fS6v2TPjz5HOwA/Bc6JP+n8jj9a3cw+gR8zP8I33b23Gbk/1CfuPxzo2D7msrM/snMAQKwcCD8rCj1AuautP+gHXz5AtMA+s5SAvx12oryoEZa+xtyBPSHlnD53374/85KdvVScFr6WN8Y+0QCgPaFlh71/gr4/UF0tP/gclD8d2kdAxgTUvgFlwr56Cnc+bRhEPxGskr2VDn29pkUJvbUSDr3fVBk/d64Mvh4HJD/7vY09O+x7PYJOLr/LlYG8n6k2vgZQBz4Ywe+9Mu2HvPuce7/Vtzu+RV6sPeHmcb7RKY29bRObPWNQPb5iJii+6fuXvslynT+qT04+zd4wvWVEFj0rSeY8ZH0VwFcD8j8p+b4/zaRrvyC4YcB82T4/MgVxvTHYUb/UuOK+NVsYPbfSO75ObSDAl72RwOD8B8AtCzC/RukwP27r2T6pajS/IQQAvsyB4D0krru94COEvxVf+T8Mi/0++GzEO+XSdT9c6LM+AtcGPm7nBT7Qyqy99/Y7wHJmFz6uVoC/lNNav4UhiL+5/Y6/0khAvQpin79/OTg9bz/UvzgG9D4pnVS+bDm4vwnlMjyLvlDAXEXPO4vCvD6yjIi+",
        "bi6ivW7El73z2L+8tA93Pw1gGj9gi4m7bvUxv/q4xb5Yc6W+R2ARv5XbmLw+GBk/84++PXgnwj29MOY9zAMQv8TmJ76NMF+/vFhBvR8pLL8nzn4+g0qoPtVsPEBUo60/+8QyvzP5mz517W88kj0fv6AFC77aLGK/MHzMvaQDrr0m1eo+VHuMPzPFcL9Wv/Q+2sRAP71cV0DMMOk+VkhUvioUoj3fCCc/Dw74vkyAOj2XLUY/ooQ3PuJ46L9obFo+jg57P6GJwT2H77E9i8O1vqKsBj8ah8K9uQNzvlnhQT8gI8Q/O5h0v9y2Tb2E08I+JBRWPSatBL8bzM2+ItPRPh/MSr61fAw+utfXvcnMdb7efBY+5mVBPnp1Br6JVao+b9XgvnzxxruyWAq+OfocP3ffxb7Hndo9cBoev+ATPD5/XMi/L3R5P6AwBD9B3W4+vOnbvhO/mL7s9Zk/YERGP9hHFb3GI1G+R2q9votmGT7UHFq/kqVrwKycJT74aEy/mpGcvyW6q742LqW9afuKPp9KmT/sEUW/x64WP1NQaj+jZHG+p+7APhUAWj+58iQ+BYuHPpuI4b0hqra/XIF0vq7+Kb4QrtW8yA8GPw0xwj5tXve+MJjXvXz01b6NbsS+9UxMPomNBr9zb0s/YUTCPX7+AsDW+S2+U66OPKYs4b68I6S929hbPuQO8D3FMbm+J6YIv/fk7r2owzm/+Gckv//Mf75PdNE9ZmXzvWscn77W2VO+0B8RPzc/or8C3EG+xg+/viLfbsAD45y+bkhYvyIQBD/4Yc+9o7dqP9DBkj9sXw09oYgOv3Efh78kRxG+XVhVPm+Zsb/eVOe9eiVCvwmyjD4wzixA3rHjvHuXrL083aA/MnV3P8Dywr3sBgo/qjG8vgb4iT56kJY/Pl4OPxF4OD7QaiU+fgQVPl3Mcb7I0fY+PLwNPwwq9z9JHds+h47fuyuVBT5RGK8+VbEaPylBqT7MRQi/VCkKvBi+qz7T7wE+nC8dv7v0Gb4QtlY/",
        "cY5Ev55fJT0eo108SVUUvwXYUT2hBn6/b1ifPuyJKz4PIIG+M3b8vXBruTuEFHo+ZygEPjuyGj/YBIC/MVfIPsdC2T+1LVs/RC9pPhEayb6Gzbe9s+pgvoTmpT/lfIY+lrInP4naKj9fVYM/1TtJPv+8+L7xWnY/Im9gPt67oz4751K/xH3wvejlpb5kwzk9m0smPvjOUD9lNsU8pFWFvkvCwD4gY2U+3eu4vdWL/D1St6M+1zqsP4cwTEB5C5a+3muVuzQubj790CO+FC4cvdnpO72dW7g93jZ8vT7PmT7f7b8+19B/P4SvAD/vTkA+GhwmvoH/OL6mJSm+9ZZjvmf4jL4J/J2+9VYqP+GTLD7mtDW/wYfePdIXYz6e6Ym9Q/ilv/IiAD/dpds+A9Xlvsk6iL90Mzc+cRzXvnwRDT4H95y/g2nqvUM8ZT8abMc/xmVjP1349L1Ix0g/uKOzP18t176qN0K//1cDv+c58L6LrOy+qRS6vjx2sL6Q4ca9EZztva1aiD4iRHo+1trbviYD0T47QmM/0qjuPgd4rb+cbd6+9nXkPZFmoL9g4YI/9LyUviE//TtCxRo+fLOXvPqS/D0+hbs6gco0PxR6rT7OTDC864iCvinIFz3umtw+okX4PkK7Sr8luX4/BTIfv6cksr/hok+/Zne2vAbFs7xOL8a+8knjvETLx71N5pG7C1ZhviKJBL699jU+33K6vEGAEj7V5WY+JwhMPZB2i757K529JUCOPh40NT/e5bO9ISMiPwL7WL9FJfi/OF3jPkGx/T38dXm+ZGStvxH1aL9OK0U9IrfGvqlNkTr54H8/67OVvvHaoz926ak9Asc+P3MNDj6Zz1k+X4qCPn6m0b94r1G/2/dqvh2B676uET/APjQlvbHnML+imlXAn5KZPiItBcBkx6u+hRC0P4JK070nQL6+3sONPfquKb7feSa+9tYtPoOIG76BY8k+j3afvvxIzr4keA4/cG0IP+g1Ab5uJ1m+Sd1vPTPSxT7z0v8+",
        "aOwxv/zezT44nyi+2Z8bP7PYh75S2pq90sEYv1lBIb16C00+LVaAPlnSTr7kDaK9Y68VvgaM9r8hudU/XxbOvT394L7ErKi/PYX8vXVj6T3fkQ+/RbyWvs9447/7GAbAdMPFvjKcbr8NRcS/H+ndPrIWmL6wZMa/uMtKvSB/Ob0DQZg/xucgPhu7Kz7vN++9xQKzvf0/8b25KqU9QKssPn2v0r4RG8K9sCWhPsX5CL+5+x6/F2/Av6Xlmj+IF4o+JI2HPp5dxLwDknk9NEdbP6PI8j2H6RC/bXwlPtsVSr54L/y+R3PfvlHJS71TfSq+zuZmP//tIT5Mxp0+Mo/yPGINLz4SkdG9WnZBvoRCKb+Lq9y+bUv/vu+ftr2AFpY+w5IuvkBsEz8gyn6+KloTvny6jL2Y2qE/4t8tvxdXCL5LTdc+jsn6PXcwxz8dF7a+kroPPlanQL1D8e28tQVUPwhOxT2d2hu/FmEqvi6vLz4df5c/Fiejv5qSmb7YOj+/uMwsvk31vr5xfhC+zIDZPh036z5K1/e+jZc2vnHNoD+nT6q+7thgPZHlIkAayww/rB2oP2zKw72tLao9sGdiPSAtPT4s1ek97vd5PUYc8D5Wpga/5DhZv5ScET8rJBO+WDQZv4fbWL7CuZq/68jhvv9gsj6FzxC+EC4Ivr12pb6Rkbq9FncmO6vBub8s7jC+53YTPTgrQr7sslI+VR6jPTTreb7eHRq+Pk31vc7eNT/Rj10+m8tVvkZIoj3vqDU9Fi6tv2F7BkCOeDFAQfwMwOXqG8BY3ZA/IPSGPaElt778O1O/q4URvcQHFr4RLWHAwraQwCyzsL9az3y//GtPP3wu5j4Y4Ey/G3oIvp4DCD3U8l2+YOwev6WYFUA01rw/k+/JPL2xWT/zXvo+tDsxvtmXsT3h+CC+C7QQwPI+jz4fN5q/2qA7v/MlnL8hY1i/9KQEvr4YsL99Wlq9sYzXv5wGXj6V2Gy+LE8BwNdy170bCx3AsTSLOwwvpj5Fidq+",
        "4kQfPrDzNT7N1qS+WKliPSPcNj63gLM9wYy5veqxnj6aqmC9QW2Ivusi5b3igtI+mh3bvng04L+wpkQ+Eqctv+C6Uz7V3O2+UncfvzjvD7+wp/S+V/otPt4NgD9sGRs/esVsvh/cyb5gtKW+QlrHv6fxkb93fDq/Fxf5PIlIib8f4Ii+SQLJPgtD477e9lg97GvBPii/qT9ojpM+LR8GQMlNNb7PuJc+XSWHvydQA79sXiO+A3pNPww6NcAPvBE/W966P+55rb6jjvM9oqZkvcDLnj5HEck9/qVSv3isbL5vcao9NQNkvez/lr4dKMA+6rN7PTfshb5aww8+o37xvjEpvL3zBNa9hoqkPOdh9T4tlhC+xoAHvouM+73aPqq9zRKyPSBvlD196Rw+B8wbv8EplDz3Dxu+GlZEPshlBr7YUdA+Z4a2v2Birb+JLk0+H8aDPhnnUr8i6ny/Noaxv1YFxrp2fOO94FtIvuVSuz8eiVs+07zPPlyIKT3F1Uw/NkzaPin+sD3iNBM+LvbIv5UVC79/T0k+no4cv08za8BRMaI9zWcKv6A48r+uZhs+CljUvyLF/b4gnZQ/q3OPPbnkkD1/uMs9rCBivjIMFz7MsNM9fbcGvuirOT+vDEW7N+WbvrFuCD48blg/xdCGPepk9Lsd6Do+mQaVPm3elj/DHdk+r9gbv04H6j69eAs+cWeyvhID9D6OlmM9uUp7vhMdtL6D+5w8ucu9vmQs6byOf3m+Vgm4P0Dqd78n6Ea+v3+YvTPQBD9xL029SBZEPkExOz88rCa+yloAQILAmUBvW408ZM9RPtUxNT8t5nc/cyKHP8aVn79n78Y+b8zsvqhgfb1y/pg9gfEAvlpAGD55RZM+WdsxP9EU/r46Mve++H/2vPVCPzz7Qqa+ReyXP7EE4z4nQGG+P9y8PzjAZb/TAUW/twFhvOyxAEChEmG+1mCqvQO9dD48Rkg+mpQoP6pxAL+r+5e/cjfTvrxea777eQnAwVqYvuhIxr61m2Y/",
        "5tNxPMpRkr22qqE/QYbsPTuUpD0OV00+nKyeu5qwNbyRebI+LO4jPgyY9j2G/Ee/3sdhvjeeIT7mZoS+B6+avREirj8ZHsy/1ZsawJpZnj//V0FA50OEv/EqxT6GjHs/YxSAP6s+oL1UWWA+LGVzQIGyYkCO7r0/Av1+P6fRX78iUam+DRiOP2yZ9j2Gk6y6RTEgPl9TLD9D8iLAqKCMv/Q1Bb7clmS/GerbvqUiF75CFtO8lg5KPmK/+z9DiIa+HYGMP61dcj+Zy4g/smJZP8Oa6D2JH+U/D9GLO0yiuj/wgJO+cm4ZPrDXC0CQmuc9i4gGQLwlijz1/KW+Q7bGPv40FT8RYxs+KFEUv+rx0L6dJbS9XA/iPmZhqD5+mGA+IzIWvfRvyD5EKx6+kRCWvv5Kk779+CG9K0zPPjvZIL/kxoo9e9A4QJcbn7wjPjI/O/FcPdQoiD2ffzU/+/pIQDibvD5g06+/ts2LP52lxr4M/cK/y8OaPvR1vL71ax8/zdcGvz3+Rb8a6Ow+U0e1PjN9Vb4JfgfA/Gk3PqApGr+m8UO9DQ+6vtS9+T579CG/eZWsPpUFO75VZK4/tb9dvsp06LxEDIq+GcmEP1jyaD17nxC/w9m3PnhFs7++PLI9mdHEvm8aJb+pUBC/vYjtvoWUFL4tt5u9qEbOvsFrs78KODM/UWjdPCvO576t6zs+WzLpPufj7b37iL09iobqPpKHDz+RJWs+t47qPq2Pk75pgSk+zY7WPtUD0T7xkhu/0xQdvZ4kdj9cHjA+dIGIP2LnyD6+cge+Ysxmvdgeqz3DY4s+tilxvsepuj/od3++JBeQP6h0tL+ebUk+jku3v/gUEcDW3JC/LNuXPvhq5b38/Hg/cj0PvwYFKz1urnY/tkIiv0BCkD5d7ky/Xxvivis4/z4bjkq7jwMlPhpyAr8CRhA/UBTDvhDSsT6/2AI+0dCzvhufxL6oXKG8985MvKaM3b6Flyc+l8jrvzoDWz0/UnA+SXsqP7y8kr5pgEK/",
        "rwRyvr9HoL9XCeM+CtrKvm9Q5D4sokQ+fHabPh23nz7ptcM++6ZvvhLhqr5ltAg+WbzvvScaFL5xD1C+/OqEvNr51T6fI0S/sQBGPrgS1778mZA/K7obPhZc4L1l+zI/fFPkvgGkML1G4mg/tJkqvr0Hzj/LSQc/cAzIvu1ypb6dfqW9cszzPoDdCL+4eIS/2M+HPwsOQ0B3+wW8FpxIPwJsBj/EEMg+7Wqfv+rW0L5Mx+Y+Tga9vNMaxL/Bt/G92XEHv7/+Fz+qTXA+UCQWP7MhlT4PSRq/MWsyP7inBT/emwS+u/XqP3v5Sb+r+3+9c7KFP2JTbb4Krwg/7SljPYog/D7G5hK/DV16PhrvmL84EAW+jDyiPgNG8LyAsWY+4Rezvek8R75bWRY93TCRvl2PqD7P+cg/0lyFvwwhsD4Z77C+6fi/vnkwtj4/HMG+ElIgPyYehr7gHLK9XXGIvvqia74vcNe92uYFv98Veb66cow/P5/jPoKEMj2faoe+Y/P4va/qwjz0VAW/QN0UP4wHHr7rY2g/QN2Ovasic0BwCQ0/OmTpPkP1GkAY8mc/vJuAPgjWJL6HgkLAaL1WvkqkG74tB+Y+wgvjPeeVTT97WQG/YVWivUqbgz/bg2E+ARDSvec+dz9SAym+tzc8vCBipz5kefi+GIa4vSfuPD4iTQ++Q8wUPXfFHb4nOwE+M+eHPlfVFT5yeWa+w6C1PqTaXD62TIw+AZ1jPhPwc77yHGu9N+livwTecz9dpom+pxNsPr0Bwj+Ans4+rZwePwozCr+rOJ6+IZ/gvokrpT1xqRs/1dBiPtDDdD/XU6I+pGvvPu1t6b4a/Rq+f9ZzPlSw6b6PYYC/DfunP7yTN8Dy6hc+0Rdav2D+EbwSQxLAkTh/vyUmdb6/ris+LX4hwLz4Zzurbdi+ec8eP/FFiL6or7e+hfkXvidQiD4J9nC9XYWlPvDvTL/3b8K8UTilPPOHmjyoxRS+anQTvoYny72mMcE+ZTnwPr1iHj6vKIi+",
        "RlNRPz9lZL43t7Y9do2ru9GYrz4t/d4+zh4Jv+h1rD5uxt+9nAEFP+LF5T6ztqG+1BKwvRSQoL5Ueew+/3tUv247R78WJBZAbOAHPwmoNEDVLGs/OhhuvVqesr4KDrI/vTqFP6XWwr+5xGM+4J0mv6sgKz+de5K/3PGJPdpyZz6ckQDAzbEHvwKveD+cBxy/OhkmPV2gV7/vdue909uKv2W6kL/0D9G8lW/LPlSDHL9iA7+9ccJHvkMpG77BO2i+/VhLPreC174hoDk+Tth0vj44mb3kkEi+8yHvPo1qir6bV8e9+dAPv4dtXT6e5eq9yqtuvpK5LL840cE94ClMPhSq0L7tf2a/0scZPQYtgr4MDZW9mwq3Ph1Cyj5U7+w+tKIQPxRm3D49Zg6/mlL9Pe3qPb9Ap7i/VnHVPpPOPT6sNtQ+UIglQG758jzJmdI9DUJ/v4HDvr5vHH2/i/r7Pv1afj4ALja+tfnaPskSFT3antG+PuskviovD75Ifjk/rOFYvif8BMB7Wxo/i0+hvun/ej6PeRvAFU5lvk9G8r7hL+49XT8AvyTJML9MJq6+hEmCPeBPdbvhUhFAB1YLvmGRKcBd7d6+GfRnvxg9hj4CppY+Hpgcv88Hmz1U+Py9Ectev57LALztPRk87/VSPZV/gT0PJz2+kakbPzX/DL++dRW/HVysvrDh3r5sf68+7CjiPlqioz/ihV69byh9PoU+G75YMEo/QpW/PYBGWr4CaWq+g5AGv0eWmz/n5zK/LFY8v/+REUCUQwQ/5bg5P8o2Vb4fptM8vn54vpcgHD+xeac+x011vzDPKr783R+8fCGmvRbjir+QhbG9ICeZP4nQrL7uTIi+aQqnP4Zwmb/t7rM7KAfAv56MTj5G5wvAnAUSv0ny5L1nXTK+nCKyvyTEOb0j4dC9yO6YviGad72dS4y8c3nQvqI25T7WnJ4+mf9sP4wYKb8CjcC+XU3lPmqPPj44vmu/02YzPhxQ0j3FQR+/3dm9v21FDT9pVlm+",
        "X04YPBLTs70J+xY/tJ+iPic4QT5Rw4Y9B022PBZrC7225nY+8P7dPV/+u74+cQI++QMhv5lW5D9qLPs9yn2uvoEuK79gg4+9fbkMvx6aBT+9G6c+iKQ5vDOt7T6gSqw/6S8qvwGFqL8BrHU/UfwQPsFkKr9C3WG/3MVZv3g0oD81PmO9aIAtv/6EbD9Pd529ekOEPVVNHcCG8N89UJH7PNh5jD1rDfm91kfcvhaJaT/MKak9MunCvwJjnT+OdZa+avZEv4vzhz6Mqck+HG/vPr1ocb62xH+/17XevrhwZD64Mic9wxtzvtOVgr4f6Ne9VxEov8TN1766DJW9ycc7v9Vyxj5shJU9GXAWPnTQ6r4ixpS9bYnFPSZh/z26wIU9lXIcvRTxBL8CaKy+CMTIPjsFmD0wzrs/Qwc/v0AeGz6etTm/vGHDvqY3kj//bDG+JxgAPjDkFj9EAHU9NmGoPcdGmb4gDBo/8QIVv03YIr3vFj07gEzjvAdmyr0uaaI+waB1vprxGj1d79e9cfcGQH+/dD9HYnU/w7/WvVGZnz8463g/OmBEP5y1M0DB7Gs/Gj3dP944Cz5HpUu/olNVPkgF7j55tAI+wE58PeD1Yr538ca+s0Q9vkISNT5mkHc/YR9mv71Wcb0NPha/0m/IPvBuHz9Slc++nM0kvhhVCr7QUOQ81muBvsDk8zyfwFS9gvwZO6E3U76OIO48WVU9PdkhLD/pM00+2/syvpD6/b4FZEW9XQATwFZwez4mCoK986RJvDzBlL8fx8i/LigovuW0jD/kqzu/RwlBvxJZvb8TNwA9JR7aPVdR6b5za5m+hq/GO6Fgxz99YJ29Pm6uP/FHQD/2FYA9VGGvPZLkCr8sO82+U754P8enbb5H+Be/92yVPifpZb8I89+/gkcGwGOeur9l6Kg+zmhQPwrDZj6jqOI9h/4RPcacwL6wgW8+X7rkPv5pgj4mA5U9jXVJvi1TOb8Wbsc+/W+KP1G4Nb7hNQhAVSuRvgZMWT63n2A/",
        "panpve0bgj3JXPI+HpZHPqsWkz64K3u9MogKPn6DGj7L6I0+pRe7PKNzo74U00M+4shKv1wLDkAWUOQ9IIf1viNvqr5akt4//omAvyS6tz7tU6M+ZzKfvYM0Aj//c3E/BWciv0B2wr8pZL4/pmWhvWVghL9Iqc6+nXhfv+xOuj+JWKs8S4RBv+bUT73l91e9ZSONvddwkr+o5to9LCcivyMEvj0L+la8hd6Kv0wGkz+y+lQ9bbhuPoe3zz/v9Hq+X9qLvyPUkT7xcvq+RX2SvsmBeT7w//O+0LcXv/W5uj7w6WY+rtOsPT/Mv73DGME7+9xNv5+SB7/5V6q89/sNv9DYL7+PZ826gpMBPp5biz6IrlM+lr8WPiCITj6Zbtm+MsfWPTUnDT+KAoy8tGGrvpIn277GXB4/Z1gSPgubgT4Ooj47V3GVPnnfvD7Bi7s+g1YMPiRE+r5zUg2/MWubPiBwjDxvPzc8hZEOP571qD/hNnc/VOumvtsgg70hPPM/P5CCPvPsm763how/uqFOvzrcWDvK1YC/u514vnseN8BmLyO+Q6+0vmLkoT0kjjc/4NS7PUj4S79YVng/2Qh1v55sV7+FCJA+VNEPP7Sfvz1Rm/A9iITRvpNAVz8Losg+ibAWvgoZiD5K2Ng+odUBPtdLyL2K1Ia+GhrZPtSWyD6mFtM9E38pPuudDb7X0RG+2GQhPjrhXjvwuWG9cQTWPXbsaL6dxE++OkUmvibvJD/vEt28dv6SPdwo1b4O50A+Sxefv6f3LD46OLo90GS4Pk3y0L6ZK1I968q1P6d49j4dwo09jo2UPRt4kz17oxe+phFMv6PHNsBVaPw8M0tEv3vdZL8J5za+L/Jxvmdnlz+v/8s/yNMqvym7Ij8AeI9Azowsvaw5gz88ESpA0+jDPT/OLUAsI8C9ONrKv1AMRL5Xap2+wjVivnl04z50HIO+wtzMvhlAQ775fq29V3O/vWjH7rw4SM6+rqCyvVsTbT2SyM6+mb4LPn89wrxln7i+",
        "1lIcPyuiIb4/XUi/btI5vkRFgD7dh70+4eYIPxqEkD/39YI+x0ozvnLWlD4+TCi+1YgYPmuKVL8+ZCI/TBVNvoNQlz7oxEI/ypo/v4lMlz9K8T+/3637PHgTkb6cbJS/w46Gvhui175RUiU/ZJ4gv5srxL+0XKE+k1e7PuBFm7+EiIO/M6YuvxCt/z1eBKa9+sadPbHvmr836SI+8hOFvYrPJL5cJqM+FIdjwP43nb87twa/Ha4aPcGqML8/cgc/RI7/PvnXSL86yRK/Cq/OvMH5TzxbnV+9FLWCvwcMGr7EwQA/hyTjvZMwsL7+VI++aO8Hv4jDtD9ccKa+d/ORv4t9cD+gzuq/+QcIvgGotb6LBs89az1rP6QYrr8lh8a9i6KCPBxf+j6/m6I+WXZKP/Yak7845yA/+RDbvW/6wz4nI3E/zaf8Pt2p0z7vfLo/WX9QPyOlXT5mMkq/YyXXPzlHZz/NV6k+pt8DP2UTeL6KlQy/BD1UP7iPaL7JAGc/c0b/vrkCPz6omcY/408DPlTaJb452p4+seRevzNvyr/6MNK+rjQDv5UVjD+0PWO+x9klPfSVy75UBMY/9SmmPfRNEj6MwG88PVt1v8XKYz+ynEc/BWa5P1lMMLyUq1M/6kqMP08lt768voI/Sm/xP4Fzxj5Rfd++IemTO8fEbr8="
      ],
      "forward_bias": [
        "hEmAv15lNb9MNoC+azKhv+EjTL+kbd67ebbDv2yCtT5o3NC/u6qMPz1ZcD4mRSa/qQcOv0YoKj84pUK+lljyOxRBXD9KalS/rRmtvtOpvT0jOz8/GZirv8Nwfz+0ng0+3SHVP0a3T76zYdA+Axz1Pm/OIj+V9di+9h3iPqyqIb47gB6/efVQPUDQi7/fsgk/rqtFvlOJk73zWho+u/qxvsJWdb6GLOO+1Fg4P48PqD57JJu9SNRqPJgi1b0bTTC/+lrmPjmx2j4U6MA/KpAxPhv+Jz+EicA+hXgoP+SUbr5cMn47KjoGP2ilUj9kKNC+JIvGvnp4ij8mFrA/1WWYvg=="
      ],
      "forward_recurrent_weights": [
        "FGEEv0Qg0b8p7kk/Zf3kPuvLBj5bKgdAxMaKQFq4nj+vpa0/icFcvqMdbDyg/s+/+ZvWvBSmC772xwe/IsVFP8elDD0/AJ++b/RuvsDvrD9t4ylAorrcv3MbyT640rI/V6jTP7Ss+bvCkb4/4OD6P7KC2T4DgnC/C16UP1TbTb9cojW8JFZSPWX5Yr47YGq9nGlOPs1d+T3m9Eg+xRI3PjFIUb/ywZq/NchdvtMeDr5uI62/dWWlvlR1Ez95RIW+H2ErQLqrGkAiQBbAYsusvRC8h76z7Hk/drk+PTpr8T9iyjZAzrpRP1c/Ij+Maok+kx5Av/KpST+MhRa/PELzvde9vb5VSGQ/4n9Iv3Ttir9c9uG8sSmAQKUT4D7oBBpAq3OZP2nLQj2P1DW++uBAv2rlbD9DRbk+34WHwL9JGbwEdAu/y3NIv8XEZz4PXGe/2v4kP3i/uL9d/ly/84i+v8LWSb9uWrO+9MFav2fUsr5+IxJAEgwPQCMMRcBsbr4/XEePv1sEpz7v2ho/aMGHPqqsb787iLu/OEgVv86PKb90yHy9Rqsov8lFNT+v4+u+nPtNP5xc5L7kMow/hgtQPzFa2D+825I+TfQAwHpdJkCtSIY/yAoYwN0xiT/gc+M92GiwP4whkr+ngoFAx4ekP3WFcz8owFy/7GKVv4TDOL+1eau9H2E5v8+S1r7f9y6/6CLQv+45Ij+TIavA+22pv1HyXT8EBs2/z0iIvdwvir5OVrg/tVzfvzefGT8hDCFAn8O+va7NQUBsV80+yaeiv/u5ML8wNM8+uMGQv0H+ZD/DBTW/8J2Dv7W32D5ED+E+ZTUCQAH6zL8GPnu+AiWIv0oL4D4ZCHK/jXcGPk7vJj/Bd1O/bu6UPiuFyD7GkSO+IAKhP8pmRD87iEq/kY6DvxsVvb8GNQS/7djQvb80zD5UJ3/A6NiJPynvZ75zNIq/8oipPxGg9b75yDXAUCONvsRAir/+xNy+4NWCvt0xcD/5eze+B3flvxUZBr/ZZCk+",
        "aix+v5kAmT8cXrU/49GUP5iu17+q3ss+l95dvyduGcBfkKo/OkcBP4BMkb9j2nK+LBjSv8PHlr/9NqU/QmnDvii0+z8uALm9Tf71PuXRqD/GMhw/RH/Ev9gdMb+cuzE+kDKtPyUNhb8Tbiy/7zCIPnOslT82KMK/9qIKviDiB74HUyU/0ZniPRJux71olgm/+D9jPtcRHz2wUNI+i+BEv7cTKz93CSe+oRJxv5Z/Hb+XPle/VS4hPq713z561ZI+XLEewCjB7b3tNeQ/pWAzwLiEID+iULS/HtSZP+Ny8j0W0qS/QGaRPfklvL1qJ4u/mJo+vq37Xr+a6dW/SWjzvuEf/j0cWfw/IDUjPzcOdD8dIpm+zSVVPiu4FEAfvfI9uJ30P+rQp7/xGoy9lFX4v/eRXj85jhg/RmlyP8AuRb8ltSG+/V5pvzp41j2cMm0/ZEmmPmT5nT3JSX4/fZfAPTU5wr9LdmNAFzawvu0SEb+StO6/9Vy/PprZUz9voL0+qhuVvpPWSj69cpS9OVr6vW2Sdr7l9pi+Kzqfv8TviD7pi8o9eT8sPy079T5sARQ/cbNAv0r7LD4sXxK9+UB/P2rEkr/+p/G+NqE3PQi1CsDEeV0/HyGnPrlkuj/rB80+2mahPnxuyj+YgwQ/XHt2PsmYH78XoxI/oJ0mQGy2tr+HBje/M+8lQPnW6L4BnVnAp4zFvXa0cr+UiKG//smBP8t/xr8oBAS/gZRSvGxbgD/GpuK/YDC9v66+ZT/iEdU/dNK2Ptnwh78+Saq/wyUnwC8Taj+T29a/Pwuzv7aiPj9qTXW/sW0fwMDiXz8wGWe/jE1/vwKckb9scIq/oe3lvmJTiD8JF7Q/0GWnPRDxjz/mHeI+Uo2JPhOLgL9nA2W+FPi2v2pjTT7N/kg+F54EPqVMrj9wTZy86zttP5gRqT/YW1c/gOZcvhdRHkDsk2LAcWktQJW9VD+NKg4/kZDVvx8mEECDsTZAT4Aovxdv870g+o4/LyPrvkdRGz8lv1c/",
        "U/qSP/gQ+76JkJ8/UonIPtge3z3WgKG/4ReNvxeJCMD/UzI/22pDPmOGIz74d3Y+IbGLv4C0nb/jAQw/GAarvsq6mb/n2I6+z6uAvzavpr5e59y/msU8v3ve1T5Zptq88oWtvdp1vL8RWz++hJi7vwhRgz3mylO+q5kuP2erFMDOeQW/NktPu7PEG75+0/Q9bNDdvo0AbL8niSe/Y1RcvhioDL+rNsM9NcdtvtWDLD9/WNk9b74/vhwVCL/f+lc/znPxP/b0IT1pEdi8g2+dv7rnmj2HaOS/XM4fv31PJz9utAzA2huRPwZEPD9FiHHAYKbTv3SFwr+3Nda/gfr+Pt1dJcCyfVw/nEJUP08Fbj9t7D0/vFqiP3qlk781S90/AyiEPif1cL9DyL2/VhwFwFmxR0B0BTA7WsVPP5GbCkDygZO/I/X7viBqG8BX5LK/jSM2wI7I47+3ieW+MdEBv7HCF8CO/aa+miyPPyBVgD+MMek/t6pMP2Cwqb8JzZU/1y81P8E7cL8IgYm+LzOqPyn1SD03ZrQ+gdt0vnW8g780JoG6nPA3v7tKrzyxjcO/YVSsvycCNr5q1Ju+Ko0HPpmCGMDwjkY/NQe+Ppc73L+c2xJA7TzEv4cMrr+mzyS/5Sbiv+sJaj8s7oa/7t/CPiVaBD/j0li+iTm2PtX5O74xegK/u6ooQC3+3b+9fOw+0jVKPg8QQ7+1CsK/t3p8P2s4q751+8G9UgdLv537qr9fWuQ+yY+xvwZVuj3XdGS+UPe4v4RDvr5ZXkm+u92cP8P/QT5c3RC/agEtvwMWBUCVBES/lH53vql0yb/WfTS/7+vZvqimp77VWKU/cCAMQAGOR7/8Msy+knszvvyiqb45sjc/cUpLv13QFz9a52e+BXQ0v/MhNj9hQ2498Qu+vjyeFT6HAQ6+gZ8PP0Cnbj/IMQPAN1u1v59knD+ecya/VCvsvjNuZr822Rg/0zW+v6ps7j8p3pS+ZnhYv5reV77H7Oe+5pflPl5d3T5p0pO/",
        "7ky4v83xoT8BZIS+usBPwOBup72g6h8/z4DLvm1kPz+My0G/NTbkvi6Syr80tam+KxafPu/2q70mwl++xzzkPpbWzz7Xi4i+iv0gPcpqRr8iJC+/HRgnwB6HZ79Ffte/zbPBv4aq0b/LKlC/ywW2vZmf5L9b97C/qrRWPqw/1b+MTW8/ydqdPivw1L7BPmY/k88+PZrnrb7Ua28+/0oav9bHab+XWWq+wo9RP86lCL2KR4o/oAdCv5+THL7XMi2/W/IXwKGdRL+JrfM/ALKgv7+kkD/VH+++IYYCP2/tV79nREA+rFgtP27SiL9P3Ja/uQhzPj6Gx75gDARAtAiUvieEoz90u5e/ddMav/BRC0B4kNO/LVY4vhSfbD72ztK/HHswv7WGNr/d6+k/fW1KPg1P1j8vl2g/JkxCvcCKfz9quns/Za8jPERi0z+ZO0G/OIS+PinOJL+Sb0k/ncqTPt4f4T/gy1w9ZxcLOqwKR79NTpS9Dyhwv3W0JT8ir6E/l6oSvKaQnT4Sakq+1UZyv4ODw752j6Y/5fMBvYjogz/nuWM/I/bTvlz8Yb8GNGm/en+hvzkpRj85pT4/mc90v7hCjj3XSIQ/mRscwKMa3T6pwze+fHeHPyVS7j+NUQA+mS1WPiEKfT6VTVC/r8xNv6qfAT7N44M/lnymP/Ytf77hmOu/8xaaP8CPtL4oPaq87PMxvlzTP0DQVQPA/Q+AP2sbnj/6w44//4EYv0ELrj8ExHY/99zUvQJr2z9VP/M/Ndh2vVyIsb5J/ABA+2M3vnh5ZT2tUhHAMF+UvhZAPkDDbqa9vog7P036576khv4+XRFEv1MLlz8cU0k7py2CPmAiEz95rh+++HypOjK+qT4QtAC+07xPP/X3kb0jw0K/thqEvwz+Lr5qFj8+azsRvs05QL+lwOg9pB1kv/MuOr+NEj4/Fiy1v0Fd7T6PzhDA65knwPStcT8WJUFAuscyvq32vr9xP4O/OrKZPzjI7r95j2S+XTbUPqQlwj08LZ4+",
        "D7/APomQmD9wUTM/hyyEP0a1uj4jwRS+3lkIQACu5L8cQ7k90kypP/TLhD9FC0bAiGs+P1Mmrr9jkgM+twwdQD3akb/LY7C/GeIgPqzZKMDfVVu/mqy0vzwhDMBvR0m/ta7gv8thrj9tN5a/S4qTPyRRg725bRu/1WqFP6G9XT4m9Vk+q1JoP378Fz5T4Ag/ALfSPi08Tb+lrS0/vF85Pj95bzsSfHc/dyRevyZUJb+bThS/9zenPiLEYj4tIaO+9B86P5ja0D5BRLw/0htIP2LPeb/FiBa/wmhGPvs3oL9tf6Y/4HbKPvcJgL8Uh+Q+B9UgvzLKDT+RclA/qLUDvzQCjb+N1TG+0rK0P7ULnL80Whw+W84zvsHfXsDfoI6/EVJSP1es9r+gv+6/jVYPP97Slr+g4KI9oabzv2JOP0BiRtQ+HlDPvsEKXD1WuoC+i+c5wOyieT+ZvQU/vmckwKKnO8DgOMQ/WHMJwN/sIT9K5U/AERiuvveXkT0qC1e/fiE+vpzEkT5CaZ0+DEsYvqQDP79Tut89iZuSv1Grh7wfEly/EhZAP83KuD6bZvA/Hbn0PZO9Dr7AJ06/uj8Jv8Xtsr+LhI0/53yZPza+NL+yuI4/+yICwLP35D+ftM6+wyy7vxBnsj4acuq+TlekP6SoHD8stw/A4Oiov0vSZL9vnY8+PPEJv/xMgr/IhNq/ubDyvdtpVT80fY6/FojFP81NuT87cnS/16nmvwLgzT7ReSY+CC9DvrZ+hD4XmMm/RXLmPiv5mD9Ldks+TvLkPDKPiD/UYqc/1yQHv8gDiT/tMyk+8U0CP765sz+P8cs/6lNmPseJ3D/RSa4/osYbQNTCxb6187m+uGUeviOqSz/jHYc+apbyPjBxwLulurG+kHU1vwBzyb/P4KU+twqDP18H1T4Kvi2/qkUdvoIEnD/PqiPAB7AMPweeOj9ed8s//yE2v/MKLD/bGpM/uwr/Pzy3IL8gxIk/sEB4v/4W9r5Ax/K+bgcWPzIeHcDMEXY/",
        "O+u0vqowrr/nsU8+1DliP9+BKr3/ZZo9g/AXP0LehbyQzNG8+WYsPy4cEL/ggBO/AjfTv0NzKkBvV/0+eYB7wGv8iT7cLNy9e1HPP2i4B8A+1ye/cEovv1KbAj8kFfA+vtiIv62V1L5OMuO+w6HRvurmsz8iMcK932DjP38kFEA4kIE+ReBNv+voCT/eYTw/QxMhPyTgMD/dMDa9iWMTP/Uwlz00bDQ+KbyNPpJOr78DHkC+7vfEP6g/sb6tVBe/T9i0v5xcBkBklwY+iUT3vrCKiLzcCVQ/GgQHwBrwkzyAd5I+r/v0vjNu/z/BTyI+k/gewPnCzb5rM1E/keJJPg=="
      ],
      "forward_weights": [
        "i9CEv5tQpr9tbsC+9pIJu2+z9L4MvRm+EGyovr5l4r4S21O/sKDWvuUJ8b7P0x2/8e63v3JFhr6V8Cu/UM5uPvk9ub7uTJk+Di4KvoiKF73jtLY9GmhVP7Kaeb4OuaY+mdBvvl1b3L1JjHu91+cMvr/j1L0SRXk+MzkRvvduzD5UCDm+lsKgP2fXvT8teZc9Y1tDP1Pqnj0prru98CSIPsoCf77HeVM+aRLSPUS+mD56mee+BPSWPlQDh77oB0u/MOT/PuyvvL4pFYc/XwIBv09vCz7pjgY+GYvvPZNtgj5XOck+hwyhP1qfBkArwLc9eDuvPzLnM74pDcA+8KKdvs3KFz/5KAy/Zdcpv/Ndbz9BaCS/OS70PjWQbz0/moA8YzQRvoFmpz9dG9G+5xodPlPeU7+BUHU/QtvxvLO6Cb5ADy4//Gstvj9MEb1DgxK++nwWvjKkDL+qLpG9KbSqviF4iD+2zq6/slvxvihnsD7c1iW/xYWGPcAX0b0gTos+g6pWvt6UDD9vbQm/PgnePpqyGj24l688o3taP13S/r5NJgq9TaGGv5Qtsz61r40/LgTJPkuEjL9sMYa/QQ7mv6ctdr6zFw4+jn3EPWYJzb9788a9BZLUvGjysD6dOZW+5AV9vjYnyLyTOpO+m5M5PTIcG7+tNIy+ma4PPSLkDT22q/o9onUxPprjHL4PhII/0IYiv6jBC748xGy9zuAbvrX5Nz91A3++CeXoPWCfu75WVZa/EFiJvd+r5jyhypC89gbuu3A01b6SNt6/3y+mvgsfHb8rh4k/RwBGPqxYez9LFH+/64YIP6GKPD+pRAq+mR0au6JyAb+T6kK9i7qqvxBEaz3VD4w+436RQB8UZD4CtQVAVC0uvsQekr66iig/TMc/P35QOjyJ0i8+c6tsP+JoQLyGPrK+N6q9vnM3qL+Ei2C/4PLKvjCSDT4SKMu9OvvsvXnTvr7/2xe/sA3JvW7bgL6yroY9u3qDP+Jj0D4jFYw+n/z0v2Hmyr6KA6Y+",
        "/AAoP+13Fj9NEIg+MZQbv9lp1z9XRBC+2C6MP1l6yL4fJfE+QrAwvwwbQL9rqSJAu9NQPqUpsz6QqW8+bTNfv1DalT9YOjS+d4g6v5X0x71OHhs+z+Fpvy8Wrj7aEwA//2YqwC/qCD87jIo/xRePPtysPr830zc9YcZNvorLb722Veo+WAaGv+vGND+rMwS/owldPvpue74nJmc+BnlfPb/ZFL7NCuG/LB+MPDE1Vr31iJk+v007vWH6O799Dvk9djPyvdozir2pmx+/+JeXP53qpr5pVDG/vMcAPneSoz4WqgO/0wkjP2rdNL9V8UG+BejQvlU6R7+4t8E7OPocv2X0D774lq2+VqJIvjd0vz1vmym/zh4JPm/tkr3WsPU95L9GP8cLVb2FCpe8OC/dPt6tW7/vIiM/2RRfvgx/mD8+dxrAFSqCvsgvwr6vwZ0/Vw4Uv32ep73JuMc9k7yVP71jm77YIY++WeF9Pcmo/b4XP3g9nBu+vr7Dkb48aPK+hlOMv2Ug4b5EooQ/VW/RPl/Dgr7bCGS/CH1Lvzurir/HLdQ/Dc+pvoGqYD8ro/A+hCMGPxLaUD/SRiY+2g5mu2RHlTxymoE+3iI1QF21mb9Y82q9asq2PuCILz+53Bm/rs8ZPl0T6j06qSU9rL8SvkzFhz7B856/yobCPuFQpz7jnZo+SbWcP3VqRz9lbBu/TBhSP6mdWr+PB4M/3oPQPg+Fcz3OpZC/v0qVv+zPBUC+iyU+fAXtvTAcej6ZqiQ+F82JvpvM8T34XXg+tQklviNT0r704qu+XxxmPmUVPz6ugeK/v09avtUj876agPy+LabWvpeO/b3zdBg/wyHuPbM8nL4DfKy/9wYePmcnzb+LgRi/IHjcvoqJv72CAsm/dwZYvUUV1j6QzA8+yt7kvrGKtj5W06A+lkUMPpIc4z6Sd4Y/B1N4vhDhBL58+84+vUImP/1KTEBUcIU/3DohvnLkbD1ih/G8PPuhv/u0k71umeO+feR5PkDd4TwcfwG/",
        "X8VgPpH5F7/YDYK+HZSvP7YuLL+LlAG94EwHPkbhMT1SHRm+4qPFP9483j5E4EK9qN/GPF6r2D8fuaa+X7BfvhSDoD/6SBg9UkzfPU1ehL+ZDRy+J7Abv3vvXD81WsG+cW1QP3c/eL7NT4w7aoaZP4Z2Tj5VMpY+6pmePnPHVz2FQay7gyQOPz6Yzj7TbqU+kR1aPlYmQr7I5jA//JaHv01GWb78a9C/HhRaPwR14T8iC4u+KFMQwC8b67+gtVS/cvHava2ZUT9FWqw9UtJkvxSxdr5jnCS+z8FavoudfL6Mupy+9nO1PVd/6L6B/Za+ApKdvnuBNL/m0ZG8cEIyP0x4DL+Cw6K/AImKP0ngGr6XeyQ+g14FP8YzUT9AGjO/fe/LvuKUUTxwmky/L2oFP1VIcb/EXz8/ApKjPSfF47/fOFm/z8bNPdmqBb+9brc+YJe3vq67K7866n8+zdecP5Baqr17dvQ+fvrov4ojNL7DgJA+hClWP9IjLTp6lgS/4PAWP3ygLr/FVHQ/BZYIP6tB5D7dtgw/2fQkP5ccJjyDRVi+X0FoP4PsIj79gRw/004DPoECCD6kijG/0t+oPkJC5j4ykhi/lWbpvQuvuL8D0f8+aecQPwIdRb8ED+A+LjQKv9/9dz7EuN2/alqlvWuYmb7OONk+jp2oPg5lK78KlRS/q0XovqcyA79OlmI/BnglPnaI7D4fm4O+0J7SPZv6Rb9sKk8/7upzPp/Cjb9iiSa+MqcXv24brbxrLZi/4J9dPVhOGD9PAWU/dKsQP5cOsz1cX96+oWI3PgYFCb+jyyRAXVfGPqrDg76pakU/A1uovm+VTT6vP28+UWh4viJslb9o41E+d++4PuTlPj+idci+qLL8P6XsKL5mT44/LifVvkPkPkBHT4y/zSewPbEgab5oLxA/ImiJP5Fbt788nn294f4mPwVuTr9e5n49sPZWvIu9m75IY5a/XoC1PH+XKD2aK/E9z/z9PFjH4bxKXDI++6dqvcABiz5mJOA+",
        "upOUv0Ezpj5A3uY+uBg/vynpS75/OyU/lh3hPsmSez41P8u96WCLvm+IIb+N9Nq924tnvrQ2E8CWay8/M+jePTFJrr+exZ4+uon8vWPQ2T6XTAY+/anyuginSL+0w/y+LORpvnlHAEA2Au2+li0ZvzBkzL57qyw++N6DvgImJ7yEse4+9I3XvuuuxD5/zxW/pcEQvyzDiD5eDQC/DkBLP8WjlD29kHE/LplovgTA6j4jPN2+Ufs9QOTpjj8b9QU/JXR+Pj3zhL7b7NG/Lko2P43gPb6ZM2M9bWVgvTW7Rz1Mn3u+ZIzmvBci1T55XyC+2VtOP1w6lD4Fkrq93i+dvq5hKj+cprI+SgX1PcbLVrwkVs++ZOEGv6/0AD/W2zs+TfhFvtN6q77ATfO+zTWzv5env70zV2U/0vbsP+XaAj85myU+aCZxveOdeT70rLW+ymYUv7U8gb8gEbY/ck0xP8lqkr/1tMc9zw/6vjXMqL9LIMO+V+5sPbwIGD9YhjQ+xLjcP27TpD86VBrAxcc/wAfDb7+HIF++5CGqvsQXobu9cAM9mwPaPZWM2z49d6c+Nu5jP34VAL7EjLE+ZkN6vEf//j5YvQq+HXllv65z3j4iYa89PAJfP6Qbbj8byZO7E9n3vbyAzj0b3eK+PUu6vvvl8L50CUa+LtU3v1uvuj1IZQM+mtxzPrYVKL1Y2So/WzEpv/6odr6RYuS9+kBUvlH2/z1hzg2/bt5DPfPrLb/xzaW/dg4YPmHX5L1cGf69iGt1Pd77/76wo7C/cxQpv+n3yb5Nmck/DR+gPZ7LWz979z6/iPINP1t2OT8dwgI7zmlWvDUBI79ea8W+mEwZv2neLT2WE+Y+r0syQJGxCT3ojDVAvQD/vH1Ye77cuUQ/aO+mvp2iJD375zs8veE6P38jC75Bjyq/jdolv0bph7608bK+XWVev4uPdD5LBPy8GkbJvSGNlr4WcSi/rfvCvaoDmb4unIw+yAUuP8AK6D7YWaQ+3cB0v2PLnL71DKc+",
        "vJXpvq9JVT8M9qA9MfNIv77fpz9q5Fy+VbsbvgLwsL6A+Q6+TGD5vYxvEL+zky4/Pcijviz0Vj3e3Rq/hvh5P4w/nj/XCoA+QTwbvBy8lL8Al9Q+R2WkvleyB78wcZc/FUBYwFaStj5xeb0/eio6PomVwD+E7ty+PAPmvvPRX7+lHby8ifKEvymv1T4i5JM/ntYtP/nn0j4wJak+V9n7vs3pFD+4KFY/a8jIPv9crb+r5Rq+QFQhv4S7Qb4jRto/FDiSPcXG074C4Ku9asmiP5IiPb6tmcu+HMHlPR9HjD8CaLo+69RXv9r82L4ENcA+iJ1LPokIXr6HxSg/819CveHG6b6Y9Ze+uZ+Vviwp8D4px6y8yosbP8KH8j2Kxro95zwLv94S7j5sl4K9XTaivhQvw728mYa/YQydPuvem78dteo+pWC8PgpUhD58iOk+nVUOvqvQIb/CYyk+YaOAv6QGjUCjGHk/iXO/viUBiD92EiK//Q0NPyD1Wz4wh/E+VokivzY7NbttAc4++cNnvQ/B/L6QtwFAE/zyvXQPhT+k9dO+OTuMP4Vk3r8YqWM/imSAvsoPxj8Wz44/yKAZwJdJnD71RKk+cqPZv3WU/b4pcTY8bbCRvngB7r4UH449iJrJvr2s2D53eVW+qwq1vgzhjL3zUYu+eowVPg59Gr2jeIU/8u3CPimbUb/QbP09wvh7vrMZTD2y7T4/YEuYPrkWUT9Mbq6/7rOivs8ZOT8aTfS+s6kHPi0/Cj6hGIU9qGkHvyMSGz8BAKc+WnNbP94QXL7mT4u+LnPOPvYlAT9jz7Y+Kq9xvxZNZb5yMSe/U4tev+pwSj5LByI/kTmjPnQfE78O09s+4SRvv6GKaD4jfsu+G/0CPtdkxL4L9TC/6zeUvAThgT/bqhg+yF8EwKxYlz/pDxI+/fY8PssUO78Uuik+o+bLvYF32Ttuuus+xoD6PleO3z7sTGU/Ao/FvqYwBj9Tqvc87U7Dvit14D5PbcS/NBQZvsdgFz9bQg+/",
        "GyH8vbROrb4h4RE+z8tUvwNwPT8K/hw+O6rvPdeS+T0l87a+QV+KPoaNnL3RWgA/kfecP2lSxT3N5Po8sj75PZo+0z3zjb4+/BmoP8xLDj9wtzY/t8Xlv4PvQb4VtoO/Tv1hP81NC792uRq/U+igPjRInz0n9SA/8+9oPvnEkD8v3VC+L/azvn+yQsCeVgK+6Vc2wNTiST0K7FM+mTIpv7eUBr7J0lK9Uk+iveHsk796yaw98bbzPqpA/z55QIM//0JEP2XmBT/7gFu++BqxPV/TAbzFROQ+4sP7PkpWvD2UmYg+9UyIvYRNgb97I+q+r6zJvh8EjT8iX9c+ms6SvvHAiT5DigO+1W5oPviyNL71HgG/zxI5vzfBLT+z99m+9NzsPo5JrL7gDnM+ap0lPtqBKT8tGkU/52mFvySMt7701eG/ZBcdvaU2/T60WZC9M3UWv2fEaD1UUz0/+Y7/vu1q2b+CQ0w9T8z2vilRN793YHQ/Noo2PyPxIj9jAmy//ASfP40UDj91efa/9meSPd2Fgz6ba58/eV8Xv9kCQT79ShS+EBvzP+Ic/r5cYDS/aMI+P5SaDD8jHxK/MFYMPkPelj71Xo++gm4iv+g7eT/tyo0/kp6SPo0Drz/FGC6+0RCTPrqCEb5cW7g+wW98PhW0pb6IOHa9zfwjvs8R3L6lDl4/avGkvTAB+r4rnyE95RqPvgEmxb4j0R2/a15dvVsdy775HTc+7EBCvRy1pr8Jh3M9W0AoP0HCPj0XU5I/X+eBPtmwQD91Gqi9mwD7vh7C3L58RM++rk6SP6M9HT+ktJK/dBvxvVonJD5YqGW/cbSPPbpLtb6uz/c+65qSPltHL0DMcG8/pO38v/dQ4b4IHC6/rv6jPrclL7yox489Ygm2Pr1a3b4Yuak+tyGwvSSsjj96srG9DEkBP01zhbxdbMY+e05TP/UdEL4A7qU/KTmhPQigyb5b1jc/rJXqPQskOj8gChy8WyGPvs/ZhT7Ndky+JUj4Pdiwnz7o76c+",
        "50jLPQ2l/j3D++s+AB4tPo5V7T54AqE+OoykPeh7ab6gNYW/+pvMPpQtGb/Y8Z6/h0Qov2PDsT7Np8s/nnVOviX8Gj9+OEG/WMH6vkZLjr6uYg8/yQ50vrqREL9+gpg+9c0gv4f4or4bBEy+vTBHv7NGZr//6CG+UjBvv3uTPz8hUbC+Qf9Tv4nqZ7+26M4+HoDfvVMuNj6mxJo/olAcP3eFjz4JHne/K/E9vYBmbz91LHi+vBVdv5CtoL5cTIQ+WH/9vn4R8D05yYc9H6CHvTxF+L8xQNA+1/VuvRKCtT75Hwe/HOsRP/Egv7/iZyQ9r6l2PhLG6z0Y/aO+grmEPX2KVj0qIgq+9AbMP9mmBb08gnC+f1n3PX/dGT15rqS7fxfKvhqbTD2qRrW8EUY0vnxair6qMT0+SFlbPzPo0b75mDQ+mlX5voygfD5FRAe+vh10vj+56z71eyW/ZJQmP+Ob1r75COu/5G6Xvge+8L5RWYY+9O4YPjyBMr8NFv49vWbJvxq+i79qhY2+3q9Vv8jMA79f4aW/M3i/PRuSMjz4XPA/DX+9vu2paT93RVFAb0xRvn11Gb/Nloi9CE+9PhSgwb4EIEa/D6b1PtwDY7/MDYW/IquLP4NFCD7aHHS+N3m3vXQnEz8Z60G/go0Gv78INz3irvc9WgmIvj4Twz2PkPg9vbITvyvSfL67khU9P9udv03K5b6rtpo9RlKQviU7Pr9rrEY9yJvIPaUkIcCmMt299Y3XPn6tib1CSoU+UjMiv2zybj6OVw6/WPYoPVudXb4Nqhm/TvnDPw0Dk78xJcw+Du4GPzuIDr8br5O9dF7LvdDA1DvYkxO9+XS3PvWC6z4Zntc+vgyfv21o+D5eeJe+fQEeQBQNBL5+l4k/H5c2PsJnsb6HWgDAmdFSPxW0sD3xNPk+VxEdP8M9tb2ibpg+T31XP5lCFL8QTWM/wCNvvUUtar/qsMA+U7dyOqsB0L7U+jQ+pJRXPu40/zo1W08/pRktvWxeu7vpiLw+",
        "QyesvoFZb799clS6X2vuPMAWYz8QmNW+9qtMv99C/r2MjgK/IYRLvwDycr55IpO/5D2dvdw43j7WWUi9sE4Kv6RiL7/I4aO+x1dOv547Rb+cbtW+/lnNvlKvpT+EKVy/DZYJvyxHcr8ZjOi/9AVXvxdBTb83uik9j+OGvtwJr76MW/c+TvnyvtXp4b0Mo0C/HTWduwAAKz/pYL2+lPbWPiXzOT9dXS08VFbjvrThCT8QYdC849YvvbOiCEA+m+C91pEWPmkb/T7rHDg+j6BPP68VeD2tLJO/zgbaPxZYBT9HnH29jvxUPzsQHL3/FN29/4bJPkLpAb2+OrA+f/EVPp7MF7/jQQo9R/+HPvP19b7f2+i/dv9fPsHfMT9azq+8RqKYPjHPn75sp9e+j4m5wBasg7/JJ24/YHMFP4lwHD7vAIC/WcrcPc51/b4AZzg8BC2EPkQHiz9EY64+rrIKvQ3FIz9ZkS4/toDcvz478j2OXXy9oBOrvtCCb7/mkzw/AlatvoL6gD88uvU8eGChPsVxur07lTo/iGc5vsD26D9ZAaY+5+8gPsWKcr8zCJC99WIZvuuahb2Vkmw+VwIBvwbB2LyMpik/aPtpP83EAT/366e87DNQvqdJDL+Ct8M8hbw1v06I2T2NTgc//oe1PCt8Kr8SNQS/5tCJu9UpzT64moO+nMvXvrAsHT7InwU+L8XqvfgeTb8FAQI/sgeXvsqCrL7JXsG+0KDOu38cHD469xq/W/4XP3DJ07pc0749EZBJv9eyl70iM9i+cKWevoPN2L7sf6K/oSbYPzFiXr/4GE2/z4qEP6+Om792VYq+qxwGvl1pgT6LcG6+bD2XvPjN0z6CHk6+vQeLPhR0Yr6W/hM/uRQNQM7H370uxYE/W7wjPg/BRr5ZnALANU8OPupJy73+Tjs/NpOfP2VrCj4QFDs/o/UnPw/UFb/BToA/fGHoPaQmXL/E+qe9Er9TPy/RB7/1fTY/rKggvwk33b5JziY/OParvkFYej5xu8k+",
        "oRujPvjw4r0uCqQ/qqNjvg/InDy7koa9HbhTP98qir4qlEe+Buzivmt4V73K+yO/UmDsvXV+L74CcMA/AjXKvkG37r9KiIe86qqtvWfEIj+JDg2/eP70PJtMzz4UXIA+zqKjv7uwRL//Ix+/lcJsv+XprT4Ybho7A0Z2uyrI7z29ab4+M6i9PoSmjj5ylju/IYQjvrXsMT8cr8O93f4QP+J5j78vJuY/Ku6Cv5AOLsDatDw+KRpSPnmVD0CKB+W+U5KcPo6TFD8+FXg+KQ2yP7epDT9vnKY/1CAOv1rr4rz6RF4+lhiTvQL5O7+sHSk/hoyMv9iHFD/1Byc/m9b5vlHuBz9Uc76+Ho5fP1ck+L5MCOg/PtQAP8bHs7411WE+VNErvtmTBb+l/oG/yST6vJvu1j6X7Z++p7M7Pxc/Fz/U7A0/DlLBvo66pr6Prga/8vjcvL4OnD7T7HO+vBp+P06LIL/LDte+PIEPP5MNBT3aa+Q+BlPCvqS7ur5DTGw/ek6jvXEL+77fzp694CUTwAmp6T46cwfARZcNPxGwmb56Pas+e+b1vzduiD/d9Da/aO0Dv7RmQr+Ve0o88VuJPb0diL0orua+P1jOPfu3JL5sYNe9G7arPmJF5r4ixvA+hoI7PzDJMr328BA+bEqcvdcqST5QgwM/YeCcPs54kb6XqSO/78+Nvn6AEb5tKgo/SGi9PtF7JD/7TgW9r984PZsD574O3kQ/PM3jPGX8lb9IO3K+1pVnv6WJ4j4g7K49x5MMPwGZNj+K8EA/+CSTPmFYAT5u1Tm+/Cc9PiDyX7+uUrI+PRqTPorG7758tTVABs0gv9i5Cj+8mek9U31dP60oCsBge3O+ZM4DPrdcK77T2DE9jF1CPk44Kj//MwA+g5yrvnKqlz9M38g77rWvvj1Vrb/P2hY+G03uvSX15T4Hbzi96jaTPYLWw751MsC+szjMvf3LHL5wMuC+j9QFP84dcb0dvpa+V2iSvkxVM7+6voA+568svrkX6b1epYA9",
        "gZz1PSZ3xL1BgDs/gnmWPyttJz/MjaG+IN1BPtb8Jb/YV+m++ePHPVFmiT4XXkjA18mBvfI1vD7T3Cg/dh/lvowjkD45x+q9kM8Bv9Lq/70NRbc9CRuqPM4lQj9khvs+rhGvv+x4uL6t5Ru+SyvQPqVbeT2ukR8/mIhbPl3MUD4n1Cy/Q7L/PuSi2zuvPhNAMkzcuthLcT8/FW0+Ac1TP1EMXcCegjVA8pJRvxoHDL9WJ1A9DPIxv6MFhb4Sfha/RaqVPqp4nz/VRj4/XKu/P8+cdz4F4Vo/tGs6wIH5+b0WBO49b6TcPbpnvL8D2ew+++7pvi7aTr7BNVs/KlJDvqq8gT2r9cS+1hI7Pp4aWz3Jf4u+ag80vuI1BL3vOaI+xrVJv2IvTr4d7oO+WMEiv/tn+r7/39+84j9oP8Fl2r6VOoC/jFD8vtfgq7068qU+rNlVvtrEpr1Ea+Q+3WSFv40ZjD8nzgs+n/6vvx5ncj6144i/LM9FPoBHuz1Jp4A/EnF0vsfurz5iWWg/f4MivYMMcL4MN80/39LovYpHnT/2/mC//J69PiLW2L+srws/yshHPvOKCj+gozZAxPjlv2xLbT4Sy34/41OQvYepGD1JABs9EfLqPldHTb9Xpjy+0CEIv0PMgT/hzL+9j82HvfONFD7pEpQ9GAervX2nPDyuzn8+e2IMvg80nr3Grzg9wNoNvkZQGz6Vd4q9LF45PraHQj8ZrJa+asZXvJWqUz8kUdG+Z5slvnED1LzAXr0/ugWJvz+Pa75fx6W+43oXP89C1L2Ua74+qf2YvrR0NT8rY4W+BAwTv313pj60Dza/3P3uveLL4L5bv2a+mwqHvnfMjz4QdI2+aoABPxvKN702ypi9fuAswAru/L7PfmO/uyT5P0OBKsCJ2eY/F/EZvjgy2z7bt/w+9W5iPfbrCj1RqRa+DoJfvm1r9T8p/Lm9aLm0vqnDkT5HsWI/ce/WvhDpaD4Zw7a8J8yPPsIESTsUjxU+6bfnvsjSsD0Im329",
        "xyhZvhqlvb/db3i+v7EUP9H5Pb+7wMQ8oUAKv3Cv5r7hJgc+utsrP5fMaj++Kro/5a8PP8q7Iz7byYO/IoSFvo//bL7N/qA/ciaePk74Mr4j+0G+IeRVvpqUDj+ycYQ/O3Knva1B7Tyztx0+WvGLPlJCHkB6E/09h7MaPxXiM7/aVEo/yHo2PpfpZ786DdA//eGePhrzlT5vHoQ+BRHrva1cBT/SXmY+sXIau3QH4j6N+/89cvBPPX2/gztylk8/JzH2Plnd6z1fWoG7Cuk8vjEnYr4X7Ki++rN9vw4pmz3lbu4+nnlNvtFmJL7M62w+/zUhvEbMrr20Uik/yUkGPx1lib6LaiW/5NdnP5pHLj4GYd0+WaaEvo+8pr8FY9k+OKdLvd3OBD+FPvA++Ye0PXNWhT80Ybk/+T9zPgJvQ7+VB1g+XiWgv2FxrD4sPEq/Rg3pvAZCCT5dIBU/s0YQv3x4QT+gEDw8IBYsvvcs7z0t9Qg90z09vvPecb7i7DW/VHIBv4hj771jn9a/h9OXvnV8HD+gOwK9oqOBPVckFb+bpo8+QjRevohv/r1dRKk+T/zUvZjtHr8k0Lw+ou4JQMvuWL+Eono/MRA3PmhSbz30LCa/WIbyvlOZhj4dbrG+kdaUv+6crb+aGJO/7/kDvw6DBb8tHQA/w0+GvsdQLj8="
      ]
    },
    "bidirectional_5": {
      "backward_bias": [
        "LNeQv4viab/Ke+m+kOnGPog7sL5QK+6++Ojlvrq8hb+gXYW/a6gWv2ZmTr8yv76+A54/vxTlob/twIO/NZNOv4jkj77O3X4/bdQAvrAvJj8U5KA+LqSbPA4ksD5Kg5U/3QeqPkBrLD7kgCi+uWZvPhr+JT4YiDw/MunPPkWGQz/MYKE9nEoevv8Wxr1hKGG9qa7fPZEhFL651iY8dvbUvnbtUj7ZKrk+VBjtPAclp70URfU9hu1LPjdwpb3eN/W88BpCPSmez75U9JK/jxayv89QT78zv0C/yE6Qv2m0a7+5Ev6+B7O8v8rfjT4cyE09F4FqvzFlgL/attO+ndQmvw=="
      ],
      "backward_recurrent_weights": [
        "KCzbP1q0E7+nd6y/8zuOPlHRyr90DlG/SVziPvjvoD4RiMm+vz/yv3pJm76LSQPAd6GiPirFkb/sezm/x0NHv5OxGz9QsYE/VLngPrFFl79nQsK+4tWIP9Q6jb9dQ4+/a4XNv7eu5r/5uC8+01MRP7UK775mu5E++x59v91PTr+k0V09DmyBPqZlOz/Kc5Y+hWHivZGyYb5i2VU8+jCIP8ukl792HDs/aRE4vrowfj6aPYU7qpKuvmlfUL8f0/4+QivlPkT1wL6Iv1C/YZNRP4JAnz8UhNi+y46bvrliqT9AUSo/aiUYv+EZDz1FH+A+wOgsP2RyvL67ipK+5j/AP2u9qj/l6o6+wmVeP1sBsz/DvpG/aBivPq886r+GUo2+BKxovsiq/j9oe2A/daNbPIAbcD/Ldae+RnkOQHicib+vy44/QAxVvZxWBb6/pMy/6O37vnNWcT5HmsY/INTUPx3Q0z/eaBK/kcRBv/LUUL97RP8+0MvuPvR+kL+wxpO/AdM1v/AGlr+Nr0e+j380PzQvBr8en+u+RbnVvtEcqT32Cwk9biKyvGSfAz57vcc9FMPQPfDaCL6ZSnK/sPwoPvcWBMDu0RG/LCpjPxFSuz9fYkQ/yOhhvm0jtb8WAaG/dbMXv6QE7T8seKm/15f0vwSadj5tr7w+v/kcvzf4kb+KR2m/U9kivkdqMb+kxRQ/zm8MP5kiwTyy1j4/9F2ZP6+zyr/R6hq/pTUDvy0bk74Gnis/RTPZvR1h7b7+en2/ZmSTv6Z5VD9U29C+KTeFPC9okj8n4vc8qCbWvN/MRD9j1x29WR2xPrzohb/iCDc/pb34vWojlL+1Ezm/3gH0Pn5mB78GHrQ/vIE7P5mN6T14xWo+f3lQv6PWmj5zU5W/nsOoPqfvjT49cbS+vlsSvpbTOL+AhRk+r/RSPiivj7/U6uI8yTyMP3LX0r/UYyw/Aj7rPx5goz9Xv3+/8HWNP0wLjb9crB6/DUYQQOZekT+kriw/+velPIEa1D46AUo+",
        "tROWvmM0m74ewBHAAS0Zv5oGnD4rNKw+atYovnd+Oj+PFdS+e/a9P+a1Bj76Jqw/tksmvnWNcD6dgJq+rVUXPjsItT8pUXE/Jj3NP0CZHL8uo/W/mLsoP2cJ7L9TIs6+/RiJP3sntL/oHTi/jdu+v1vmKz4N1AdADDzcvvahJb+ChNm+h3w7vzrzHb+6dMC/HOnGPpBiPD0rYx09n1FBv/PGxD09SCQ/piwEPgXthT/Q8og+o/G9PewjPrxH3o69DE0UPxfr6j4DdAlAe0NNv86arT3+VOS/GV11PyJCxb8Z4AO/prprv6SqRL0j/47AnAH+PXlhFD/bIeK/NyWqPg2yR7+d9xY+TEJwP2xATsBaAzE/1yK3PNhtvL9hkts/vbuLv5CCCL6wFRk/Ww1qP1s5D72qMQo/poj7PQFeJD7pRSM/RohLvxW9X73ukL4+NfejPlGgs753pj2+lIeQPtY2n74l+OQ/0nSuPmNcGb8SW4u/UdMIwH73B78SZ6Y/nuBQv9YOyj5/csQ+zvXAvtDYIb9W4oY8+nR6PXAF6T+NTNy8RasIP9TMyr5I46o8eyXCPp5WNz9Fg4I+jjUovw/2wD/nWSO/uPGCvg3MPz8VEoQ/7xYdP4Xx2T8/W8U/iZUOwMHe1z/s8QXA/y8kP3umtD0Z16k/Wj+uPg1ezT8R9WY/eY+sPp/wSsBCNQHAjY87v81jzb+ykO8+JRL2vwEZmr+dMe8+v+URvzui+745G8Q+I0LPvq5P1T3kJbu/D7w9vlF1Zz3LjZc/80/sviLOOj6vLpk/b+MTP+tNVD7DPR7AOqwVv50+h7+dFzy++JZAPzoj1r/q/Q8/JZq+vri/WT2kvok+WqE4vvB4az+rI0U+3c17P2KHoz7WtSw+6+WCv2uKfD8lKn4+/nSEvgLHY7+ZvTa/V0MBv3vpGj808jG/1/Alvy3eIkAAosc/i0zGP6ntgD8DwAC/yCPVPxOJ5DwpeKg+sMzAP5v83j+3mxQ/ulepPldwTr/g8w1A",
        "ivu8Pto3FD8r2c8+qiK2P1dMijyi5FM/ETFXv6l/Rr+OYk0/6TiIPqYm6L92Zwm+ja+kvzG2BD91JJM/TVxQP+OJg799TrC+lvJOQHCxwT1h6U+/pwr/vtL4Zz+otMc/Ycw4v6HN+T4mCpC8KqmPPiR6xz9Xlzg/Zsovv0fBkj7n7fk9exwRP8sOOT+Rsfq+3APIvwVMgb8N93w/WdrSv11mZj9VfEq+B0AUv6ui0r79kY2+Bj1RP4Y08D0wV0i9su+mPqiDoj0FbJG9pAsqPvFPPL++gV2/zrFbvzli/r+a52s/+ogSwHB0Lj6VGxK/VhwUPlCJF7+A0kw/AxSAv1zpiT84j50/DvjBP7+4oj6AlCK/oZ5DPyZtBr8O6ZA+Mmy+PjU5HMD6VMm+OHNhPhGeGj/+bjw9/CKLPyKoqL/lLuO99ETgvzzZF79BkRBAq7prP4d7S74aGjrAmfBRv7x+hL+vSs+/+TnDv5gRrr8ZEca/9T8wwM0gVL76hyI+KPNSv0zzgz+BR+0+Q8VqvzXvbj4tdpC+fKaIP4xVPr9/hVq/SqGvvVm2K77LIlS/HXmHPkRmIr/6cge/JEolPgQw279jPh8/Bj5Lvx3R2D5z0ze/tEOIvqUdjz9tsji+IFs/v4ajRz3tNqK/UTvtvkD4tz5FOR8/aNFRv1nFMT8X8dI/CO8bPvkZ7z97o1ZAEm0OQDoTA78q/CK/opXTP6oB9z6VHcg+CyCdvzG/5j5+8jA/pERfP6VWgDy1sG2/kuNyP7JLZ7/c0Uo+ZD9+v6/WIL8ITAG/wY21vxYKwr+IE5K/EApQvwwtEEDSFx6+PZzyvsb2+T4GELK/4EJ4PyqNNz9J394+HoAMPy5cF76mSpS/KhTHvaaI7r4atKC/425VvxqMj79Jdxc/mo4GPzAC9z6HT2E+yThwP5vV3b5F8re/YF5jv/AQqT82G7Q+d0BFPv72yr6pPOK/XMGSPHeDDb85K54/NqLLP6cgUr6TEak90zEvP8Masz914iy/",
