{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              10
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Embedding",
          "config": {
            "activity_regularizer": null,
            "batch_input_shape": [
              null,
              10
            ],
            "dtype": "float32",
            "embeddings_constraint": null,
            "embeddings_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "maxval": 0.05,
                "minval": -0.05,
                "seed": null
              }
            },
            "embeddings_regularizer": null,
            "input_dim": 29,
            "input_length": 10,
            "mask_zero": false,
            "name": "embedding_1",
            "output_dim": 32,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "embedding_1"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "batch_input_shape": [
              null,
              10,
              16
            ],
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 5
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 3
                },
                "kernel_regularizer": null,
                "name": "lstm_4",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 4
                },
                "recurrent_regularizer": null,
                "return_sequences": true,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 16,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "embedding_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_4"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 11
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 9
                },
                "kernel_regularizer": null,
                "name": "lstm_5",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 10
                },
                "recurrent_regularizer": null,
                "return_sequences": false,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 16,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_5"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 4,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        }
      ],
      "name": "student",
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.5.0"
  },
  "hash": "eeadc0105330501986514b3329e0e1947e26ea5c58ce5a3097c22645b11b0d8d",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      10
    ]
  ],
  "output_shapes": [
    [
      4
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            10
          ],
          "values": [
            "AACoQQAAQEAAAMhBAABwQQAAgEAAABBBAACgQAAAMEEAAABAAACgQQ=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            4
          ],
          "values": [
            "8bhFPiv23Tyh1ZQ9XQc1Pw=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "bidirectional_4": {
      "backward_bias": [
        "HGgHv2Z2YL5Ccli/tg/OPjzpX7+MEhO/iO9VvifIqT6bm+S/fUw/v2lHEj/2CgS+nuBwv9o+Bb28J8Y+I7a+vYNJMT91Fd0/6H0iP9/olz6l6wc/tTGcPtvUzj++KpA/BoI5v0BuBz/9T6E/Wd0VP+8c0T9xUKs/s3QyvAXvYD90ghk/au2OPTEfND6xnRC/Tr7JvrxZ1r5HfqQ9LThEvi4RkL4jwa6+lK/WPoAdqT39NqQ/hYSzvu3w074F3+E96pSJPRJDKT/Map4+7werPsIKgjs5Gvq+sDOQPT0rQr41JQ0/xEVTP6j7Fr9hitU9kThfPzcsnj4QJtc+yUdkPw=="
      ],
      "backward_recurrent_weights": [
        "5nwOP97bDT+x/96/ATFGv8UPjb+Auf6/qlV2wK7BpT8nqLa/3qtNv5rftb5oKa+/Msj0v08o7b8LOI/AInFcwGFrCL+0vKw+6Ya1PyboIsCabBO+JG0hvxqf/j6WIrA/+5Ccv3plK0Ast56+mhj1P61mZ72OGiZAKbCmvwigPr9gH0O+3H76v3pMqT6b0Yq/6qkOv1q2uT8Hi1k/UxTFvYkRBT+jHfa/u7CFPpWiPz6OFxg/hrK7PqBthD/giDy9fw/XPSKpkL731DO/Q4jMv8ce578xuUO/wj6nPioPH0D1aWi9BPaTPxTJWz8jqPO/SbgCwK4XDb4YQIa9bgakvq2z7z37Q5C8rz8wvyz/4zn8C1s/KlNPQJDGCT4GgZ8/L0JkP48GMj/4y+A/mXNev5dyQ0AL6Si/Yi/NPiWB7T88x1o/17SyvTBBJkAe+uQ+ezptv3h95r/14M0/nm3Ov+d8l773Rro/tIrrP23L3z4rhMk/MShKvtYBvD8PQM0/xmAEv6Z0jL9OdYm/T8LWPZirjL9MjW29UFK+vcrOc7+RS0u+veCKP9nHLr89Zla+cvgev1taP78rZzE/p6CyvdENNr9GIs8+Egn7P8rxkL5gsv6+qfDmvYf1Pb8Y95O/3XOBP5OpEcBQIhU/94mRP04fqD4rw2w/1182Pw2DGEDppaW/MyVMP1cMgT/ugJK/gZkKvhIW3z+ZeFa/ihELv5Yvkj7RPv6+e9B7v3LtgL6YLkfA0TMDP1uRDT78X7y/gF0RwPgmoz9/2o0/6vXAPps9fz7q0/q/2ONEv90GJr+kNQxA785Pv0imRz8ywGk/fic1v2Y38D+nzhDAeIh9Pmt60j4yAmM/3rDQP6rF8L5BQNS/CMApv/59LD9cfzq/F8LPP3GRoT5O1/A+0UFKPvC+PEAv+329Cx8IP5AqwT4ZmG8/Nl2CPq8hJj+E/nO/9970Pr3tor88nVi/TPgewI6+3z9uXZw/HMymP/teE0AlxEE+yB5nv/X0iD8tMta+",
        "VW86v1znMr9NHjY/hWg0v/zLcb7XgY6+MGmTP07Hfr+c4TbAXMfOPvm9E8DzvwE//9pPv6eUCMDqboe+wrQSwGHH5L6Ol5o/ddsrvxDz8D+yHe4+jHtrPtLocT/qb7s/mnXOvnuunD/Jdha/jEkfP6wnTcBwQNU/GpsXv5jIFD8TsLC/dW61v78iub659Du9iSE0P5uI27/++Fw+VySiPq6w4D3Kd/M+dGc/v8HBHz+xjJ8/ExaBPsw9p77POs6+PRzcvUcfAEAqQTrA283bP7a8uT+58yW/WfJZv/v9Wz/wvzLAGzWrP0YSLcCV10K/CsmbvZI5l79QDOO+f/HLvp3mEL+eMbA/yqY4v+EPoD8/9AlAl0zrvp+UkT8e2wi/OX/Wvc9wFEDOHGK/BO+LP8mHu7xgZja9RS36vxonIL8jpxHAmt33vwoVX73Lxm2+2yJxPgQWtD8uaQPAV3MuvgyLMb4772HA3qinP0JV1b6obwrAlE2ePtREdr5OkvQ+W8/ovr0s7r4AHxA/GmI+v6bn6z7HkqC9Ka6GvgkqSz8y1j/AnswDPxJBi7+N0U0/gJLpPw+Enr8wdmY9xjMdv/JM7j9G/6I+BdXFPtcToL8sVQPAkyCQv/TJSD/+M14+C2tBPy9Mh78oKcG/W+EyviuUlD8Y93a/X2mqP1vKkr9ffoI+zEjOPt6lib96krw+xnTLvo6eCEA5x1Q/UViNvsF+179aMzNAarXfP+K6GMBnZxK+Hps6P69dQD+NdkNAdyFgvXlt1z4e3jS/wQ9iv0db6j7nvg0/dBNWP1ZWZb0KBpG/pkY0vzvdFz+19cg+rduiv/ymNkCbpFg/lA/3v0LpHMBkH7m/rjx7vrW/7r+IVdc8ZDJgvwwV7D7EdRU/KYXsvkk4ML9i2Mg/rbpiP9mQ4T4uou2+4Xlsv6l3SD7L2q8+ueYYwCsuEj+BkFW/KcaIwNzb779Cdow/BGY6v9qcpD1BFZk/hn0AvZIBy77Z6ZQ/X6wbQD1kr79qdTo+",
        "6rfmPo5fLEAecitAxecjPi88mL+ahy7AUjgKvhR9rT6XcoO/wq/MvsLwd77XbOw/WcnFPyfBBkD1mJI/DbUWwAZnWj9zquI+ayd/vwL7Wr+aYUO/PrIVvx8P0z8q5K+97Zg8v8XBUj8rkwi/gaRavorivr2Jtz8/fDWTP9fBgr8eFfI+59BPP/Jfkz8I80E+YvYYv3AGiT9dr0k/M29APY1eUj9FBR4/O26AvJ9rtLxrAt4/cPNGP7tA+z5d/FQ/X2ZWP+RA2L53j12/rNXJP2mhiL5AiAI/ptaXv7Dp2L+Mwui/QHo3PwBWb7+9JibAiBc9wMiYXL+UOMK/SJPPv9RDtL9/7Rk/V+HAvvZ/GMAG6fM+6b0dQO7aL76qYZ8/CyZwP2jPKj9SggBAavp2v58FY0DH9hdAAeOOv6k647+BGAxA/EVeQHB5iD/kE7Y+DCCCP7fc378FD9g/JBZBP2TlF729OVM/93uWvrq6qj9hJM8/G7nBv3w0dT+Rqrs+8S9XvtbV2r3cssc9um2wv2PGBT9KUoy/7gqAP/8yy77+7lo/G0gfvyhNcb+WqDm/GRoZP19pUL/Ij1K/VVHOvr59TT/PH98/ZcULv4LRGcDjAlI/pIzzPjfxXD19ToE//E9OwIMD+z+geMc+Z2bmv4TRgUAPVAdAq8wwvzYYdz9B+jO8+kvlPZ4QJL8U89k/lgKfP0K6DD8pWwVAPqKEPkaNsz/pWwy/TUxAPIhbrL9lfxNAfK8IPa1dyz8UoCI/8errvj7bDsDOMg68eOrwv+I76j1jL/G/qECLv+ND/r/9tvK8LmPTvxjypT+JX64/Vtfevz1LmT/SHIg/FtL7v4Es7r6lWqI9VNdRP+3wij2bmAa/Dbjav9/hfL9HzQK/WZHdP1tHv76QnUM/zSVBPtO/p702ytO+XBHIPt8OAD5OugS/aGyFPtlPnr8Ob0NAu12Sv/hN575ZBB0/BK1sv1rUAb9kO7c+t9oowD0BDMASKWy+1nkTv5Lc9z/d3og9",
        "Ak6mv971X8D2n+e/Ufqqv+qnSUBrE8c9qOomQF+vyz80pVFASog9v+i3QsBIZ6c/TSqlv7F60z3ZgUjA9Q+MP6OWGD+6LZU/bj7PP9uowz+cuDbA0mttvrwDyr/1Vrw+DGjCvvlxH8DzP5O/iZZYPd5lGj/4aso//YWUv9ac/79iXwi/5mv3Ptg/Hz2oajw/4viCP/Pgar+sdp+/vzcSvxIIFr/PQrK+Hak9vxYV6j6R+e+/SNeUvil7f7+p/Im+UTe2v3Ja0T8OCza/YB5svl+I2r9MT+e/BmCMv7zBmL9Ml0u/3MypPiLz+r+Qb7s/gXGhv1R1kz9SEKE/kixuvxPYDcBF8Sk/dhobv94k/j8V09W/Q2PgP24eRLxYUqC+RMeCwB3EW75V6IY9ivUjvgbJJEAoONI/I/kkvko8pz+jYx8/S9qIPVJFG0CjuBa+3C+7PhklXr85G2e/kiUDQAevE8DmtKi9Sst0P8r9yr9+gns/GUWivx+MWj8cpMm+t3Q2vzvpYj9gVoU+7uOkPrK0Y72D0/Y/jzsIQPx7BL48r1S+7yeUvz5+kD/BQha9FbqGPzaNcD6eMPI/32oWv14gbL4FcQDAODoVPodXK7/QkPI9VuZ8vp+shL8wY1M/GKA/wEfrub83oDm/ScmpPw71lj1lJzXA0qi7vy0v0D+7A+q/ZEnrv9bfPMBrvNy+77HmPl0EIL5dPny/Qr6aPzuuHD827lRAQ5uQO6Urkb9bixe/B3wewAobXcDzzJC/hvcWv8tqCL+cvdO/VIsUQNFs3b/vy9C+efC5v+serT+22RfAk++Qv0CKCL5O6Am/7lzMPmrDxb/HUwc/8fLCPxs+/r/Whq897yWEv6fufr8LwBY/5p4DPpJzJb7lkyY/BPBlP4iF0D6EELa/qj7lvrBxtz8uNuu97JJYPk9FgT+IB74/pvkJwPBLbD4I3rq+cTV9vkhk1L+TMB+/dS8PvtAJ9T/1ypw/QVhNvkJ3Mz9FPR4/qai6P/gS4b//L5A/",
        "J5aDP2/d3D/PcwhA2TW5Pun7qb+Jv1k/DimLPUyxo78YrXI/2xRfv4YeBb7vI+w/RiwMv8eAfT9qRpe+84mSvjSxpr4ogAlAnRU4PgN2DD5iEqK+XygGPHPcxD/jkLu/ruANvrpjJb9LGDe/Cz3fPmgNXL9KQDS/v8NnP26zgT+YnYo/9vo6vvEkgr9ZTa2+ec11v1xqpj7RBGM/m1OFPnnumD/U14w/fxTAPi2Osr6It5NAxX8iP8uVXD93V9S+KqA2P2uMPj8D5Io+tyFGP1jNlz41jt2/imr8P/dbPD9Z2ks/mKBjv6R+Dr+mVHU/sXlsv4Peqj6BLmY/0veUv54F5L2k9dI/HOEtvVQ2pL8JnuE+y4UkPzKqJ0BNSgC+Bv1JPwDeDEChJtY/uPjaPJggCz/eKIk/K2noPbN6hr5xbyVAUT5kv92uiz+dk/U/24LPPkUdXUAjxII+xxPdv8Wv9r//xxC/XS7yPx4uxD415QhAdff0P6T6gr/4ny0/pY6jPxMmXj6MmB4+JzxPv4qWoD6lhKm+FeRpvxorGz8wkrG/LfdDvyrBuT7xrK6+cKo1wD4/lj78Q38/dgV5P89Rnj9yUeA/N62kPwx1AD9XuVa/K5iRP5VQJr8Spa6/ooszPcD4zT6Joe2+4LxzwHD0FT+N2whAbClEwHZgWj/GbCG/KdusvjtkTj4LUcM9kG19P62YAMD3v9c+Xh0TwCQB9z6nC+G+gwHGP3ovK0DpuMg/+N/fPq1Yyz/AnO6+JM2ZP/oJEsDA42i/LOdvPJPCnD9ak9y9oJJyP2+5ED9ttUo/9momwANZpD5+4ri+wl9cQHLiqD6A9JK/BbGKP+Rspr8bf/a+GUnVP/af7b7vIzI/JhaaPZcSxL7D400/8afovgaV0717LxA+tdoxvujEUj6On7g+KlF2vo4zO752pM++AKZNPom8jD80E50/EKV1vtxpiL/GevU/usvkvSrlWD++e/4/MAcsPwHGBj95FHS+ixMRPmvJ6Dy+JGG/",
        "f5l/v2leKMBXgJi/f2/EvzFB3z/kjnO/wvXxPhCYl7/QGqo+8U0pvnCNBb8iuDa/X2hPwDdMBEA8sSQ/IVKwv8pISb+zqg89sbrLP/aOhL+Uy1XApwUzPlHelD5Ssk9Au+6rP/P4FEA+gpA/YcTdvrXG/z/ni+I+4UPiPt8OUj8XwIS/4+gBwKCVHT+9g5K/tDTMP9/Zwz+h4ZK/Ue4wP4WI9L51Crg+IC7qvt2LyD6zS8u/2KH4PUM7j7/yEG4/iHiBv6o51j/YR+Y/FfOkv4Yanz/Skpe/DDigP5Azz76G7Mm+OH+3PlK9z763XTFA3IG8PzrSoD4wLa6/HgvfPw=="
      ],
      "backward_weights": [
        "tMHXv8IGyT0j6QW9/CyjPe063T/nlZy7vSz7PuQTZj9z4S+/TWzJPhWtrj4xSAo/E7KbP1CNYT6MMxu+0qOUvjaaCr+9UAs/pRFwP1e8aj4k8OK/Q/WMv5G/Qz/cSFa+OVAYv2k9yb2QNFS+tdnzvLNrjL/hzPm9TjpwPmKUgj8+9IU+0k5aQGAj7D5h0OY+RgWmvb/biz3Stei951sKvvd+sT4K40e/45+aP72lyz32YDm/xu+aPc3ab75nO/2+WBTHPq7Wz76kR6S+P7eFv6JShr78KeQ7TVc+vhnEcT65T4u+XrzjPgZ+m78EXC2+y4Fyvhpm5b0hQR0+Fe6sPk+ahj+tm5k+5qagPlGiubwnRPk8JaDSvcz9mT7SvKm/c5fiPa88KT4SeE0+5nIrvxPX/r4P736+LFYCPyNG1r52tje/jHSWvljf0r94Kq8/wBGLva+gqD+2Lh2+QzJXvw8wC7/8Vco+rSPKv3uQuD4dtUPAXDAWvRrD7r7hVzq/+GV5vTPuEj6vl7G/N3Ifv7LoZT8Sl8C954UUvmn7574aRto+r8SnvrSeLT1k6xS/HF6ZPtw2LD4mGZe+fXUPP1+oqT6T6/M+OPokvrCfMj5JTDA/9fUqvvTZQL+vuwc+lmWbPkrnFL8qaaC/EJGdvc576b9HfY2+Qg/SPUG8Fj4unLE9YZwGvohkuL2GVWQ/moC6PSrqBjnd3VA+MRSVPieH6j6ctF2+OXABPvULBr9hC5A+byKcvTQ9rL08pU096vglPb0qaD2RIIQ/OKJUv7kLj0AEwBe/BUi3Pv7FmL7w7Lc+TDmivK8ZFT/zvuU9YV+dPxbPwz1C+y1ATv4twByR1T7Wac++Hxq9vTqoGz+Yu4o92Bo/v8os077fXQI/5yC+voHaqj3OwNQ/6BAIv8Ekir6zs00+hPXQPDhOl74iCfk+uFnxPnfFWz6HhB2/tcgQQIPtfr7b6CU+IyVHPubTaL/pGFE//7mNP65v7D9dqAw/O2JYPlB02L4/Gjk+",
        "25pjvGbm9L3/40M/YCpjPvtQrj7XOX+/qHjfvn6aDDxPJKo+0882PtB3875/Wg8/NK02vqkwhj/8PQ+/gtMuvo8SWj/nqCG/MEeSPynanT8a9Ds/fKBLQG5IML8JqgU/cLFWP21bAEA2Nso+JxpTvyHnoD++j0BAtqCjPRWOdz3NZhk+rxrTvsnFUr0Pdy+/qcPGvj9Vhb1UsPc+/Lwlv6zrjb5u8ES/MgD2PejmYr597Cc9YMcQv4W3Fb7a47o+R8PiPY55Cb5hWAw/KFWQvpZDmj5JvFQ+I2q3Pn+rfD/vRAY/sc2fPwVQlT+uQtk/pvsJv98nWz83ZAK+z1sNPzZNI794636+t4XHPiS2HD/lTQa/SnXAv5M7lT0/Q9k/kNeFPQOt+z4FS7a+gjhjPkm7uD8okNc+Zx2Ov8UtoD/nQIE/qqisvpWTQz2fjAC/1Lc/PnPriD7gAoG+9hqjPvjj2D4FFq49evQoP7ujHz/4irA/3reIvfe+wD7GNJ2/bWrcvYXquL7OrAm9hmlXvkTaaL/byhM/tQx3PhrfSj8lL3S8I8MDvenfST50MbM+ds11v2dhrz6Nfh0/Sc8JPh4PAj9LdSW/Y5yAPylu0b49N7K/0VdcPsr0Fb5Vt529JARzvvA4BT11q74+E9Q9PvMVmr1KTK8/fFDsvK1+RD/fE2e+U0efvgH2Bj/d3ze/Qp6cvFqlJD6ystq/FpNoPvoAAz4Iakq/UrGXvlv2jT9+/0Y+2AwBP3gq0r4RAZk+8tFgP4/Kpz48p5w+cPvRvhDEET50QkG+WXGBwIRRGb+AXzy/JrrdPhgdmDx4/5e/nQNQP5Prhr2Vf5G+iQKIv0QkHb8wvmm+chtlvqcOXT6Gjp2+QjfCPZ1NrL15whO+OA5pvqXdBr4gNK++YvqUvqX0Ar+7yhY/7uW0PmDAPL02OqM+Dy0bPz51jj32Way+ksHAPq8c3b7Op7o/d+wpvgLJA7+5dgI/95s+v2WzRz24vyE9fPFPvbD7uT5gcHK9",
        "of1dvQ/xiL2nkNo+NoimvoHMCz1ecye/NJBrPjlwjr2XHz8+l4BWPt4kI76MlhQ/COFLvh17mT6bIgw907IaP2Xz0b3suY6924C0vrP8I0BM5Ig+N5k9P6fDlT8pQn0/acYaQN7dZz6dKGQ+Q499P+U9Ab/O64C8NkAzv3HePD6NdRy6X4evv4HFJD5+yTjAIqYqvhKRGT8wmgI/1UA7v+eR8D0/xkM/r50av4gszr+HtQM+wfVHvvknCL2HmoA/4M/vPlg5yb5iZGm9tOpMP35Onb8bsE89sgOuveZGL7zNQAs/T0dWvsv0hD8iOWs/UtIgPirRPr2dY9C9qgOzvgADwD5p4Zw/mnk0PiAtqL0iMeE++PHxvgvoRL8MeYu+EL0MvW+18L6JXMG9sZvuPivr+74i+Kw9+0/wPuyBfz33b5S+wSUjvratjD97esE94D4wP2lYLz+Yaw0+y2pmvsFSdb/BVgs/3wcpvx/mj77h8V8/rCh2P6/Nnjw6azu+mmRoPV/W7r/zbzm/+gpuPuWMHb/Wvgw96dT0viCLGz9Vxus8LH8svnEaQb/2itU+EKkfv6Qug75FVuI/DxJkPs1bpj0H2bq7GyaYvnKN/r77fIG+ry02vZuVrz5f3ks+EMFrvy11Tb7GHYI/9NCGvwTkur4r7jE/1N7GPXf5zT4pw7c9YgEGvt/frzq5ROa+2ZppvuQfrb1LHbO9a4Efv7rIHj+Yhw69JjrVPlQ11T4H0h8/nt8LviTNsD8cQGY+ng5Bv6HvQD/C0YI/KmKFvx2+qD/L/dc+ihfzvnPSiz9XEA3Ar6kQv3HH2D3H18q+yZPsP5qqRT+D6dS/uoGsPmhP3b0a6qc+yC2nPrnHTD97I2Y9cVGBPasZKL+NUq4+YO7svqqji76izVm/S8FOPxRHQ7+G7zy82+AQPpz6DT5pvM69eYE2P0QZBr9Gzia/4BEUOzDnAr4y7W8/bcsuv4f3tr4yzyS9mDtPverim752/pc+oiaWvC7q976AtpU9",
        "GswMP71hrL314wE9/dedvjHcBr/5Dom9++aoPmXQDD9sgrO+06+FvfZ9tT5IJiY71aXvPmh9A75mEuq+fnPPPRWYRr5Eqao8NeFQPvb/ob4vqA8/CmARPlDp0T12dFo+YQM2vVaMnL7nulK/Qv2fPhmMpb+t9Ui/xTqgP0bqAcB4hcK+SiqEP/8Hmz4JD6s9j98NPzXd6j9LO5C+/gKWvlVaVT7JML4/SwccPpOeg77T+Yc+0amOPynLyz2F4uk8tjUzvf7AqL2niYM+TEaqPrEtZz9ezJa+qGRWvwCBnb/61yW/ubRyv8THLr/31Eo+TdUtP1E0Yr/c5vE+Cf+VvsNJDb/ZGJy+IQU+v1lvKz8gfFw+FClFP3AIoT9GwJE/vfnavDZpKD1eKHs+Zysuv+JhCj8oaD4+MFqkvmK91b1ADdm+HlIaP/GZSL+fNV8/+y6aPLbphr8FRMo+eA/aPfQ+HD9GyZ0+IjWavub7WT/UkLa/XAyfv7/7Zj7o9Pg98tO1PZAVHUD4mNo9oiohPR56Ej9BmDC+TGAIv4fqTT7J7QY/REPXPqnX9z46RfO+HAPkvkV8xLw24DG/ZSiYvS4L6j4L6lk8rGSVPiCiLr8HP/k+TvdVvoBpdL73nFG+ioLpvnW2GL9zAy6/MS9cP7obET+J4LK/jihOv4heiL6tsjo96uhuPOE3yL9MBAe+0RAVv4Qtfz0t6p2/EepKPV0wDTxgL0a/uxiOPqG8cr/1g72/olA3wC/dv74ZbXC/UVBoPoFZIMBi4RTA8RsDvxcOFT71KfO9fEiUvwWzur9Zwo++mycBv1egob9vw7m+mMjRv7FZKMCo/Nm9U6JVwGz4AL9JaFM+X42+v7DOSL48Wgi+4euGP/Ufqr70zk4/2AaxPl6kL7+4tIy/Vi9avuaCBL8YTx28hM0hP/JzAb4ijWC9dI4GvvcEN7655NC/0FCiv2nA571Wu9I+6OKYvtvUBj401d2/9Z7jv8t4/D7onr2//MRnvfFqr76Ivp4/",
        "YcMQPj+UOj8sk1q9NynPvbzXQ7+j2/C+XuUYv98mW7+wuYm+dwsPv4o7T76x8t++FIcNv5gQI7/7Wh0+sTXUPdUqLj83N/y9r6AbP2ogUr0VL9Q/fPVjP9Mmej5EtHI9CVUMv0Rjqb4DbFa+ZTnfPabNmj6tGLs+EGpMPs3VHj0a5Y28jMmcv4gL1b5i1LS+xw2aPmE1jj71J3e+bMZJvuaGtT5F068+aBEKwFHxGz7Bg1q+CAFFPoPQKD9O9d0/SxbWPSOvnD5QdLI8i/aGPkcuzz04Qhc+LxgbvKcp076VvWk+KKUuPNxndEA4nre+jlUIvo7GNT8DuF08sEBMPZZWKj79jMY+BQbuPimd5D4QzsA/TVMCPRyFej/Hs4k9KSsVPwHZsz0vgjK+R1nlP/rGtT/O7GVAW6g1PQWLXj8j2gy/W8aXQBYxsz/1n0y/LvT8PyYSHj/YsWg/l4P+P/Ka6D8dMxRAoIlEPzp3fD87BvU/Fp/KPwMJzD9N+7o/9uJHPz6t076/ms68HKPwve2lF76tUI2/SMO+PWp2Hr+2CpS+9nbuvgHDPD+SjhXARTgmP+0Q+L/LwAq/ZtxmP1FBPT5DR/E9gwaoPjKTmz9CNO8/zh1EvVn9Aj15wDA/11ozvjg8Dz+ald8/E6NZQNrdpD7u3ng9Pj0DPgeNKT9g5ry+U59LvX10GL+MDJ49QKThvl9WSD/jlv++jQsJvvmZ4r1Dmpi95T/7vdMpCb+umN49O4uCvy4u/D0ixfO+xpayPuZFBr864n+/n5AqwF1WDb4gisC/yMnEv+94rL98xt6/V76Tv39zpz6FoN2/pDqev/n7A78eags//TPMv/wnKD5hTbw/yp4Tvpu/tT+9qQE+ZNKBvzjlvr7fQFE/JWgbPS6IT76ed5E+xFybP3LBxD3gwqc+X43WvIQVAsDptCi/LpnmPmgTcLtANv895rg/P+N1PD5tAIa9fmsBPtl4Sj00ahc9KMgkv9eWhr+S0vy+EHdRPWBhpTp/GAM+",
        "gvTuvneQ2z0QKQc+0wG5PouL/j0voPw+LwWLvQGhAz+Zrfo/nKlbvrcWur6Pm2k/rcWBPhM9QD6kz/m/ydKdPWkGVz+B7Co/uEw+v5IJOT9itgpAkj1vvxx84L7qua4+DdaGv7mYKr+Xxyu/L1eiP1fbiD6mnig/Wx2SPyi5hb/63yQ+kJwovSb+l75N/Li+O/IFPwiXbD6cfsu/eiSjPHUQEr+bcNy+4ve9vcUylL4zpiS84N+aPiMIoL6jlPQ9ZrhNPvrcvT72a4u87Uervk2PtT/5b9i+1Uh8vmp9CDyrhhLAwKYMv2ZuB77X7RE/dpccv28PNj6ZH0Y/BXVDvbWWlD2m65o+0PxTP6+chT4bW+c+9HH5ueSwoD9EihS+896Uvr25ET+sxmO+b5IGPwbBxj+EwSdAecd2Pil/Dz+eGOu+l/SDQN1EwT8ZTzg/IcegPgaTmT76pTBA7rZqP5U37jwFfnc+EgCWPxnE8T62jb4/DFxuQHpjtD4mVvY/X51pP8gnjb4kIgk/G0OgPijzVz4uo5O/7AGAPjJ+Ob+8Vyi+AWqGPr76uj+nsDY+Pi8cPoPbOT2MnlO/TxUoPuNjL75kpLA+FWerPTEsrD/NmkRARhWvvJkj1b4aRC8/xL1RPirt5j/yPes/UNs9PUU2Ar2rDhs/S8YPP5oTDb8EiZY+uiOmPqfMdT8RpWg+4O3IP1gErz1A9ac+b4CrPfDU+z5OMY8+U5mPPT0Aqz+OkIw/TM9gP04sp76YyMk+ZPF7vy7BsT9yOAJA6D0hv5vL6T6W1uU7gOCFvjQHtD+lwPW9o+9oPb+tTj8tq6Y+XFExPuMn3L3Lhw1AogU3QJJ33T+Ugpa+o1lNPq7FXz74KYM+nxWdvkqKAb7WS8i/hqMUv1Vowb39lsI/IJIUvkCutD+o5xW+leNXvya40D15eyS9blorPliHpru8j80/ed1yQI82cjyqRQi/1ET6PtTXDz8h7Bo/a/2rP+7IuT4gAc++psnQPofXMj91KUk+",
        "vFlzvo8t+r1TOli+ROkRPy1Wbb6uPCE+Kb52PkqwZj7TUeY9H2e7vWlGkD1jhr2++G/nPSxXh77mkQY/mSCoPJGYCr6IZ2U+myVXP7kTq79KDzZAlGVuvuzSEz4vWsK+ro6Iv78AiT3pE0k+BOuOPPgqeT8ejyg+03dZvgdpob/j4Ve+b5XHP5WteT69RKY/zCxnPbpMi74tfRDATUcQPzO1ar57N+o+RMMuP9BTmj/kNQ2++xvZPtwUHz3vkTi+64DHPuJzFD8J0Zk9u3A5v/rFfj/tTQ6+drjGPHOZ+b1WRF6/LOWoPtK+FD+o6iw/IRxpPz59m70INZy+xJ3YPGx3iL7glo+/Pu01viXBAD569Io+pK0YP9L02T709OA9nJYCP/1mr73AuNc9e2jIvgpr7j4TW9M+zzBxu7JuOL2sBhq/wPp2PiBizL543dy+1WcAvkwZ5r5AltS+q6z2PdixYz9Blce9wCeGPoMQ477KpW+7E/5Ivsta5b5/f+m9nqMjvenUaz8+JNM+josLPyVtKL4qArO++UCZvnUNyL7BopC+uFGIPeODdD/3+ku+GrWJPTwp0L0wv0i/7wWIv4IIFr6BjLg9qnm9Pa17g76Rc2W9J3ahvvBKGD0yPwc+9paPvokEyT5FPbW/wXZqP+NQmz6MSjO/QbDvvvQl+73WLIy+NQvzPhp7xr7MIA89u1JcPwa/mb0zVh+/b/hbP3DA1L4yORK/RJHnvnQF1b4+Udu/TMw6PfQATr/m0Hq+ew+zP2G5ib9TJM0+/yxUv2/Kqr7qVQW/NTGPPEJ6Nb/C1z6+BaaEPudGYr96Gam+k1nUvbVRiD3deEU/2604v9CvDz6eLDy/fYCuvwiGV752RhO/p8yWPuRvgL5LuDI/9VJGP5g9Gr+1FjC/DBf0vJMt974TQrS+a3RyPyG/EL6BwKU9sdqIvsWJS74hJwo+1UGUv+Hu6L3j+Nm+F+BHPkfdXb7z5N+9RuIzP0X+Tb9YeC2/gqhaPyBcGb8Nuzk/",
        "iK+YvXhqBb2wnnG94FckPTiNi79XDNc9y9lov7Vpyr5+rr++kOKJvsn2OL0swnq/ByTYvie06L8DfTk7ym9rvwK5PT5t5jnAUorovs7P0r6RCpa/WhqIP6adIMCX3CnAaDAPwHp2K764ZDG/vXG8vygV17+Kq6W+msg/P1+ka7+mto+88cqjP49/XL6TjGU/YjSOPtbCl7x1S9k8kEIWPX6y3z2LDK++Oo2HPvVfqz/YDKW+f94LP3XiXb2eKwm/PCIbv7s+aL27FUe+v2CZv8NxqD+MK5M7+fvAPXjO1r3+uog+N5vYvaEwNL+D1ke/1ky6v4/mOD071Qs8PNs+PrnQZ72Iwo8/r2gcvkZBaT6aJGK/bbjwPS6dab8LABS+2oMwPjEOTb+JaOO8SHHHvnwblb8ojAW/MOw0vpjDcbw4bBRAYf3uvh248z0ew/K+MimPP5QTq75ALii+RrQ1Pi3aND1vfK2+0/9tPSe9/j7cqaU91iSYvjd+sz9X2Va/9I3SPeOugb33vDK/FHl9v7/YqrrTlCU+H+7Qvu/D/70rQ7Q+lt6OP3Gawr8FRm29Pu7xvgoXnj4I5ZI/JX4JP6bLEj/Ypbs/BkqiPsYkrD59CWY/AOtyPjSDJb4HoMW+Ll0jPeQ7WryZqjdANra1PCNnzry9R5A/dLM/vV84aD1spkK+RsIoPTQkD7/fAyM+Bae2vzIrdb4B4vs+cPYUv3bzz75eDRY/7zTxvY8F+r9rBLE9Lx+Bv2VnDD+KHl6+0Y+UPhQLnjzHD3+/AUq7Ps1bIb8Tejm/+l26P8Nn6r6SCDlArxmMv4t1LD+lVkA/GhXMvpJLNb/h/Bs+Ciu8Pt+rEL5BoFo8Hr/iPXRyG7/X/n49wzwFPERWLj9kmn2+gCMnPr+9Qz7cOfQ+ahe8PqehNz8j984+LRVpv4dmw70qiqC+zavSvhlkar5LpCa+CaKgPTEhjj2ZlXm+PaCNvp7BML7bNzC+pedAPmtI1L7ma+Q+Z3hZvzJfaL8JH909",
        "Jtugv2ud+b59oR4+GxoSv5NlFb/GX4w+3TQHP1apAT+TljG/lHw0vvijyb4ghH6+tL6JvvWchL3jr12/0vTlPjl/qj9VjFg+yv+MvZ076j9ORjY/u7hmPVgCzz7Ij6G+7W4/P+f53j+0JpS+gmPgvrqlBr+Syus+VDYEv0wnEcDe7T6/q+qtvuSg+z3vcNq+obn0PS8/Rz5DTAA/lZfgvmuXLz6q2Js+LulHvwpdPb9DcBa+XNNmPl6a4b0QsUm+X1AVP8axYLxdHIA/VqpfPIZ6Cr8AAAq/JMOEvhebBz9Wj+a+V1LPvjDMu76K5Fo/gD4LP/0qfb46N+O9YBYIvzf7Gr4/mF0+Pbz9PowtkT0o1KG+Ul60vqt4Jr+A5DM+14qHvk9wmL7noCe+HD+zvX9v6b/XsA4+ViiFvVhD5r1iU1a+qcKvPUMG+z4WTYk902FePj/74z9LDa6/2U0ivwNAGMBhsBg/iekOvm83Hj845rQ/lsyqP1wmeb6/vl6/ZYUqvg3V/b0+TBW9eL3JvujojT4NewI+48rqPsLvTb+RAPQ9+17aPdCItL9tLzG7NBqKv1ZXFz/nIxa/GncAQGhxhrx1FAI+XatCvfCw7T3MXeY9U3EHvrYxrj5HXTI9aHy6Pl/qDj9bcac/kNoNP7l/Sz5WGFg/udquP2bIQb7gX5q+BV2xPd9eXT6RZ949VwdIvriSo76iwqI+FwQhPxeJGL+BksE+vuWDvuZ8kD4p4QY/HSg6QM/x1z7FBRw/66RJP1E/BEDw0xM+euAXvqN3y74tOAo+YSGzP/qMNz/UspQ/mMq+PgBIpj8s7hg/yG4bQE6wqD8uawG/Q1+kPlKgeT4rIAO/UFenPkKscD5QdDI9XsN/v9K4dT2603W9yo6EPqSalz+pM5q9Am+mPs7vBz8UkjW+9QcOvM+LAT2KTKw+Y1zHPYifvT2r6/4/SG6Vvw56kz5T58i8sacrPlh2cT/NyXM+rXVCQOJgG79p2hhAHYoPPkfPPT5wUqM+",
        "QpSVPnAw177S+Yc/F+7zvuDwi7+a1AO+h+8Zv2zrk7639Tq85/vyvpInsb2rRCO/0XdTv7uEHr7EyBU/4yaYvVhCpD+3hIO+U2gCP5j0B7y8o14/Wj+qP2FGl79FQQfAHzYuwL0Oyr4D6sG9AHy+vrHyc7/t9Jg/nnT1PgPaRL8OwAS/s0PmPu1ccD6TGk8/Wh0EP6Jw2r5dNz++fpZXvzr4Nj6JZ2E+GIVwvWyziD0kKHC/KBmJP/Nytz68Dh096NynPvSAwD7AQ/O+9i8jvhZh/D7pvrA+54FTPul/Cr/sqDs+9D1SP66uRj5SGvs+mnOzPZtzQz4xQkQ+YXoBPmgIOD1WbCM+ZFMlPHqGhD4+TRA+dIBpvVrrmb6etS8/ROD0PkptqL6zLF8+ZdZFvUtvqz29ejM/JFQzPXM4H7+R7H0+gHRbPhotCb1N6Jq+NNS2visk2b7OrbG/QkZzPtJaz78BKri9eQj4u7ppVL4UQqG+5mGVPvTCWT5mwVE+m7ihvYy8jj8cOCy9zeIAPza/+7197VK/cWX/PKoBTT72u4a+9Rbbv0wLsT9lztU9Ig+aPmrsDj4csCK+hKcDwHTIk76xE4Q9/MmtPre4V75LApq98ngUvWRT+b0w+2m+PHnUvkMUCj8TSifAxKPEvFo+Uz7qw6y++PQAP7+g6TwwkLo9IPgRPv1AhT3Ak6Y+LOFQv29FSb57VyS/GWzHvoniGj8jRiG/UbIKvo3dpr0WyBq/DKilvbFckb78akW8z70hQCk1Xr7r6T8/61eQPleMQEBvbjw/Ka3Rvv3qfL+kz3LAgwEtvsHteD2jWQk+EZJzv2MELj2hvH0/NOgJv0Fu/z1B1IA9GDfbvkUf0D7hGzg/bSqhvdePmb4BuA+/CJZKPEpWRD4EaVC9nUmgvTk0vb/CLaU/yhLWPpzDTD4zMSw/TJKOP4oFgz2nvVU8y2+FPy0B4z7vY/E8v4gtvpOo/L3QtL48LhyCPSjUOz5wxiW+IgmHPxrDgz0oeQi9",
        "9x6uPQOLtT5HDQs/F6bfPQOXND6xwge/YR6svns2zL2IQso89f26vlZiQb4/6rk95m6Nv4e1rD0ssCi/d1QMvb7VmT4cpVI9DhSAPwt/+D5NN5Q/belMQPfsKL+K2cy+49kEwPtVyD8hfqC993zNPsx5Vz+v+48/Kru4PpBCOL9LZKq987zkvcyCZr6kfI6/kfSBPb6psT4z5Y4+vHiDvwUZQL3xcjC/xr7rva7mar5As6K/xtDlPkcfBr6gDbw/qlsFP4owMT9D2iQ++YMfPSXUzT/H38S8wtviPbHnXj7uwJ0+C5p3PmtywT/tFwQ/m9B/vkxigD9uatY+7dcAPk0R1z1uuuw9RknsPI3Qnb++jKs/+F0HPpIAT77MwpK9Xr4IvkollD1scDy9K9DWPpHlF78v/7g94S3MvvPHhb5OXFm/poXVvkl1Sb3msXc/8AjnviClVT0gV0U+g4/jPJVb17+FXNS9JPkMwD2JBb+obpY98j0PPhUJxr8wCOM/ZUqjPuu9pr7r3Sm/mONVvMEqAD4AlHU+VhhHvsu8vTxyJaS7bY6fv34Drr97K4G+tCOTPjyCvb4/ZBW++0+zvJDzU7+AxSC/X/4tv3KtAT8xFHq+4pSDvZYj7r6YQBY/17gmPxTWR77YtJm/dKnCv+ZTIcBh0hi/vU2GPmG1Mr8="
      ],
      "forward_bias": [
        "AnHwPmXK1r5Ky+i/8DE2P5imbz8n1tu+QbXDPkAKNj2zFC6+KdcDPpPqX75ApT6+SuMLPyGhzD6Vu4W/qpxZPwajjj8JUB49oX0PQDKiGj+Q5to/uc6vPz0mUD9k3QtAzn1oPsiF9T/dIY4+QfK8PgqM4rz3780/Se2RP5qxGr4+C6k+zB2jPm28VT6vG968cUfFvkNYNr7u822+edtWP2NLgb4aLpe+anoHPuliQD9DRh8/imk/vvwd1T5sgA69SXOKPiG2mz5C8FE/meRSPvgfCT/6MS8/7RvCvbHDjb3NFnc/z/1CvjNqjz3zQYe+oo2uPwd0o75IciG/M7CxPw=="
      ],
      "forward_recurrent_weights": [
        "Hah3v7S+/b5XXdg9PesPvlH3Y79vD/i+21QIv3UbDMBuxxo/9o5Ev4iKEcD2aMY/AH3Ev4IMV7+cV7I/GrJvviPe/j1nDQe+2/asPQcgJzzGfUu+FfA+wLARqb/s6mk/Z5IWwHJICz9zZT8/XMknPhvjdb7GVxg/nfRrvuyShr8kK1C/vEkAQGBxmj+PMaa+yEOSvPcD5L540Rg/bTpUPtON1b+RMve+NXo7v2odCb/Tjms+dAZhvweSbD/WITs/HXFjPzn+kL+HIuI+Zu56P8T8H79jvrg+I8YxPi4vBT4Tzi7AiIaTvzSSJD9ClL0+/5sEv1wqmD6HnyHA0JYFPiRru78nvw8/AOiDPwR5CT6GzuS/c8fHPhOGtz2DvVg/feFpv6bEeL8OnCw9ElZIP6AwmT+fWVs/RS0xv72DDD5jWfQ/XpAoPytSoj+HNZG+1q54vkKYBcDQL2C/EyrYv/FzxL4gPVO+sJKvPtOmhz3Eucg/H8VvP2y9k7/pM+i/+wsKP/3XDT+p/x8/ZZDavuKqRz9Xz04/MDL9P0UHIj8Oc6C/QNEjPyXHIMDf8wS/l0ZPP9sCh76ul7A/kY3eO0K9ib+6eLq/5fU2P6YArz/88oY/+w8gPg9wt7+hns8+7z3Vvu2UAkCAfbY+cXexPHESsz81LoC+0lY6wE+9x76t46689Mz8vj+cDD/f1Hg/sW2dPktSZj63hoq/EsmlvMTSAUAT/S0/XEPtPyNlQj8Bec4+kd/APce/B7959RG/mLzVv92c47/IdwvAz/yQv+HlAD8hbPk/8Kbxvuowmr+VQAdAohUSQO4Dzr8QLgm/KSxUPwjDHD/1Aqi++K0mP9vZh79UX3o/C3WHvWt1zT2Lq48/kKGjv9Bxoz792q09cKtTPpPGATzTNIE/Ds0ovjeogr91kXS9LV48v2JPr77W5X0/qjCVv6yDvL/KxyS+2cAbwOtKMT9Vw+k+lpOPP/j/+b4WGKc/beaEvtnrbL6YxBu//L0kP9dnxD9ZXY2+",
        "Kr26vgsqfb7sSno+lWGuvhQkYb8/4C8/gkQ2vq9n6T2QsUnAvaT1PLjc6r0lnC3AovGMv/17YD6kf6Q81q5jPhjSaz/W0oG/4WlTwIuaSb7hg16/nGgrwMsg/j1TLRa+MljWv2CVEL+9tYa/ZZn5v8Fmkb2Jkoy/V+IwPx2kgL9cNew+WLqpPwRWxL/14tY/6wOTvIrhoz4zHR4+xe2EPld85z2r5vM+wL8dvop4gz0SWOy+R50Iv8Eb0b8D2Kg/BKwEPoMbqb+IYh1A40hYvktuAr1/GRE/MOFpPz9ALD/TyGu/nyUOQGoQFz8WSb4/0q1fvz2H8L9qsPS9de0APyPfZr+A/Wm+hp21vmqYX71KubO/YPTwv1x/cT/NSiLAVGOrPva2ij/aNjC/bhIMwJ/IP79L6/0+ysm1v0TTDMCnGS6/l+WWv0Y7kL/FXsa/ChhAP6ndpT/MZuW+oEluPwMnZb8k9JS/UGu4P0GdO7+j4hPAV1geP4myOT8uxRW/FnX2vhnd0r6r4vo9q1EVPnystb697wQ/U/dDvhuXHT3hPgo/KdKHv9UUMb8JtsM+7cu9Pp9h3L3asKA/NjkJvgMNFL/BrK0/ML+tvGzFFz+voRbA06tAvp4RWb+f8ay/qEvuvZXpRL9JUJ0/F7HPvK0GYr+rA4g/s2UeQKrpgL6WdQq/G8fgv/CQjL99olq/PDTwvsWLdL9eYJw/MLmcPxn56j9ePyO/IaCDPtF4k7363FG/77ODv/aryD6FLs8+5B72Pzd6Cb+ya8S/o0z9vx6knj/2LF+/cc+Fv5suH0BQeLY/i47tvwlid7/n988+ZYyYvVWCoD3eGfo9yPPOv6fn4b7fyUk/dypOPYbQK76SKYk/0cOxPpxKdj/rswE/Vx0YPxF++D0/5Ki+fAuCv4WM9b0M/Ku/T29Cv+IU1L2eejS/kqzEvzu4aT7sFXA8e7gBwJwqqL/hFMG+4F2SPuThM78+MGc/Fwv1vq7Rmj4Okaq/KHlKP519oT/QTYC/",
        "NZjgv7lGm7/uZS7Ay6D6v8xu8D+y15a/GwiMP7s1QL/GXca+t/F9vrurUsC4OaA/rtciPffhP79gX/S/URIpwOPUL8COEH0+LJIbPxhyTT8rbxBAxw/HP9OYNr6nAko/7XKgv3OhYL7DWKS/qBldv2ABQ79rujE+SvPyvpsL0j/ecWY9hsl9Pi9OxD5JDQy/gK+AvxFb6T6ykXO/lfyhPyrkiD+Vip0+St5PP/33QD6OYLa/QJ4GvqLQ+T5o496+vDfrv0XcRL5WIds+Ti4rwF0jXr8QH3i/3Vgtv78RYz9ATxk/9tImP3DSy77rkxa9dZ5oP2FXib8dZBU/51WeP2bw57+0pXM+GDl8v99ks746IuW+u6UKvpO0K8C4fBW/kXibP7LXD782NMW9fArpPhjfhL+51jI/5nJIvwWYbb80+oE913q0vbkrQb8rfwRAACK2P/76iD+YzMK+CUJFvvKowb9kfT8/8LLVPme9jb+sGiE/GDjfPlcxvD8582M+vJUJP+l/fjzsLIc+jnsSvfYspz6YmVO/ZwZWv6rLLb6SfXI+vk98v1G7k75vvce+HvIVPT0Hxr/cKp8+KhpbPy01eL8FDmu/0dFjP8gglT/sDgI/TJCvvj8prj9pZw3AvuUlv0yrgD+jIYu9/9u4v4oegr3lLTRAChupP5D1Oj9Fu7Y/4H15PzV0n7955oe+AivdP5yheD+zTgO+b/uxPvqE7b/VYU2/sVEZPw9rekBeLfe/p2lovqsZ67+FhrO+qO/lv0NG7L+rHPy/rtyFP8Coxr8FHDjA9kmFP3y7Cb8XbWG/Nic8vwppCUDApVI/ewF+P5TAjD79pai+9IYPP5IX6b65XaI/vbfcPlemtz7uDYy/VJJMv656lz6R4U2/xhnKvdFZzD7ttmE/SfFKvsjWjLyl19++XrUmP1Zigj+tTF6990HavzwSU78507o9WJtYv+rcbj9fWRBA0A5cP/1xBD83kXW+F4BWvsxoTr+i3ZW/P4ATv/33Tb0xyIS/",
        "MqqtvwLXnD6LrPI+yzWuP+XQP8A0hp48GeA7P38/rD70oB+/3Rm1PQuLvb/UYFa/TWusv/P6VL/3+dK8JxMhP0qGrz+n/J4/pUw6P51slz8mdEE/yKJvP134Xj4QZhm/1UYvP9tl7b7Oq7q/3X7HPzTPXr8qb7A/R0L3P0/bkj46Kxy/5a5xv3iA+r7YwRS/B+GHv38dAb+NPk2+dpKUvz+aWD5v2S0+cPIQP2nQ8z7XfQE/LnORv9KoQ765trA+a98Kv4wHfb93IWU/bErlPwvMtD9aJ0a/Mld4PTH0F8CxVlO+SFIjwPAHG0D+7Ec+YPU5Pr4K8T7lrhtADZQjPy0Woj5RIOg/JH/WPwldF8A25TM/f7xqPyHI2T8rcv8/20qxvYZayL5yWrY/MUtjP/08gT0Uh9++s+CHP4akzT5th9c/sGvVP/D2lb0Kgew+pgE9QL0maj43ETq/TGKTPx0ZSUBK8Zi/te4DwJFxmj9QDkM+WncAP21OgT/l7L+/o1fOvofNj78IRS8+eBJ7vpMfd79YzIO+WzfqvrRUFz672pQ/bY8SP8HqnT+VcTs9nWOGvr6B6z3gA5c+eFVnPufvD7/GSEE//AK8v7eHqT4JY4E/U+u1Pnuleb6qvOM9e200v/eV/D9Iv92/qdCMv+MV177vRBs+apOKv44BTD2p38+/yKBpvtAPlb64NSW//N+WPuWOF8C+PPg/JigNQP6m17+/9yBAwOlcvfE2vL1z6EA/JT/BvrGoFT43Cpg/XKaaP+hMHz9ZeaY+NPkKPSMYxD6BcU2+9+aev2xJQD8a9HQ/+vYzwJH+6r5v1so/qZT6vgLwsD7CeoW/svFgv1mIhr3vKru/LonSPvD96b6DcFM9RpEcvyfUUL8Br8Y+JSqNvQ4ZSL5Eiak+dvOqP0W29j2biXM/BKvMviEPtz4GU5C/LSncvvK7tL95uljAHAjDP4U/XECHRAC/dXmHP21YRz75ces+vH1bP4fg2L8JZJk+BipZv1PKnT6WaVk/",
        "FZO5Pa7K6j85n36/3eRVvi/YIEC3+N+/RTfDv6kI3j/ga8E/L1yGP/qkFcB4Icc/ctUFQKjEMEB9Bdg/ool8PzSCHUAiPPE/oVmVv7qG3L4F+CpA4TSvPiutFT+3iy4+tP9Gvy1Luz8ugPg/j0uLPxmbX7/ePCtAf/QXQBwVbj7n7yk+tVHBv3ReDL9XBFW+7RoDvjes87/ON6G+NdWIv920GkDfB6W/4Gy+vzY7EL/30Ga/j5ZCv9Tnhb42z8k9lsznPpghjj9UeBQ+xOBNwPPnST2yho2+jxOJQLYyqz+wXto+rjThvxkqXECwjGO/6Q5APwP/NL9KW9o/yE5rQJ9n6z6zAp2/wGSVvqQN/D+Nv8u/7BRhPkBUqD8rjGy/UEtav4ourT/R0YI/rL8wP5biiz62vCa/xv3tPjURsT6k2FK/AS6QPPS88z/F+AVAj7yBv7UUVr+fEi0/+XDjvuDJ8j53TN+/+YMuPpyHZj+rJso/U3jlvhY4Wj7NrJm/oksCQKo2CkBmoo6/JaMtPpgpMj8+OVs/GXgPP2K3vL60vXm/CBRqvpdJmj4Q9hE/pVOVvRlWzr7DzVu/dh1yv5b4+L+SiTg/4JkiQHgwT78hjc8/Nl7Pv0m+jT+OhY0/oZyTv+bY978OHtk/HnAQQIEbjL9JVQxAzXJ3P3T10z40DTO9IUlOP7CAxb3XZQM/WSpcvZYaRz8LKX6+tm2QvwQKgD/nMyy/NLyvvsUAJMAYz+O+CMMMwEFeCEDM/u2/qSLUvz4jiD/Sh3e/0ugAPgjILsAV5pc+lolDPxnWmT+0Z8k/2oc5wLpBvj8mXCe/UPoEPqRDTr53t5q/Z148PyxlZb++vKG/23avP0Iy8762Yqy8yn7NPt44pD6+Ddw+Pjh6P2hINb8YzXG+aQsYP2QOgj+Ovm2+YniEP0r5nz9JIwPA934kQEB8Aj6mYzU/Pc7bv7m9lr/qKAbAzP7YvwOnMUCAUkq/PpLZvDmU3L+KsERAS9abPy1MQsCoA3S/",
        "Urigv+IGh7+89k8+E6oSvxXCGj5zFKW/CdJhPhWJKEDIlD8/trJqvknXkz0LQp+/viW2P6cB8D+49u4/gsdSv2+xgr844zC/jnpvv9nrMD997Nk+WOBXwA6+jj8pViJABr+JPtFDr7/iIg9A5wjCPuOM3L5lWOC9hHc2P58ZBUBuu+i+ChdRvuIhd7/BNco96vsOPv5aHr8v+dk9tLO/PyPQNz84EuK/9K6lvzRAE79UGzC+o1+avmIAlj9qnpm/xdq8PT+yJj9Pxai/cs0twGKolT+9dTbAjRQvQB6bBsB01Ag+1XGIPlGGgD2ZOzs/CfqrPzhKCL/YUcc/TuGKQA=="
      ],
      "forward_weights": [
        "C6yWPUbjuj+pk0E/PiuyPmvq1r4HL5u+w/qLPi0lZLwyf5C9XkbQvU/9FT8Tiq++Zi2BPkjCoz3tYyS++4tiPh90IT/yMZe/PXpjPgdCjT8AGRa+UGAJvh55CT9tFXK+5KHfvlCj4rxr4K6+yI1EvnDgyT6XZpI++RwXvzis8j7bUeQ+xifPPoPJvDz/Spy+0JEevx4qhT0OESk+VgEEQDGyOL9domC9TKlWPjjlK78mmiBA3BcKwCnB+z5JQxBANDwUv3k8NT2/g6u/7Yp0vrw+CT8R2KG+91ijvvd49704YqA+xfBLvze03L1PFGE9HrXcPUkOmL/LFpA+M4bAvtM+Xj4TKA2/aTiNPb/LUT8BZwO+oriBvmXde77kdC0/Gj3dviNCWz+vZnG/yKdhv090l77S5Jg+9JoVucfydT3jy6e+/2jPv03Hjj5UV4u/wn5bvttHGb7k3Pe8rCC1vquDzD7zwRu/NJfiPtKwRr785MK+bxPgvfdcCz4CPXI+bW9+PSm6YD/obh++MDEuO2i89z7GJP++pOxdPrMRs78CTgI9nxGTvxyLoz+/j30+HlwVv0S4nb5Olf29aIs7v2lJCT9WMd29o6oCvx4nlz/DLAI/AWsNv9EtBD+13yk/NlXVPHfRGTx1WU6/wb0Cv0+8rD7gVkW7+2bfPszFf74ZvkE+fN+CPrErBr8aV4o/eECtvtLDej787MS+wP1iPi0Hyz7s7mY+mbhCPsBo6L5y86U9cTM6vZ9PNr7nMYY+15tOv9YpL0D3SR8/DI8cv4dXpr4QiATAjCfKv39EqL3obL8+4otlP6+jpT1yyiC+awL+u0YsCj6RewE+ZiAtPhhwVL/Wpsy+ea5bvtcSUb87BEI+1ViGPrK1Dj+CBFW/6EafvkIlJL73RUu/2b8eQAr+lL1oKD4+SAyXPnhJTz8Tp4M9ZLZWvwqtJz6KaUi/qaNYvzNdFD8zHWG/L78Wv7nccL4WX7Q+ErTIv6Erfb8QA5E+AMITv/5MpL9ZFwg+",
        "MQqEv7CCg77n4sE9iqgLvhtuJr90tbW8pH1mPttwIT4qkza+aOMEP3u39z1ojXw+4METPvRKoj4qGke/wKe/vZUw4T12BHU/ODT6Pjoi9z47Gsu8FI6nvwQDTb9RKQ2/KWqPPQypX74axeG+A0DCvgJj/74oMMg8A82RPxMXOT4fSVg+qLURvZ1K0D5zE8A/7uYAvyU/074weoQ+gxzMvyPBl73TyJa+kr1qPwytKr4oGeS/KfoLvcKMnD8P3Lq/IioWPsOadD50Dqw+ePa6Pj0gl77LxfI9IX0DP2bvtr7YWi6/865VPg0IRr+Y7rc+tWGxPYmh/rwpJb+/cYmPvr2bgr8VGSw+XGC1PwnfZD6U1i6/g6uLPgtjjr4/HiK+c2THPmEC6j1urYU9uz/Iv11AJj4WQ0s8+0ULv6p20z7AM5A+3u8TPn5akD4nHLi+JnuZvwAZ0b9xIWc+Fz2yPnFXkL+1MAs+H4yMvgwDhMCJjwE/gNp/Pq5nIz5/af0+NMmaPdrn3r7ffpe+QxO7P5Ow3r4s1L8+nxgXPy7gS7+uzE0+8wCrvkbaLb/uD/s82WQGP841mL3aChM+6WV/vRZDFL9uGYA+3eBmvYzgCr9Qdve8iWUqv5yCeb6hDZq+XCgjvwcyGr+ZHPY+nY+GP9lU1z4GxTA+WBtJPuWzmT3TFpU9+6gXwML/Jj5u8uQ+vBuevjN0qjqhMf69dvtOvwKRnr//jJQ+1FaoPmjPDkBKYuQ9bTPDPqOVLT5x5eS+eLtMv3OM/z9RPbO9VFXbvmlsIb6r9R2/334YP6dkNL+pD0xAGX6svwqZDjtyIP0+F9e7OyOgBz2hXhG/XncVvgbR2b86cXW90AtiPryhUr3zf70/jRW1vogydT6z6XC//9QYvjX1Ez5BD/69vjmKvnaqgr8PFv4+dRXFPsmcnD63OxI/0BB8vp2bAj/wqTm/juq6vr2ZTT9ix9Y+2H0Wvk6Xyj70LGK+Mj4tP+4EGb7aeJ+/i8jCvnRGzL3qgqA+",
        "4oLuvZv0gD7tNm+/uNGGPiA5kz/4dzq+DtAAPv2eOL7k2sU889Ofvu/Nsb0V3tc+O4etvu5llD5OFOK+hUVpvrUXdL7o+sQ+BxopvpNFYDviM72/9qeFPjC2Yz7yNm4/zSkFP8tGLr5u/K+6Nn3+Pmd7KL/9jFs9Yw+DPtK+tDrSeZQ/D1cXP7mZO770Heq89HXHPrxpjT77imi/IjOFPXeSaj875sE95FSwvTD1lL/+Iza/OuVmP2/+nD7a6Ky/3JsCPkBdsz46aBw/SASFPn7g0z6dwHi+nqH/PigBlT6Lhyg91V0Bv8xeFT+mjig/lyPsPdhUC72UV9k9tB6LPswWxL22Ohq/PIEIvAIFrT3IGvE8Sv2TvZwLa78UkZo+zlpEPj9tLD/m7m69L9ecv3GNGD4Gbi0+9e35vrHW/r1R8BE/Dv0CPh8AAD8wWzW+ocPnP4TrpT7V/IO+f4P3vpGfHb3KRwHAgUpPP2haYLzuLIa8cZ4hv6Fwyj6rc0++g2uxPuOHUb9wvyG9/YTEP6yXDj+6/Hg+o9e9PYcIwr/lyWo+Hl2LvtK8ej4hU2s+ftSKv/yRJT4+RQa/vmvov+D6ZDxQ49Q+5A1/P4hYrL6sa9O+OJQLP1keF72W+wM/3OSqvrTGEb/hHng/h/OEP0x+gT9nXK0/CEu7vVkpiT3wPKk/et6uvtNVRr6s/AzAsSx5P08tEz/DMxk+6haUvrpU2T6QCbC+A9inPjBPSb972zW+60Q5vt6eED8llxs8n7Ilvr9+k72jpeM+ARFqvhKf1z+NVQ5Aa5eOvgHwSz4l4jC/jasvv7Kf4z8CAD2/4yWGPvb01D3tSsA+hPxmvi402j6ya6G/8PVYvC1RdD6tVn4/elkpvwWjgz2rzFM/lltTvqOVJD/GITK/7r7mPtUhQr2JsD8+fzjQPv/NgT66N+q+AaJuPN4dhD8MNK2+QQcUPr5SPT8wPPy+0CufPgdokT6ySdu8PJ7qPTSHnz/0sgq/sekWvqE5ob5BcfS8",
        "VcitPpiovz2avF6+J3QXvz8Y3D7RsCe+RBV6PXwtpL4MBRU/jp/Jvqz+wr94dbg/7eU4v8XI1j73NSo/vfVqP+ThNr7KF0M+lp2sPdvAezxwnoG9A4taP2Txpb5Dmyk/ki/hP6B+Zz2VHEK/BWg2v8SnKz8r8AU+885RP1oZOj/QdpA+XLEMP9f66L3nLQy/k/pUP/KtkT1Bie29EjqsP6TdlzsIEdM+eqK9vVoV+L83/XM/PipcPTUQJ7871sY+qlvyvHOQH702UHq+z6cYv3kjKj9WRiW/d1hJv7pPCL9n5lk/jpWLP+6aOz/w0P4+NEN/PlEGCr+38qc/AfHZPeJzmz4AXpU+QgCAv7P2LT9CU+8+nbgsP1QV7b7iVMa+lMACv6WZG7+4kGm+Cl/vPPVLEL9Eciq/tr6fvmtXKj6Kivi+PYKnvh25xr0Ab4U+/UOwv52NGL/cH0e9cXDEPrlqJL8thTg/kB5uPoJpDT/UcqC9UAS5PKd1XD5jcI0+lD5EvpxYyD/6UpO+VbpNv+z4cj7wGXM+jYI+vbQFlD/uDvq+SJbxPn+H1j5U9Hq8oLyuP6JO0r458dA+BX8yQLzHqL0OW0m/fwlkPQcbh7zd08m9lqSHvyaHI79NheI+OxX3PvY+pj4Csrm+t9Jov5pFtz5wlZ6/GdzMPmM+rD7JDJm+hbYCvpocBr9k54O/Eq1gvkfCHr6XaYq+mbmWPfWxDz7RlcY9oUsZvmDp2L8Cxhy/y6OzPRyrmjsh00S+3llUP8i4l7801hs+Re/CvH4VqD7XTpA9sGcevrjbfj1QRI0+pd5ivqZJiD0CFKK9YxwVP8l0FUCTnsW++i0rP/EWv78IL1K+KKMIvyH/DT4viBo+gfQOv5ONET4N8hA9qXtdPoXFWz4RGFo6tkorvakS3b1VFAq/7E6JvbvYc751HpI9Fz4zPiaEVT+v0ao/ih+KvozS2DzP/ZU/xU4YPg54kr7RtFM+gGU2Py8ELL9MN3M/C/BcPr16Ez8Oi9K+",
        "HU0ivDV7+772L6m/5x4IvXx8kD+La7q+6FoovzRM1D2nti4+e5dPPsU4JL+frxC/JKHfvDm8cj6HXr86iU9TPlB4DD/C284+L/pmP3bgmL9Ttys+uImAPu6iOr5JSSg+kvbTPpxqZ794i508AUGnPcnBjjzvVa+9k5tAPWZRXb0jtjo+OD8Ov2cqoT1YoBs/LLM+Ph83FD8qEoi/FdgBvytDYT5G1TA+NGaRPcoEKT7K6QfAriR5P2IBA775r7PA5NnYPVcACL46sQ9Ax5A9vn3aeT4Bzew+qUByPlXv5z/PhUW+2nQlv9+PwT1KH7Y+MlEYPSbCgT8fr6I+lah5Prv6yj25q8w9UUYUvQq+Qz8biEK+ufnCPdvJFz0Osrc+3mq7vmgGCD6ZrK8+tMnJPgvkEz/W6yO98EX+PuebUD79Y4+/S91hPxaptjxgYu+9k8eav3wlnL6VLGs99m2WPrfsMj8+RDE+K+5qPt6bar7/rCK/L+5Lv5EdXj/LO0G9BQyYP07BXr6U78Y8QiQrvpk7h72qlf0+gYeGPV8bHr5RYHA+INaEviXppL2GfIQ+jldMPPQVVT5RXGy9jOIYPu66Gr4xi1q+mv4Lvhc6A77L9v49T08fvjrtfb5kIee+jThqP9KZID0i0kK/A3Fdvy2F+r63zwe+TTaJv30L7j5r3fm9mjiJPL2mTz990LW/d/KePOyEdD1nSJO911ssPq08BT5ZJga+8didPZLvabyLOzs+MUhDvmQ0Bj9kVCs+9CfZPpKd7r+cmO29zP83vqFfiT81YhI+SeBAv9AIZb9DbHG/mLj3PmrrEr52cQK+Q+piP7NqGL6TCW++0fw/vin0tL+5/Ve9lx4HP2htybvtTrC+8buWvsC9/T4U8yw+r94cv6KYLj5mbaE+iVsrP62RoD/Y13m+FhjwvnoM9D8ryRe9zGLYvgomeb8XeVI/lyWnvRf+lr5BoXm//BLcPcW9dr5Tvy++Ujlav9CKRb8mNr++njnnPkK5KT7FVCG/",
        "QKHsvn7YNTyY6GE+MIlPv+TIGT22ZPY+lL4iv2RbSr6bply/6S9mvjba+L5HQxm+GyVRvjX+fL39CRm+HwBGP2N2Y73mlAG/YOOCP8P0Aj3i4HW/ebqMP+PNGsBy/pM/hfmlP+W1Y785vTc/66Hzv7rQ5D4tvvE+afOfvXdTc74VEYg+f07APaEjhr1G9G4/kNuIPt7jkb75hwq+HhZ6vfjcUD6NRCs+I5WiPIv+ZL7BML49A4U8PnHEuD8D3oI/TDT5vSiIlL0rCvy9rWoSuwFiDT8R4eO/JPiPv7Pslj6IZLY/bRu4vUqe4T7gzx4+Sjk+PhK4Ab+SZKY/pOiHvl+glT625Yo+UUwNPzzakD+VZZY+/LDBvS4gIL33ROQ+TriZPd2ie76IR30+qsuLPy3rRz9qnQy+fdbgPXY72Dw+YBC/4bGHP/Xgk74luv29mYolvqcmMr5QiCK+BnucPQdJj74fiMs+8J/dvFkUuD5rIBW/UosFwC9p4j6Jc06/1GS0PzYLVby1UMU+GlBnvt5DY74R9Ek/n1muvZ7BL74VJt6+Xx+IviEY+Dyt55Q9wrAvPptdxz6KmHY+Xn17Pjm/FD4N7KC+mcT4vpTyWb87/yY+XS6zPqdtpb/RUOC+GCNfP/m9p73Q+m6/vWTPPdixiT16nc++Ukxkv3aU8D7tA2Q+EC8JP5gLjj5gqII9PYzfPYGHQr7CZtE+TQ7SPghEMr9qKII+Slf1vtwgTz8OHvk+wlksPXH8wT4kuPE+RWeQv2e6Nj8c5Gs+/48ZPoavcb8w2aG9LYQiPUY5Ez7iBxA+si3WPgXbhD4Tn8G+iFQcv6TfSb/zhwE/haLuvrvW9z8yNRq9e3W6Pk8EZD7+NuG+PLqyPmgdBb4QIQS+wFGivpCjLr5X0Gk+W/f4PcA5j7zBkMc+8DCCvAT1zj6xTIe+/LluvsZufL+HRMa+EGBQP7aelb5bQIW/dpDdvvCthD9+7j298fWOv90jrb7aS8a+IJOWvr8I3T0w8N89",
        "my6WP1XmAj6M99O+4bi4vvxRtb1O4nA+S5VHvi8UMb+dPo8+UN+rvgpdgjtI7Yq+UrOCPRYAo7/9W86+VIMvP7ZuBb5l8lI/7MftPiJxjL9DS/+7ZAI7vmEh1L9kM7M8bhtyvyQ//T620a89JIyOvoHgmj+Ztne9dBCbPn8amD2msHa+K6jjvt2b+LwsX/i+AbD2Pk5t5z2Rf8A+zTiSP9ipfr+/Qlc/9zULvwSUiz/lt+4/h/GaPfdNsT/4CQBAiz2nvcPger/rebM9e+PzvvkQF7+QQYY+n+8XwNdC7r5kqFO+4OXsvb0l176KUlg+MivbPJO4Sr8ZtKu+OeNnvXzf1j185eA8qZcKP+oygL5ugIe/FDvhPm8QRT+QDSW+wl//Pb3mQ76LP2A/AgNdPzNf9T357OW+GPOCvQa9zb1xHA6/NPCAvtGqdb/A9YI/zGTXvr38j73pzso8W077vQG6iz2vAPg/IXu+PkPLCzyk4VU+teUOPwCOrj7IY448cn8iv88Ccb4B8A29VzKUwPxvbT1wV9O+A8q5PnJ0hj9+S46+dsU7PmwFFb9Qdoe+C4sFQPsuRr+5dqo+wZh/QBMAh76F2ja+qCUHv/gl5D0qQaS+Buldvk1wKD6dvpm/P+xHPlazIj+EOye/PpkEv2bnAL8gMZO/Ha8hv220mL7Qq2S/PZ/DvvQV8z51KF0/0xl2v+0Y8b36GgG+rOKIPW8LO777tE67bSjIPj/Wf781y04/OhAPvl7CRr8AbAi81WNzP7gaMb/DL1A/Tq8NPjBWaj4joiG/yOKtPvVQXr80UCs/Rplcv+wnnj6v4yq/3hNWP8k+zL2h+ls+HuYovhF5sb6ivWK+hRgsvSXlzz6hNh8/YHcGPwiGPjzCDSi/QNAuPzdHo7+K/r0+6LASvhaEi75QjxS9wfE6v2SuDb45hc2+VxvhPtMwKj5dqMs+s6qLvyQxl7/GCmQ+yZoHPgWJkL6Rh9e/WHomP36PEL8+YcA+7YGRP3su3b3zQMG+",
        "OrbpvY9ubD7kLty7lJQqvwzk4r59kGK+CMd9vgoXNz+dgSc+uIyaPj8Zzb291lE+2r13vpXsGD5XJ/q9pJX2PDFfJz9flHa+NuhuvVRXy74qr9k/RPoNvqjvr76CoGa/iqacv4+kZj6BB1++TzgTPU31Yj/ZGam+bRdwv6dgjb28XCG/smqpPgZflj8SNY87Eb7LvreLGb890os+dmMTvYeVl79OfLM+ZHELPxB1Bj+MPq8++pEGv1I8sb5fhY2+EQC1Pk2mfb5iRI++1gBBP367Tj6vGBO+2H8Cv64JST5X+82+GyP3vQP1i78jvDm+MJATP7mJ3j55Ap4+5/vBvzsI3TxPGjO/zfXAv1wCy71PVmw+v+npvmjeHb+N946+HzBpv4L9776cwnm/Q0ayvjQke7ynaZe8QNxfPhJp+T7vm2i+ZGk4vnFboD8VYrC/tUT2vlmwOr9ngjm+tyBlvt6ldb/VFlDA6VizvlZRqL6F/b8++dPNvY6aeTt65Pa9fuWfui1bDb76QS4+UC8mQPju8D5mnIE/HaBKvzzNrr4Iuqu87Ku2PNamgD7kCpY+PDqjvnfxvD+oBeu+JTGiv8zpLz76e26+wtLaPlzsgr5ZtE4+c4jKvpTQ8T2cFa4/6XMZPoq2sb6ovMO+GaAmPqT5A75/Ex4/czyLP6gUZ76LEsQ+HL9uP5MgqD8/NIK7fsfcvrYWrb4QnsC+FecSP9Z4uz9OLIM+nK2evswyoL/Vees+0qE9vTU8uz1EAKM+tjI+PvP0kr9wrmE/SLNLv2k7jr/d8HG+kgk+P3RpPz90yqW+fe38PxJy4LxG04i/gldUPmwLjD+UVgC/XXBPPoP8pL6CtqK8sIrdvuwdsL4n1Zq/TYsbPnHqzD0noR8/6HqyPhc31L7GT7q+bucEP+IEgD+NBCO/Xg56vlYzpL43Bi+/DVapve7kSr9Fe5w/+z2QPTe71D5vPKs+5fkevjfyK78b2im/lRe7vz2AeL83Qji/XmUkPrwpBz8sPge/",
        "/dGnvk+Aqz7suDg+ijKIPxhTJb9wLWq/hGAEvljSKL+O+SC+TvfXvokdlL6yWfo/1W5NvgxaWD+fwIW+1ToxPlvnEL/RTss+Jm2ovvnyNr8fX0C/7vKlPYQ+gb/mhmg/qDEHQMKtOr94mkG/OtMwPmfhJ709K54+OxSBP/CjWT9TBI++iuYGP/+dYbxiNyW+ybjqPsHvgD8QKmk+wCwXP3u0/b2Xy+8+PDvsPXac4L/LWxq/teWePp4Bdz9BBom9bi5lPzAMD78QeLY/WKRuvuBbfT0YSxE/ZC4ev9upA7+Csuc8S0PAvteVIT+DFUQ/2swwv7ziCr+mkxY/xwi6PhzQpL4mm4K/2NkzPCkS8z68VSu+vNIuv1qXr77VPWw9Ggp6vpuzeb7DTSa+vt7iP4mMT72Mp7+8t5/HPUDezDz0Lqa+BPYJQNBBpj9OgAfAhDhAPkWoRr7bCF6/M2QKvrshEUB9I4m/voDkPHOLab/N/NY9jhLBve3uG78nMWG9eimRPQwFCj5p3Ts+iiU0vqSCLEBUWre9I0Covs+gGr8UxE2+k8SzPv91Ozw8w22/ZGAnv5nlgT6n8+I+69AQwHH3nT8Rcpg+1DepPzsmjjxfQMM+ZewZP8VCoL7KNy8/UIqtPxYwn7xBt5S9oa+AvbwQNTw+zoG8B9rXPtpwOT0t2x6+olSfPWTbND+SsvY/++2vPchyvT5tlRs/GRR1v2pAnL2e2RK/LjYfP/dZfD+Xtyg/ZGA1PpJebz4bmKW+5ljHvsPCdT/0Eea+BAOwPp0ky797doe+JJq4vSijwb2rFdk+yDYhPhejNb+vXDQ/g7U1vgWl1b/dhBA+p9qmvU1Fjz0ilYA9n9nHPq3LZL0GcIs99lwCQI7Y974bwzw+9PqHPi/e1L71SIC8kWOEvRqMgz1GylI/VA9+PXu0Vj0v6BQ9tcppviQ/V79CGf6/eEq9vvTRkj2nbuc8SGLevs5SBz6AiYu+UabyOydU4z5WEpS+xkeGv9StML7Y/pA+",
        "lAOEP+XkNb+V0iC/8+mbPsJVpz7nnjC+OYrxPkpHnr0xASQ/UOIPv+/vbD7VaKw/f4p6vhJElj4d2Dq9i9IXvvp4ar5uvhxAOVEyv5dat7/lG3k/7Z2bvvx6JMDrNtu+SeUZP4enGr/VoJi+W0NXP/kKQj5wIoO/+3hOvwe8Rb5c70+9rEgQPck/4j66AgjAehT2P1fhMb4Ei9E7hoMdviskH79pkp8+5+gCP/jBOb+xIn2+gCiwPgfwRT4p5Jg+zh4rP996T77Zfem+SJL7vq6adD4sx7Y9qWt+vpc+ST2p0oc8gdWIPj5iI7+zUGM/bBpFPgoHE7/qOoQ9yMSdPFm+UD51pxO/TlqQP4XfRr5/nNC/xTDgPem3Vb278eq9LBNlvmzP/j7OF/W8YFokPii8JD7sQsG+CmMWPv4Mdz53U2+/besDv1sUDz6YJLk/xoavP2OgnT/dEzY+7BqDPn2OYj9qpR8/H6IxvtKCZzy2Dye+XK1Jvq5Rf77JDEU/OmBrv4+XnD7Xbhk+0Y4cPhsQQb689yS/+z7WP7QgNb7xmDO+G6nWvTIxwz2RVZA+rFWvP1O07L+2HyS96Q1QQFhrTD5qa44+kvi6v+7NqD0qXXe/6HYMvxO8sr0Ev6S/GEupPhdvJD/IC/08owUzv6aIpT3x1VC+zFkTvxdc1r703AY/8vLZv2wncb9d17U8NdlmPnpKPL6cHDO+FOugvkywGb8FS5W+n+2yPe9WZD48WuO9VWcJPlsIzb3EIvI+vk0tv7yGAECyl2I/Je0iwBDxPz5P27q+qrymv1bHlL6E3BA/sAOOv6DQ174Uouw9Tu2+PqulBb+fJt49VxupvePzvz4A/u+81kYcP0ONZT6SnOk/1LqGPmtVF76bqyzAuh4Hv5eC0T4r+5U/G3oKvQgPSL8E8n8/p5A7PlQjED9IJgk/vrMQv6+/tj3Gh5G+lpA4vnNj5L54WfC+UtXpPqLriz0eF7i+xe90vx6ahr0EjSC+tJLkPCPBFz8OFIC+",
        "99YKv89I/L2WaZ2+FQi9PvQSZ77qEDC/WLmCv6cd/Lx5ac6+DFPGPHcHR7/Owzs+RNQ2vvWbRT4H6068500UPl8VYb7UVvc/WSAdQBUG0b4hIpS+Gm0Vv6V3575pJLC+f1t7PwUIkL9FXpy+iTmZvw44sT0ksLU80DEnPkXdR72Suyc+XeFBPq/rmD7m2cM/uvmnPmj3sj5HTBg+lyYAwGfPpb5K06A9kduYP9qp4b6KiL+/wsMCPkE2xz5VQYi/PKNLP/Vvmj1BWkw/1yWFu7IY+z4f6Rs/9zj3vq8mJj4JSl8/WviivEh7R75uqTc+xLEVPu4bML6C86I+PSKZvJMnNr+heqa8ECUXPya1ab/bHU6+WTibva9SKL5FajA/ybMMv9IQwj6fAGK+SqNIP/VyHb5iQJk+HnzxOj2kAr4KSBM/7FwBwNI+t74lNV8/dXMlQDq/T0DwsMA+6A5Jvh63+j40D/e/zafSPegKBr7HRb68Vx5bvPEgqTv0bP++otHBPhAamz0a6No8Amw9P1sYIr+5/86+yIGuPSE2bj9JT6K+Hf25PhOCPD/LgWS/8JSfPMcTGL70Kdw9Zl4nv+Xeaj5A0ys/CUIoP2DS5T6f2jA9NS29PitoSb9c3pI+OoiqPj1i6r7CNtA/8TejPxLsyr7jOHI/P/xoPu3vmr0="
      ]
    },
    "bidirectional_5": {
      "backward_bias": [
        "wzMkv5VhSb7BiLW/aNJ2v+AqfL+Djs++rkx8vsW/Cz1Z8D6/tyDovgVlQL+zi+a+y+eZvqfLQr82b3a//4qdv39E4D8eQqo/nUexPyxjZT+yGqI/rFvIP5Ib7D+4+1o/IoZMP3kNmj+R+34/QUK7P4JMHD9EMNE/OUMqPz9BtT/DG6A8fM8qvlP5oL6Ea26+TqghPn20gL096dc6PFPePdS6ob4hk0k+2iIuP1/lTj6rouY+Dkj6O2VWMb5GTTi+/+RBv23nIL6Jqzs8cZYhv87erj4/EsS9T4KLvh8Oyb2XJDs/U9qlPujbjr9VTRm/15guvy79cb6Za0e/DVopvw=="
      ],
      "backward_recurrent_weights": [
        "GIHCPva6kT/+lcs+grmLP4TPlj0mZ7w+NVONvWBw6D6e3q0/vED0PyGKcD/mDui+2UWov8F9kz8ATRU/Kv5IvjtlB7yn6og/dZu6PjtsDr9cBCs/AIQEPePiqD4lj8K/7rkLPgyzIr+7oaY/9GYkOzzxSz+AZmK/TQfBPnrafz80x0q/6bXkPvWaib8BJEQ/N/qnP7fJQj/FDEa+/vAIP1pVoD+K2eA9h3s5v2v9FL4i6L2/lw84v6Numj9WU1g/EzKrPzlZuD1n34G/LJOgPqh94T8pygg9FpdyvfHmmb8Hp2i+d7RMvw2bEkC2kCXAu3gLPgGA+z6jOfi/H038PyXDYLznMUc+uaSDvvZGlj8HFlk8CeQfP0337L6o2Ey+JGsUPzZNoz+l6DI/UZiQv2COlz9Hy5C9AxdNPmK5mb5Zuas/RZI2v7dWtr8+fv0++xc2vvKxYz+Sec0+LWeBOwcm5Ly5Y4g/TjqkPgb2Pr+NDcy/rCjQv/t8BECqZMe/IfALv0OxmL7CIOq+c2Q6PiA02r00HiY/wCjTP/F2Nb2L5Ei+dbAyv0GsBj/yRwq9UQScPkZJlD+nqro+oOr4PTpkST5Zp+4/XoF8P+3npb7OyGc/rNukvkSavz+fo8I+WhODPu7G8L2kYI0//0qKvWllX78j8FY/zCKRP5ou6D97e/W/1Dabvocxjz89EhA/M9p2P2XTMb4y3Q2/cKHwvln+er5eb9A9vkFlvkQfDL+rCA0/APuVP3SNFT93aDq/W0aBvvhJhr747ME+HA44vuNJpLzHVLu/feocwCm90j+VvuK+q4bNPqv8pr9eCCo/3n/YvkdyIz7OcV0/o6SlPtgaRb8D07i91cl7PxWm2L4ErBs9Glv6PssMZj8c8LG9SBX+vkieT77s2Ao7FJglvc7P2L54eKq+VHa4vk2Bmb4Slw2/JGi+Pv/sBL4kKa4+B4cYP1VlF78au0Y/8VE1P6N7nT4qRAE/LtpHP57Vo74zug6/VuKlPSuEkT0JYpS/",
        "LFZ6Pwik1z5CBNy+ay+SP+gLSD4MTjg+gVwdPp+4mjwKx2S/1SlXP/m4iD8IiMk+SbAnPKXK8r9y29s+oWeXv3vh7D/o2s6/jzzvvveuOr/LnUG+l78VQIb/TD8fhBDAEDCQPaNyrL+85kS/yCsMQASB576qcZs+tO+aPjVCyz8fFxu/Cg+QPwdpzb+cTqi+xAJKv0GHxD4BcyA+IYntvRJ7u77Ham2+2nNbP15PEr95pWU/4H1zvt3W/L9fuFS/v5SUP7tNsb8YE9o/cEOWvr97KT8mbPC+KQ+Evj549j/nVlC/D4qNPibdBz+0cmw+Gd+WP0kOQT5p0m2+gOCaP8RCjj8axrC/W3KQv0vFBr4876Q95rbmvxx3tL99p4I+n945vyLaEj6AS+y/dar1P9QO4T5B1JE++j7vvubdiT5gwoc+H+5GPYenfz+mWK2+BNi1vS/itT+1hm0/hUBtv2XIub/wPiu/JdwBQFdB5z4reiI/p0oCv3TWPL/GhRW/S9Qmvrix3D7GJNu9IVMavzrPab9+yyK/tbovvyz6Gb/+eZe/d6wXvnFraL+6PQg/oLjGPqLjmD7kgjQ/MAhqPjMHKD0Mhim/CaTIPyArtj7rwjU/8OknP7hwJ75Z0YA/BYvMvg2S9r9N7CE/Z/iwPjsWjz//2gq/iK8hP/hAVT8woWO9rD1jPwr60j69cwK+sEtlv10wE79bj4I/2fqSP8cVmj6k0hW+Gw5Bv0W+IL/H9mG/F/+SPZwtI79mVmY9Exlrv4WalT2XUla87gvjvm/gJz/SyT2+ja85vn54j7+5FiU/7Uf0vhjH377hxk4+mUqRPtZbd7+AMqm/5OIuP306jbzsCRE/JybXPiYWsD7VG/A992n1vqrXFj+8uUe9go+bPM1+wL0rW9S+hoUnP1l6HL9vhL++PKZLvsIxCrmQFhQ/HLrKv9E1hj9/ySq/gXp2Pud+Vj8bUKU9239OPin56L3wJ8y+n32bPy1XjL+SDTq+j45Ev/tkrD93SCY+",
        "Ca3xv3ABB76xOs2/9P6ZPxw0sD2QS5m/SvPGP9f8Qr3pnq0+nAcyP9oqfj+/gMI/Pp+EPeT2YL8WZto+XjPPP+RZuT9H+r4+GDUgP6wA3T8KXeE/xgtPvpp76L3Ldw4/0eupv8MjGT9ZsXi/V/8av5Feor91S0zARQHBPw7+yj7zphE+aHYcv35B0b5cY+S9hLCHPxNsBr8uHLG+F5AHP/ZqL79bV3g+g84FP59lz73lsCG+6MdqPpclXb+ZgMa/jCLBP4ILdT0Ctfg+kvUKPxbetD/v0Q8/Fg7PPWwdir4eVE+/GVDUvn60/D0Zxge/1+FVvwx8rL50zlO+MX+rv33clz/BhtI/gTqOPmAlvr74SKG/nzJBP90nnL9S3qY9bZKmPvAHnT7mh+A9eLoNP76G3L4QDd69cg5bP25YCL/IgYC8xXQDv3/S7b6JG74++kGAPp57oL+0HEY/KIONPjD3BD/IsC2+IAIFv9Q5HryEV2k+GOwUvfp0JL9LFZu/6pbMvuVGJr6aS1A+uHJvvELdf7+PnVg/6xVEPqjwKj4bVJw/xG0JPxtyNL/kXyi+2JlBv1U3Bb+Mj/E98ncIvXVVc7+Lufm+JwbIPyBMcj+6QlW/9Fidv7t70z5XSHM/l/mLPzIXkTxeX1a/sZKiPGiXYz3PjpY+k7iwP4S88L6F7TW+Z+sBQAIUoz4PJbW/PIU3v0+PiL7iVjs/lXOYP076er8Wlqe+hpagvl9JBL/Z8Sy/lk7lvynBBj+fagM+Ew52v5VR4D/PDN6/AVImv7w9s79eoG2+FmdgPQcyAr8dFzM/IxQOP8Klyz/bf2k/MWIiwDDJK7+Q6t2+E0FKv8qcub5tZjQ/l1/WP6D27D6164u+1VVWPYlUJj8lInM9wWAYPI23lr54Ph89MgwBv9TELD9otQ4+l4gTwK9yfr4URz0/UoRrv5jStT+8I5q/um2ZPy8fDj83Gbg/XAOjPt3FCz/QrhW/1ClVP1xmgD+EJKO+HJ+rvGpBbT/ac8+/",
        "UfxIv6JeY7/U8gG/fkKAv0oWYb5X0Yg+gta9vueQoj4+EoU9EjqdvaK6Pr6tpok/lOleP4B3Hb9bTSu+KoocvwZuar5/doO/rP9rPk9zn7+U5Xo9gikLQNWvlj/wNzG/YzEAQH38Kj9t91A/OL2Yvt9ZXz2+rQw/dm8wv7lYmL6/AOe9e1GTPledE7/4yqg+LY23PTAfiT/Pgm49UqK7vyMyFr5b/Us+hPL6Po7PMD46Sxi/GvPWvrMc5T1K93q/BQ4rPe409T9+cfE/5VthvwHd7D6+slA/GPSLv4+54b92ryO+QYz5vigTFj9SyaK/rWOQP5+xkL7TT+2+o4IoPxZ71T7szse+iLa9vHxO2D8FufO+qFXRvs+5DL9XxNk8uMzzv6SmMT9o0fA+8e5mQB5aXj8OxCvAItejv+1ykz5/aC8/8sf/vEXvgj+/QZM+pm4cv2sPBT/cn+A+OafXvL144D5rFXK9yoFgP7HeiT4YFKA+16C9PTdohD4xgVC9cXi6vjOIib6CscM+RL4uP6nJpz9YNJK/fqnQvi1DFj8AMQ+/aIGzvqNFYr++7sQ9p/hNv/2Jcr/r9HA/z83rvJqIXb+g8JA/+joUP21SH8Bx1hK+7IxJP6Aoz79bEW++bbopP6j00b9NOQQ+bWjGPvljFr6iy9q9zzt9vzZQmD5dO4i/lL3pPgK/uL/XZDa/+rRdPguWMj+07WG+dd0Qvxb8jT5jAbi/CzvFPorBjL/7yZM/LSeOvmEaqL8GlAs+lPGvPdFuEL+2Cuk+j4oVvleaNj8jsR+/SYqMv4TGsD4HPpG/mfsevzMNuL/RaCa/+mCavw7xvD+jyJq+QnSqv2mXQD+gJ5Y+2+LBP0gU6j4Dvw4/HMbtPS8BOz8Dg04+zCBTvnIOCb8HLas/af2qvvIlkz9BKEO/HmmXviwFOT6xVBc/3m0Av4zUaD8k6GG+wMeev3TUmr/Gm8S+yybMvBww5L8S+Pg/tLqJvxY8ND8zG4M/sycOvkFLkD5IyoO/",
        "dehtP5aCnb9JqSw/lrCQP/s1YD9Sq8k+jrLBPkxcFL9F+7u/U5gev2U1KcDbPJ+/nD6pvz924b4Kpms+YM26v7MtqT9WVso+DiWKPu9crT8FKhO+osy+v/+Ghz4kIqc+otOKPtPUlr9ouC6/dzBIvygKAT/6NL8+Ht57PqAy1z7mEmY/MtS+vliOuT3UcX0/t9akPYm4Oz4SujU+Hz74vgXVur/acDQ/KxdpP6XBGb/9sA0/j+hlP/NOSD6f2g+/ALiOvxDrRr6b0pu/hGt8P36Tsr/OpgfATOpIv90hrT1KXxlArDqQv6NXyzxhTeQ/B8raPvALZj8H0uM+YJbSPYwSfr4m9nO/N5+ovljeZb8sMcs+Y3Q3PRHE4T7Qx46/gjmUv+3Bgb+BgWc/TxfevgXqs76fZra6mykRvog3sT1vkbM/5DUFPoZRej7VxyK/W9GOv1U5yD+pSMY/d5dhv6jyH76GZVc+Qth9v7BLFr1/B6C+P8yAP6zPKr/X2+a+fPahv935Xb808k6/4QSNvpf3nb+5Ke6+lh+EvxKUJr2LZVI+9CdKvk4Ig75uZH0/RAUqP2+KHj69Ndu+HAfOPf4MT7wkuWC/uRUVv6ri0D2aLU2/7oKhv0F3kj97B9y+YNj5v7n7cD/z9Y8+aewoPzktsD/SH+2+po8jvwSaUj8NHUu/MoSIP31d3T/n43O+OyJUPozzzT4OOKQ/P4s2v8FtYT4JyzQ/dPVyP94D877eSwC+IUsAQIo6Rj4ZRG8/l2h9PDsePb4jUBo/IrvEvx/t5L9eiki+lsDgvmHTOL60rNq9zCUCwCudND/Y8ds/iy8dP9F35L/jVVq/Xw/pu0RHUL6OFL6/2+VJv2gM076NFCQ/Bbhqvsr0eT/A8Jw+3UcwvshjUz8N6CW+IH0EQD9Gvz7DxhU/pBZRPxa45j9ZA+4+SlanP8JBxr5vO14/dDXNPbQ1Fr8OH1e/mc7NP79g4z5DF/c+3QMDP+bFKD8lP8U/rzffvnf1kL8mXgU/",
        "19ZfvmzVyr+kJmTAOPknwEbWD8AMqiM/4B13vXZvJju312Y/7Wj/P0KMvL1vPsK/1j+kP1rITr/i8Oe+ymXPPQn5gz4eJhC/GLelv8TOv7+L7tO+m/JWvw9CXT8gNS6/FZUJvnK3OT9SZY2+jfjAPn8/gb4pTcm/yJfpv3BXJ7/pq7q/mcO+v0nh5L1QWG+8ZEkJv0dMpDwfZPe+VXd7P6zTqj5e6ru+0KwIv9sz/b5/RpI/53MJvwVXdb+kzac++b+7v+YIjD/e/q8/3iYBP5ulT79CLR4/QjZJvg99A0CLqoI/F0dkP7De/z4LOIs/T8+vP5/3nz+7qNg9avLZPg=="
      ],
      "backward_weights": [
        "y+MQP9ClTD/lhlW/TXehvg3neb7TgPU/nZdKvs6iMz5LFNq9IGcLvtF6iL3yPqO+Cz5qv2GBFr/T2sW+xZrOvsWhtD6T1ZI/RivcPkBxkr6JY5K/qWcjvsf01r5edWq/KQcmPgIaTL9zKoq/346XPidm7r7N9ho+l+ZMvsmJF79rwYG+ouSrvb8vYj/2kq+9Og85PuD6Lz7yafK+OAHYPorQfD7ARkY+z78Kv8zFZj+xSBY/dBOdvhN3Jr7RNCQ/dfVYP+ekcz7bnFA/LgUMvb/Y6z0BhMQ+Ep2QPgpM4T05rLC/5n40P9s3cr5B/3i+N+v0PtAXTD6ZA5A+X487v1mz2z5taa4+DpQgvQcWrz/xWYS83A9RPnMg175y7EQ9WoF4PmuV3L2wvyQ+ZINLvw7jqT7X3l2+I0v7PiGjBT+ojcS+0Z5av2852b6mDVI/ufPKvrs+xT5IO5K9BbYbv3AhiT6bGVO/gNs1v3aQSr7PSga/y54tvvM10T2aNIi/QPAOv4mY07sCkWi+60cNP4J+CL8Vw1o/VMiDvoSSAb4ypQk/GDOHv+zYaL4sBCM/voCxvESXoT4bj9w9DyenPvoa5j01LyY/jug7PqYNAr8RBmI/eMv4vUBuyL6zxMW/p1BPv4oiqL8vi68+fQwGvC9bB7/5ySw/RL6WP8CHUL/CnS8/9jAWPzwFKr4JBeq+fecwPlxyQr7xB3o+my6UvoYFcz/gXsS9KPGnvsWWhT6VN7Y+vNSdPw3qFT6PvEm/Hn+av+HINz6YeGw+XtJYP1/Etj81VL++730HvSg6FEDjc0i/tM2gvNr8esCCMoS/wtrOPu9mbz9Z6iZAbwAMPaNAFL5i9V6+UXOkvQH9pL40mSu/dreIP2/+DT6k8Ls/tkOKvkiH276iB16/FghEv4Er2zvguce+X+WZviJZLT9jE0w/+qjbvh0A3T1kRIw/IMr5Pth3zr7jQTu9uav4v7pwGr8Fzty/loWTvUMVaT5tDe6+8L5pPjbiTj+v4K++",
