{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              10
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Embedding",
          "config": {
            "activity_regularizer": null,
            "batch_input_shape": [
              null,
              10
            ],
            "dtype": "float32",
            "embeddings_constraint": null,
            "embeddings_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "maxval": 0.05,
                "minval": -0.05,
                "seed": null
              }
            },
            "embeddings_regularizer": null,
            "input_dim": 29,
            "input_length": 10,
            "mask_zero": false,
            "name": "embedding_1",
            "output_dim": 32,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "embedding_1"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 5
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 3
                },
                "kernel_regularizer": null,
                "name": "lstm_4",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 4
                },
                "recurrent_regularizer": null,
                "return_sequences": true,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 64,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "embedding_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_4"
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "dtype": "float32",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "activation": "tanh",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {},
                  "shared_object_id": 11
                },
                "bias_regularizer": null,
                "dropout": 0.2,
                "dtype": "float32",
                "go_backwards": false,
                "implementation": 2,
                "kernel_constraint": null,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "shared_object_id": 9
                },
                "kernel_regularizer": null,
                "name": "lstm_5",
                "recurrent_activation": "sigmoid",
                "recurrent_constraint": null,
                "recurrent_dropout": 0.0,
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  },
                  "shared_object_id": 10
                },
                "recurrent_regularizer": null,
                "return_sequences": false,
                "return_state": false,
                "stateful": false,
                "time_major": false,
                "trainable": true,
                "unit_forget_bias": true,
                "units": 64,
                "unroll": false,
                "use_bias": true
              }
            },
            "merge_mode": "concat",
            "name": "bidirectional_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "bidirectional_5"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 4,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "bidirectional_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        }
      ],
      "name": "student",
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.5.0"
  },
  "hash": "1bf0f5242795fe22ff5b8c6a8b013b9bf5ed63667d5dd9e18f136a2ca2c8e093",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      10
    ]
  ],
  "output_shapes": [
    [
      4
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            10
          ],
          "values": [
            "AADgQQAAgEAAAKhBAABAQQAAmEEAAFBBAADgQAAAAEEAAMBAAADIQQ=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            4
          ],
          "values": [
            "homIPtn0Az16wXE92F8kPw=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "bidirectional_4": {
      "backward_bias": [
        "6zAfv9bDWL7Wqxa/fS00viVpf745siS/u83zPswEOT3OcrK+o4+lvN676b4o8qM9E5i1vh6Fq72GQw2+ZZ6+PGNquL7n5uO+gpyFPeQISb6YVny934DMvJe39zypcJq9GpMZvpRdXT7GaWe+IIDJvSMjsT4lg1M+xe8EP2wAYz4LSp++cAJ/vUFIDb+CmaY+TuMKv5GFCz58aAm/NecuP7SBujywzxE+r23ovsa7hD7+NYy+cZwavhBpszwldPK+LICCvs0vJL5icwW9uXoZPaYAYr73L6W9W+ugPX7HM75HcCo99alBvstgHL9maj09pUKePYW5Sr68YwG/CxidvhM5Cz8ZL0w/dUBHP/8Dbj/u3jk/dHjuPg626D6fBdQ+KhlyP/IV7D62N1c/DZr1PiXGDz95BDI/mdwQP7H2IT+ZHxw/WD1iP5hj4D4oWAo/sED/PgqxYD8TY4A/RrPJPl//TT+cmSQ/mM5uP+KmaT+ALcI+DWgKP+2epj8qM2E//YRQP+WTHD8Gz64+UTksP+M5SD9EFEM/8VhRP3mLEL5Q9jU/FtuUP9ATdT9Cus4+YOIlP5eAST/egW8/iETBPrXFDT/IOCs/UVYRP0e7ZT9dTXE/iul1P9ijTD8RHBw/DcIhP8UMKD/LYT8/PNV1P9JXJz8FvoE/JUJyP7FXiD5Kb0A+NKGivWAMyT3WdoK+MGXKvf6tL70IriM+Sx+cvfR93D0Ulps9oX8jvQoqMj7P952+md8aPh2rDrwwWeW8ViujPQyAIz0GdSO+DeRKvmnILT0U6z8+KeVcvoW3dD2bPUY+bDj0vDwygr4GASA9Sh7/PfDjhT6q+xa+TEflPnkeHT6WAa4+N3cVvt5AxL1H0gq9S5PVPY+RPT1TBzG+PHAhvpsY0D3+doc8aAzRvfsUDr5bZSQ+MpQLvo65Nr5sa568FlxyPfs4BT590VQ+CRvGPafRjz6UXDc+jRaGu96ZlD6kyHQ8Df1iO/EL4jxPTky92mqYvAi+Pj0u0o89",
        "nNEHvxmLur19TuA9igJWvhcQyT5cPbY9kuyOPuagWz33JAO9FZblPvDMdr3sYyW+y/uCPgWaHz4YBii+Gj8dvshCsz6Cudw9NCDbPniu0Dvf1Qc9pMR+PV9cvTz1Opg+plOePlgsPD4G654+IfmpPsZDHz+lq2o+9cDePrHRlz4QgZu+X6uCPpY5dr7NneE+ZTnKvi9yWTwz3dy+bIMmPzrZcr5BfZc8uW44PdgfnT75MBw9EjJ+vg/X8D4Uuwa9rp3fPfihUTwmgJi7Ws7mPvE3ujoDZoI+gfn0PiyjTT4JZzk/Gy4BPrRhHD5Z/HI9eFSRPh1EODvmBv69cRVvuw=="
      ],
      "backward_recurrent_weights": [
        "USDePRxGrj3SyqK+dNcTPi4doj4Ta4W9cYx3PuRHiT3Qxi8/I/ocPi7tEL8cKqW+G/YAPv1bkD7xjSG+egsqvoYSBb3HFyi+hilbPNtkF798DPk+sCONPha8mj6DpGO+0S4wvqUWpL0fVZa8civkvbXLgL4thNO+14PtvgeUkj1bdHU+bW8Kv89Avz2c+08+trZpvaADEb5lb7o+MskvPgtuTL4DQrQ+Oew9PalAAb/jhOE+bq/yvkP6Fr90Wqk+f2Yrv3NBT71yFJY9VJMCvaqNhj5Q4u++QhCnPdiCa75+Lxy/o0WXPvn3JL+1gUC+0VerPRzZqj6ivTa+NdNOvgDAX76EOpC+7it3Pps3Aj/gBiG/jNYrPUWDXz6purQ+9YuKPuAxoT7FxRc9NpFHPrZ4hb6Yf4q984YWPuLyj75enMs9geAivvuGnr4jmf89l2X4PuJy/T5Ke/M9w6ABPiMhab7YAhU+4lHsvkvDVz3dxqS+BrHrPjH7xz5o3YM+Cz+Zvt0ODz+uUGM+QmZzPelfRb58ym++eqnAPltLR78iX4A+BTe+PiGJjD07qgA/ZJO0PRNmwb6riy4+wUfKvuuFhr4rscG+6f/Yvu8r7r0EocQ+oimwPa6UrLxt8Pi9H6/zPoeDiz6NBRe+qKmHPsS3nL6S75W9mo77vgQMAj6OGIk+6Q/ZvkOHur1sh4O+xfC6vM/WnL5i29E+3iEhvS+r3Lxw05G+Ni7AvuQzxr1SBS49YfqRPVKQp72WxMS+7EksPTSySDqlJh0+jM4wvqhFUb6DkCs+R0IavoYpBj3PKeY+i3W1PdnNor04z6a+iP2uPEbnZz78SrQ9KdQAv9YNOj68vS8+YXIPPiBiez4Ma7O8jt3dvDsRST78wEQ+tB9jvYTBm73aSxO/dJqFvdbwSz4oqwA9r8GVPfHiij5FK1s9ChCsvX/BtT2TsUI90zLwvmojnLuLLha+BXsyvq7D9DxKbdC97D7hPu1G5b47Q5e+Co8jPlt147y/qzo+",
        "qjUCPkhvqD6PUUM+BU6SvqGOH77PLSi8qUuIPn9m7Tydfa0+fQY2Pk34Pz27jk09ozeHvkKbAr4ZvAk+78WhvtSEAb8VXIo9y316vGK8Gr1XIpg++zkePwAt7j5Giau+6gzCvJc72j6qEb+9RzjTPo4TU7/f4wO/+lUbPiimvz7xRLg9L3YcP1yLGr5p+BG/l/iRPlvzxb0eGZY8P2fBvtF8JTym4gQ+Qqx7PceDlz6NKuy++RbtvdrSt752k9e9EhTuPX8fjT1Snvm+Rhc1v9iHlz6cUY6/PrkDPaqlCr8QMH8+YvLNPgXFpb7LWRg+tduzvmtSKj9EPPm+B291vynxaT8BFlS/mUwevpTGjz2HoGM/jSksP0w8/b42kr89ILVVv1aQTL+QBlY/woOXPiezWb+Y2dy+RGUMvulbXj4Eau6+6TsEPwcCmD8mJuk+eYeMvrKBAT84FX4+2fkKPomyCT1USEE/SvUwPzlrSj/bsvw9OyR9PiFxfT5eGDE/5QvMPnZ5rb3n4QG9lyu+Pq5lr77XtfY+I6gZPi+Q6D6YD3c9BFJOPrNMbT7FWZK98cdLvtsobj7ohOo+m21qPtF9Sj8BTOe9X6oJP1RKBL/xkPo+QLf5Pn/yJL8RMoM/AoG0PTs/rz49tLU80CpEPlFbEr4pNiI/Q615PxJmAr7CLGg+bERJv88c0L7VaRy/j0qnvmYkmT5ihsW+B3N/vl8njr5uYyU/aRJlP6Wb+j4WiAQ+27UCvkTPDD8u04k9KVeBvsD/Vj/Hs2a/z7WmPu6juz4m2Bi/2VhmP3ZrfL80cKE9z4Z9Pp5C+r7VEs6+un2nP7ASJL7qkYi9ZaiePskzJD5S4HM+0bWGPqJ0lD5bi+u+PqkSvoUpozx54Kq+TxkqvmomKD1AIuS9sGK+vuD9Er5FDXK+QYK1vu/Ihj5mXEs9Dy/RvunOhD6CoD09OwcFP70J5j7102E+jZqyPjp7ir7dLzg+QtkPP38GRD4tHNW+PlayPugnET8GxnO8",
        "dyTsPSPiLD56bPy+bliwvRrOWD40OA2+FRgVProOg72sa8Q83rXxPEFYVL2ufZQ+ZBhUPkh1rT1Qu9k+i1ZavGY3AD4yec8+3tf/PdnQkr5AcyY/96KKvXPJjj7yKZW9ssyrvcyRp77NK1I+pyyJPu2dGr4JDXE+q0b7vnyG0z2qbLo8ozyIvcfXEj/0Bd6+OtOmvtJAP73glVI+TZaFvuVDAT5WtW29elVPPhA7Xr7dGMi90OzSvB6t2D3acOg8eNgwPnjNir5P3P2+YeyRvQlsL76cXdI+iPEkvsMHkj6ICHC+rBTcvk4oVj5Waym+/vGCvrOYFL7l2JY9utipPqrKVT/9QaS+OxVbPSrPzr5qR8s9I+jLPniQqb4j8iy/al6VPBHyh74SD04/256JPzVjFL8EinC7mZpnPsmDBD+EXyO+A0E/vfSn2D4/aCo+4QdOPt1HET51pTk+ECgqv/mjpj7bjgQ/dsqXvmPEdz7byoM+/IkCPz+3Cr563/g+swO/vQrPET6G15Y+duh7PqySgb3rUQo++KS4vd8kib6YhQQ/X47/vOqhJL8rfqA+UnXvOnl6nD0YCEA+OZcnP8pxGT8+wBO+cDNcP4Ro2r75JUM/c7wjPro+2L7pUn4+zdgVv6/p9j0Isyg/Dy1GPgBj2r4oAIg+2bZFPy4Szj4gaLI+qgLaPc02LD/UZ629Tl0Gv0liIj/QV5W+TWoqv81oQL7BsWy8etRHv4ExMT+pGTK+EabTPQmhfL0FOve+AgkNv0AuK74tbae+CNkFPuDSl771fQW+Rp4tv80+cD1AvyK+//XLvYdLSb9FpGy/zEedPRizc72xOmW+AKk7v74057tBrbC+hPWyPCtFZj2tFtA+Okobv37ik770Zbc9LWbevlrKCr9HnRq+f3l2PWVZIr/S2AQ+WA4wPXeZMTwo374+wF28veaczr0cNuA8fiYev2dl4L1mqG6+FodsPj8tib9oDp2+HYYbvxMmFb77+wA+jbSrvsZaM72axLM9",
        "1GkJPpcs5zw0t58+OkPOvkxlpz6/c769Qw2TPTwtDT6uifu91z6NvhWCUb2p1ak9BFasPUG0rD60w22+ZP4iPiAH+z7Vjw0/H9ckP9tidr7+Mwy/sjPvvtLCEr3k2A+/JOFaPFon2T4FD5c+G1BkP6ifuTtWYac+OfHqvh6Pgz5txu89w1eKPvj48T4FUy69IyaAPiJu1j29u70+bu2LPlchNb9ENpM+D5DVvmepIL/GkYs94rwbP+soKz52Kx4+bUcev3dn+z345x29j/pVPrdsJDzp1MG+5xnlvs1OXr4+M8S9Mm9JP06/HD4t0am+avcfveT6OL0p8Qi/lSmGPgYJLD5XMbk+nU9iPl3TFr9pF5S+DxSNvU7ngz45GpU9E2mxvqwTHD+8/RA+jE6QPi0Vcj68p/g+u9nZvbSkcL5BIVC+X/6AvZ30Wb4aF7a6oK4vvpg/Ab/TTVe9/pSavsANgT57zAG+F9Cdvp+I671sapW+SJW1vpT6mz6aSBk/rM/TPSZoHb4Rsga/gTxHPs32Sj4wRAK/opX3veL44r2CcCe9deu7vvDMfT0pSMS9VmcWur/nvr5bpQG+DboCPjN1T76VL9u+tO0oP70oWb5ZDwc/bk3OvrG0qj5OFrE90atZPVv6gD4UHYm+vnXavgyuJL69m5M+/R2MPh7lIj64oo+9vu0Iv/odIz6ZjOq+UV2aPsvRsr7qaZq+0/gNvd3No76CfQI/hgQLv4js8704G1g98KjoPhwohr4mdR+/oieXPvZNXT57JQy/lBsLPeQuZb81o4+96C0Yv6oZ3T3oaH2+tCIKv4XBPr+s7n8+3EgZPmANrD72p8g6qUEcv5hMIb5rNzA/J+cIv4OBFr+OCQs8p1IVv5j1Zz6zH6I9r1CWv+Ygsb6BZie+8+KcvlT3IL65Sfo+WgsyP429/b6XoLQ+EKyEPpVGQj6p9A4/Yu0gv8AGhz7lzxM+X4AhPuWobD5ovny8tsOdPje0Lr99wQC+bPkyvasbYz1KBzI/",
        "sia7vrzVLz8QfEc+0p1ePiN+Cb9PXUm/XpWuPoiAgDwFhPE9hI6YPmOJP7+lfh8+JYsWPucUVz7QBjk/iPuKv/608j6FrC+90IaDvpCJn77C8sc+4QUtvmwAMr7Gmcu+qAojPpsdLb8nEGa/XuWtvn+wwj5D0xE8XjisPYrIFr+hzwq+YUh8PS+8Ej8ymb++Uj9+PN3T777OQgQ/Iyg+PoDGGD+evh0/haarPmtneD5jeAM/oMaXN3wA577qYO2+q0f4PlpCKb4kkBa/YcOWPqV9h77lt8O+olXtPsY6zr67fIc+g8KOPYVLNb82ggg/QKMOP9UGMr+sPXe/AkAKPZWPfj44diA/sA6bPt2d1T1kngo/9HlHPTPhIj+qBas+0FhQPgG5HL36jxC/ZqFmPqw0zD3n/g0/1UymvgJwtb41dL2+rT9bvVJzoT5EKoW/ONGPPshRKD7nCtC+nF8PP5aDQj45nTm/klBfvecm6T7zQJ29cHH9PoyvAb5iWeS+MAvdPmLzrT5v96m+/0a8vqOnAz8RTvC9BGgbvXyQY74fJNS+LNHcPLtrAD9CCoI+1NWzvTEFvj56Lw8/VAb5Pafi5r1rMcA+hi0QvwbFpj6WxTG/1SNZv/48eb55Nxm+Vm+4PCh9BD7aHO4+VGHUPSOFIr5+Kyi+toGUvXxd0D6a9vs+MiCivLcpKT8I7Mu+MX0PvW9pYr21CBq+D2CGPbWwN71ThE6+IHJgPfoBkD0tAao+rGzGvW+HjL7BBzO/HfDDvgbhBj2NiUK+G2iMPihGFr/D/J6+olqDvRnDTr6bCam+XyvoPp/8zD66mVg+/XvTvteG5LxtBgM/4YG8Pmv3bD5BcDu8VlBMvuAJGj5dgMQ+jkI8vVZL+T3a+io+8CklPmCMWz6wXM++idDTPQ+gErxa+O494hSPvlXdXD7Ds24+TgSXPibbpr2mGJm8k/66PqYQAL84gsu+/V/9vuaD2L2fgGA+asiTPLXytz2AC3o+MatMOxr9Iz4MWc6+",
        "XSK3vdSc8z45HLe9w+iUPIjkFL4GSYu+bhowP3EcLj/0Qeg9rQQbPy0d+b413L++VxioPfQIHL5AAYc/71TyvkndSz3JrnI+lKPCveNCz7yoPO09k8okvsFmzb73Bl091YBjPqJViL4nEZ4+BZ26va+RN75UiMy6dkCaviQJ+L4VOQc/tkOwPdOJ5b3q9kw+DF8VP3+2iDzCzB8/Uz3IPiWkFL6oFWS94kYHPyeLlT6D7jk+9IpWPcD96T6MRgC/AFmlPj0Imb5xjYC9mqGZvaLiHb8yi0i+xf6nvUp58T01Zn0+r4IvPW2lCL/yxcI8H0sUvmjC8L7j1uu+r9iuPn0TB7/5Njs+3U+ZPrYXyT6znXq/C3VuvrPf9T4BypK+w91uPh4H2z5XpS8/rzlOvQXkwL433Sa9LjkGvYx8+Ty2uVk/+zuovZtXkbywprS+hm3+vuPJ3r6UQzm9nVy/PlsyYT/kMDO/i5M+vkJFbT3c/JA/SCIhP9CLGz/+AYY9JG4OPyo/5z6W1K69rGK2PtlcKD8Anky+GU3MPmokWb3FDYg+uKTIPuUGgTxQFzC+9yamPpH5WT+gZzk90WAOv579kT+GB6w+Uf4jPxKoCT8kpTg/T4UZP2waEr9wQEi8zV4PPkWxGz81vh4+dLKwPR92Eb7jAbm+9Q+4vkNc+j4fUQu+WwgnvfPukb4h+qA9D6M8voEfL74khJa+RDRYPSDxQr4LzRi8ZA8UPayYer6oVLQ+qdD7ukFkO76vXhQ9czdvPrOhFT9nxNg+lxsnPd/EFT4OIE8/mz90vk9k/T7+iDo/BytGv/0me76v7TG//J1CPYl1br/YycG+nR0mvrRWAj+qEIq/w5m5viEsWb8ERCU/NIGQvS301T1kKdu+0wkHvtCSMj5HWsQ+N7iXPnVdrb0Pqye9kI8pvw0jpT4TSbe9HM6QPdmsyL4ztqU9kxsbPt7YwrqY5SO9EyCGPa9Aib6OqPK+/uS3vCQ/G74nINg+Zw9gv2hHBz8V+1y+",
        "DpoDvgfNNjzrXBe+kmNSPsyTeL41YM69zUwtv8onWL7FLgo+sFtCPoiem745NAw95hmavnJpHD0AQcQ8s4MBPE5KCj3MXZC+FC7EvfA19T7hHDg+d+o+vh4ACT7C5DA+tCumOxipHT6LAeu+WkxmP0mx3D2CxHE+kVMMvt/M2D7l8KO+gtVFvCRCnTw+zVu+KJeAvbFJ/T3DCNU+ozfTPUhO2T3s3YG+k61+PqbIib4A/pY+F3GpPvSe6j23MPu+pvxTPkVGXz+YnWu+kj4HPiyVWb2VCME+8faNvjXqRz12MuE955m1Pb3gOj7gD8i9bs+7vdWfzr7tIuU9mLdBvVdzI79iBVq+v91oPUvE0z6luCG9Z0KiPlMsfb2rnbw+zm5JvvLkBj9AZf++joenPSs8Dz6xzgA/+kNzPvrWlb5W4Oc+2IhYPhe/JDz1aAa9w4aEvG+ok77BGAO/9nNtPjSHrD9HJOK+iSxKPq6sIT+/twQ/H3uvPNXchz4/s4e9CLrtPaONrjwENXq+8D6TPFz3Xz9VI5o+8+HTPp5axr7yhNM9nFxzvh4/f747dgs/vYSVPlaTFD8QU6Q+g0c4vvlyJT/RLBW/fncIvPFx5j62OAC+25IhPwOPIL9oV4M+zZ6QPpP8eD4/HCQ+1TS+PobRND27eV++uqfzvb3s2D5bLgY/UHSpPFpPLD9wJwu+WLKPP8X8wD0bUyg/mSQHP3Lg/j2BVEY8anXIPl4kgz6BCX0/XZ9kvULf9D1IJTc/WNLyvjaQb7/Rzd4+/+eJP3ln8D72EdU+8ZwgPzkosT7xkYY+uZfcPt8aED/M5wo/PLgJPgC4bb7w8sk9eTrfPnOs0r4XONy+Uz9VP6VXHD8Cfqm+U0RXvmzA5T7IsmM+LXGdPQvktT7TrEm9XyHnu3rwvj6X9hK+jsRKvSaGyj4OZMc+MkqGPjKwaL7HijI+eAEjPm9klr4D1Bg+D9U+P/yTVT5AO4S8a56cvpDu9TwacXG+pvlGPkBwUbykEoQ+",
        "TlmVvtdfxT5+OZ0+1ioBviK4lL44Ix+/UODKPfVFuz5Q2jC+weDoPlVA670PCGE+K70iPlNskrwt1wg9vnIHvwhCdz4gHJO+j3cDvtZuJj/7WD+/2IwSvyWrXD5LNeM+m+GzvJsEWL7AT7o91zAxv0A6973DfQG+ynYrvmh4l75UnAc+jiV1PUdvhD4V8Ry/rcqYPmLyjj7ZcwA+8/x7vmLxlTwVbD6/W7v9Pgb+iD5DYFo+eLl3vrIbL70AXsy9mWbzvpJ4l75ok649GWgTvy/zlb28ejw9vIEFv4AQBz4/MSC/Jt5sviGJnD4P5bk9yDWdvvOc3z5Cd6G9/LOgvcYgmz4Z0qK+evLVPl7+ED8TWeE+0EjuvnKRTj5rXTI+tUwZPuGzZb4+aW09rImsvMuwGD2AI3C+s4WyvoMTHT4XQ2W+8x6sPhDO6z4QX5K+OkEzvkfTnD5ViE++RgG4vgypHj2KLpi+Kn/NPiIRB7/N0Xq+dC/ivjWKaD6KC+2+4VbrPsNwSrsd/AK+kfCPvmTXez7jy0k/mnwUv4o2ET12L1k99FEaPCEBAD54Toq+YoFJvXryF75se9S+G/6oviYthj4oKBy/3zAHvq8oo74a2xQ+WSu4vvF1rD6HTdW9iplxvuQG4DyxSCM9pFMav2MlaT5B6y2+pbLkPUFC3r2Obr29GtvuPtP2WT+7SKQ++XjaPjHSPr4hDMk963BzPnKnB79Zjug+JFE3PwRDKj1ZlhA/JQDSvlF/GD9FMps90tuOvgI8YLz7ZQs/mryHP7JrXj038z08SeyUutMYSD9cvFw+g2RePtgBw703qKE+v+InPqnMAb+Powi/1nkAPs2PAb2qiZI+9s4DPyZQob5lQUy+icoIvxia3L014/29fnC+PuTwK76uHx4/c3JqPkKtiLwAiT4/I7Cgvu4dq761WKO92gqWPQv03j1YmLy+zL7jPZlHj76Cnzm9XdKWP/Z6mr9IyBe/1Fcrvs0tyD7pQo8+jXywPi8SkL2guBU/",
        "tMqovh8p4r7UmkA+dzTmPhlh7L6ejDk6db69vVZYnT5e4Fi+WbWXvgM/Ej+37yK/dzuWO51Zjb7Cu2C/ILRHP9bBHz9BXQE+/Zo6Pp0WGL0DXSK/wmGYvltiJr6GZVU/mqyZPtjCIb3CRCW+RDDWPlxgAD+j1lw92lJdP0E6Dj5BrB6+xdSPPCWHGb4fHqI8vKQXv6AyCb9KZ4A93li2vTmiiL8RtE6+d4SoPubBkb5zxNw9Xs7wPog+Vj6CwCg+mX8JP3HuST5sGE4/kvkMPoDqoj1xu0A/ly0Qvp4JJbwD4OU+n4+UvfZzzr2KrBG+MPG3vdib8T4S8gA/pAMXPSKHDD9HZ1W/1RUYvuMWF7+dFqk9acHiPgNRF7/UUVq+gZy5PW/0yr6Tzce+phTHvlR1OT9bQt8+um8pv6TEiLzUMpY+RbMiP9mf/b6uQQC/p9sivhd6RD5jQ0o/RvrKvehHBz+iWjK/S0nGvvOgx77jkZg+rH44v2EHRj57aNo8KzlQvUrMKL8YnZy+jI4Ov4R4o77s8KU9gifNvKtzgL77OBS/QbQkPgo1sb7pyRc9Xehvvpu4Er++V3W87tQpPznOqj4xMJq+urvdvqEvJj5PouM+G7sfvzmWBj4xDmU+zMZyvvcTXz4aodG9QYA4vw9IMT0wNi2/b2CEPjGgSb4C4Cc+8wIzvtYyKL5IxAy9V44SvrfaRj6W3V6+C6CCPnIzwT4udIG+g0v+vZgjxr52TNS++MjJPucgWz2rwI8+m0G5PW1mLz67gei98T40vvt9iT57aKW+aj6lvubUxT7vBLI+qHHPvnI9ubwwIPU9kF9ivIqPoTz5TFu+7phmPvx92r4cZeU7AGYKvu/Ohb76Vy6/Fmu0vd5A67yRUpC8myswvs6ivT1Qyzy+vKprPp6chL4+iN0+VmcEPscEN7zWsiu+qG0pvRiTDb6GlcM+IJGSPhQQcD7nrRm/58Q4vvKlgj16uXY+4Z5avc1wQb46l9G+HN5Wvn22A771kGE+",
        "PCwTP1Niir4gtJc+uYztvD7z3L1ecCk9e+zaPYYPOr7ixLu8OCoJO5Ljcb9dugO9nUMcPka6PD6NkWe/6fHKPtZfVT/M6oo9cUvpvvKNF79UH4q+dexvPZ5sE78dRvC8tBDIvejTZ70vosM+z3MBP/JGWz8QvMY7KNA2PfCGqzwVlJy+L+IBv3stlL6Qp9U98+kTPqTRgr5xRA2+Yp46vgmtSr99cxo/2R8gviL0ij3AiaU+Hy/8vt50pj2JlJc+IEipPkhIPjwkPpK9ejU6vgpYAz6SuLI+rUiwPYesfr1uQ3E/VNSvvY5nnj7U0E48JwUlPlj1e77T9Z49HWgEv8CTiT/JFCE+vPoQP5O58j66maY+LsXyP/vvyT0gyxW/4jB+vs4T1T5eKQY+6flHPzoDUT/phXc+pzY4Pwl2uD7UB1e+0Pp1P+wqrT6JG6E+xPFbvcCChT5fhOe90oZrP3CcVz9Xw8c9bQTwPbadVD8ZeAo/2AO8vl+4Eb7DTf0+X/cRP50bwj3poZc+rAwlvpylmb6ITUw+jet6P9TmGD+yFMA+KJg3PhcWUj8RFr8+VffAvqjYnL1q1a6+HYuvPznWtj6NTO0+WqaqPZuHLj92hqI+Ciwmv6Hzfr6CKoc/CyoUvzfxST7VroE+aIA+P1aSyb4YSK8+CoBcP8F6gT+JSWW9eMpsviiCYz7aSIE+Bjd/v1awpb+iQym+iPX2ve1cLb3XRCS+foibvSPwDD+hjYK9ATEdPredLT/5EuS+FXVQvn6ARL8XCGi/yTrYvjTlvr42Aao8EMeBvcc0zr21h0I+xuOovv7RyT49RU4+JgItPgvZCz8qyZy+/2tVPtKEsTwrPAQ/7V/mPrrQ1j53Ybo+QBPzvlulKj3NEzE+d+4IP4GmGr8KDia/ly5xv9Nxvz2YI1A9BOUnPtS/hb/zl0s/MLg6vo0OH7+LTrK+PGgdP35MkT4/stO+shwTv5yXhj25r/Y+3gt/vnz/Kj0A4qK/ysCCP+XMBD5T5Gw+",
        "JQ5mPZtgCz90EEs+wJRlvpc4kD40uzY+qKwCP8C9577nsxS+QzCbvp3i8Tsztwk+ND9UvwrGTLqGGPw9C93svk0XB797cCk+wSi+vTa33L7uheg9roQtvfCNMb38HdW+RLrOvVk82b6jIYu9h0XwPdp9Db1ao6s+g+6mvQxwjD73g9i9nsWDPWz3t76pOpi+6CZsvbfviT6IXqC9kpQTPiEXRb5e/qy+S4aPPjmYjT0TtrS+6SumvgNRqT4Fxwe+fIFRPnZeEz6wjJg+KFcVv4LcLL6/2cU+15mjuyv+2z2cVLM9NwWHvYB35D3gZaO+M/tPvSvdhD7ZyZM+OTBpPT7+7j5t73Y8i4fyPRG4tDyS8x+/wZUUvoh7uT0RvRq/oMyEvmNKXz+JsTY/lOZyP86osj6j3pW+U/0/P/Bm/r2tknC+s8Y/vuGJub6KqVU+D7HDvpPEIj6hKD6+cq9tPyff9T5GuTQ7bf+lPvAoTT+8Io0+fbrzPoudv72vT6I+OnR8PZuVdD1wfmk/eUlRPqzjEL6HexK/qFlpP/8lYD/UnYs+QisEvk/k2zw0eQq/VRC3vhTvFb1Px2k95+7qPfY5az9B5Ik/uHIrvipdoj5sZmE/oM5NPj0a574l/H0/sbPcvRdmiT28/Cu/KabyvfU5vr2o7BE/jq6xPmpXuj5Md8y+e63wPXSvW7/774e+fK/eviOftr9Hj7k+/hqrPhCMBj8xw6C+HQtUvwpfRL8jYrO+00EQv8memL5ukxW+fLcFP2/POr4aYpi/VyJfv1RWfT2PGgE89E2Lu++ak766Nwm+N1khvxg2dr8N0hS9BPGmvYfeeD7sVu6+Tq0qv0rIzD0WFCc+/Yjavef/mb4rWrO9pCEEv2UjfL6CcwC/Y+1Qvxvy0j4MZqE9JFYAP2N1S77b+Vs9hbEaPWfBnr5NsuW+HKQ4v+t8Db9ZqJi/KpiIPqeFLb/bXIY+VLpOv6atfb1HxJm944lJPpCoP76yr7W+3MffvqVOOL4GypW+",
        "IRULvpenmT6u2yG+NLeZPuboVT9KC2c/lJyjvodIE74yXK4+xeybPQTXN79Y54Y+OTrbvFv6GD+Vvyk+AnoZvqTA0L0mK/29b008u8SiFr2CNu49wCI3vfB+db65Ccw+iVVVvq85pz6jiUM7GOwRP4nFHr+z6W4+vzUVP2kFi75OXL2+JiTcvuUrmb5XumG9x+s4PePl0b0Czxy+pgVvvtB0vr5+yW0/uV38vKQVrz37Xyg+hV1cPbFLsj4FRYq9Q1IFvyeFFr9b15M+ikuIPmRaL7583lS+aLe1vqXmsjwERaw95EunPlWMCz6aTxg/06+fvOIpJb+yARe/E1UjPk1cRj6Jk4i+QQaZPrKQb731Na++rKTXPN1xSb4OH8I6ZaBwPaKiqr72VMW+Ih+wvv2fhj7Tiok9LmNQvTdgsb5TnNA9iPK1PldRJL4kc/q9SoK4vOahJL0NdFG+AHDVvGwEx75JZIO+8wrNPfI+pj5LImC+XlKdvYpKCD64Y6q+tPt1P7Dv5j0UCSK8terJPtvTBT+xtn+98LEvPgsVDjxdL7Q8aw9SP0qvMryhwgy+J9GCPlRyKD7heCK/YXIJPsHZnT2xAce8qiIMv22eMD4Otb6+797TvhlHp70Qke29DOhLPUJ6qj3CMyC/riPpPU6Cvz0IaAc+pb2hvjhNZb65hXu9fnmbPUyrFT4d3ec9dFfQvvwxpr7YuFy+L4XhPkaIiT6YJuq95COEv84xh70vqB0+fyGnvc2EgL4Hzxy+DOctPlnSKb4TiIK+2g71PEVt3j5xeN8+m6F1PkFn+77Nz3y+RkWVPa1Zwz7FuM0+vvgdv+IhBT1aGaS+L7oovEhjBT2Ur7++lMu2vhS0ub5p4D4/5Xj/vRgtML5byEW/ORsaP6ExaTwYcq++w6Tvvu9kMr/VJwc+yFgZvtskO77UhQe/loPRvuy7Kr9Cx7S+cvBevTfuDb9CHpw7LTNXv/QbOr6QGug+xliGvsKPwz1NqBG+4TumPl4mgb+3GSm/",
        "7rVcvuvzDb/Na3A/Sxg6PVE0KT6ytRQ+WIz1PsQgZL6KGBk+pQ+APrqGBj+FaBQ/ztZnP3QdsD0d0zI/pIfsPmkZdb5N6FY+fzu6PouXO7/Rdqs+ghdpP1wjeD7Mbis/jeI3P/uo376L6BM/tbauvhLpEb7SPNM+z4FCv6tzCj/I+uS+JaGVPlmmEj/4bgs/j3d1vv6yuj5D6VQ/DwHOvrLxxD+e3gA+OvVpPgaImL5jxb6+xE4IP+5TUr+ZCF89l7cuvxXNKj/xz16+e/gAPkib0z6x+fu9U8Gwvs1WgT9oAkU+LfySPlujCD/FSCa/TATzPkjzwD+tGQw//1/7PBhNK7wkPOY9DAOkvmnKFT5/OeW+chj6vs4dxb50/yO/068Ev6RJmj3dN2M+CR+Ku2iGr7q3n2q/C2wBPkAtUL6HIvq+OtgYvsQKT75ES0E/m/82PZhFar6UrWE+/tKyvv3Ghz4fXQk/7TeWPc4as77atqU+cBqKvn/xQD87o4o+ARUeO5fgnD0TfYK+1wC+PMsAcz6mX7e9tGrWPtiCkbs/yA4/UotRv3Z8Fb3DIn2+GLOevuARhT7+Uh2/R+E3PQcWQ77VmCO/xGxTve1HC7+tyJo9KkMfP2qXgj5svj2+gnWZPUKL9L3mAgq9EUwpvq3cwL1UaZg+VHSJPrzza73Ik869S3IpvfaHur1SsCE/Ly0JvgzjvbytSN89Pf9cvew+8D2nvC89NVsUv0TxvT7JT4o9oV3ivqcPAT/a/B0+HsU4PpDGAD/ZT6I+FDEtPR1UFD3IKGo+bfK8PmCs3r5jZdw+VeHPPTdver3tNqg9G9s7P+Dd5D56hnY+81xGvk1Htr1wL8i9Qk6PvrbMD7+y6ey+jucKvlbJEz+lI9m+5QQhvmS2fT0iBlc+owL6vezAST5IKQI+ozogvlHAV758jCW+wjbjva/gub5mX7M+NCqzvhhNQT6i0Ya+8IunPa/V9j0P0Qo+NoqzvtdUyTyBmJu+moyLvlu9fb7+gnK+",
        "+fCmPu/Zi74KJdS8nmQJvuoCub6bukm/L36rviz1Mb8KwxA+hEv0PvQ6HD/H86c+AYijvoe6lL+FwxI+dZUdP55EN7+cv6W+t8EvPwizCT/pKBs/xZVZvkbzpz1whH48kP80P2zLvD7chxw/MAqJPdiz/D3GYv096aWMPv5xMz85Gty+AHEJv8U5Bz6vtsQ/16GSPnZX2TxOBb4+ZrpCvwAetj+xEBi/MApgPeKtdL2eX1C/G+rCPpk9S78trd4+IqM0v41jDb9sTbi9U3McvzP/JD8mrKg9nv9qPn9+Xb4gDJu9OrR/Pi2/0b7dUl2+uzOlPk5JWj/bQVS/x26XPbHNoL3tT5W8vb2ZP9Bo2j7hTYE/ntCUvnr7yj3kj9A+9JBGOuEKhj4wDIo/0DSeu91wlz+CwAY/NmmFvtW4Lz8K1bU9gdg0PuxnST6RS5I/+n1lP68YsD3SoXM/0yDAPmKIeD4Wmts8pezRPrhg67zZAto9XbErPrj7m74UBpg+bxSuvqBh3L6+0ko/wGZnP5d14j5MrL89sGwMP3wBZ70UZV8/MQ6hPkmGWj88Wi6/tI5yvoMiWD4dI9u+Dzh3Pq+c275iNB0/jvRGvLPzSz5Kk4u9Fq9avmWUlz5/rh4/gN28vuv/vzxEYy4/W6MDPxcYhj5qwnM+ulnQPkaNBT4a950+AAbMPSQgFb9F584+/af2vtVZl77vnBE+ktrVPlDphb6BMqa+kG3kPpf6Kr7zdwA/ZOOwPUsDY74+Ayu9GMrIPrhvnr5w96Y+giKZPgRpFr75iU++DaU6PhZtkT43A6I+ac6oPUX4FT9r8Kk9XFyOvXAVHL4M/R09R6K3PqoPO76WBnm+lDTMPTLvB798C9q9Ldc2PYNVIz8FNeI+VoKUPWm0dL/hmDM/JiOiPc1ToL5zyhC+ySoDv5/wFj10Bgg+pK/yPYE9hz2pshq/ZvpWv37VDj+aaAC/dku6Pv/3R7/LvLm+naH5vPsMlL4i9SE/oeXjvfXCPL4cG6I+",
        "asD2vZSNJb6kjDG+QfOPPs3XUru/+yK+BhJGPvmBjb6yEG+9vAWUPqIJkb4VVQE+UtUvvZjC7L1Aojg+vFrLPZVyRLugag091bm3PcBCyTzsK9g+U/ZMPrnUgr12nMq9KvpLvaseML6oVC++ax6dvr3xdj7NPsI8EFLuPn4gWb7i6Ty+ugwjvi3yjb5i2Sw9kJ0pvskRRD7ITR29W73SveQUDDrzcsm93Hcmvnslp75WATg+EG1gvrY61TpeZ6s9XYkyPhP9hb5mdle+aDomP6BOlL1Km5a+VHQ7vj6yWb0RIlk967JcPe4Xo70r4P29xTGZvim00z5JGdG9LN/Bvo0IEz4kJLi9DxnLPu6MDz88AMM+/XTCvNRePD6rB9A+eUAbvpg6fzxOdyk/sqGNvTUWoT+uZA0/0kS6vvRdlL4bl5C92peQPLWqAz+3kE8/Bp+DP3Agc71IRzg/5MAAPz3PQD/PNAg/meU2PnleZz4GGkS+7vq6PIujND6Q6Ok+LNBmvnmkpr4AzRs/FVTHPvdzkz0y3so9HpzPPsFvID9h1tI+35N7PMg8aj+rogy9f74qvhloPj7okj++P8C+Pmu3Tr7iFPI+DBCYvv+nO79PsBW/wyqiPjB+5T4PEn4+1uCCvgEdq7zO85k+p1DEPVfw2z7QMJ6+zpWDPqRJhr1OZsw+EyHmviT0MD45GY2+bQIZPz37CD6wyuG9x8osP4kVxz7fg9u9+o5uPtUcSD7tB5U+JKqdPCKflr7yGMM+ZVXzvlKewr5QEBa/NlRIvb5fPz+IaKU+Fj2NPgX/tb7asbC+cxTIvp/kVr7rKhG+XjMhv0WLfb2iA/K+pli/u59IR743Mou9b9yXvmp1yj4Pjx4+8PxIPzD2+r6T2Ci/4jgJP3YjAr8xQJ0+czqovtHcD7/ca1q+L/HVvnEU3T4ywJW/p/Pdvuo1qL7A0nA8mv8FP0rWKr997q4+HMasPuhbor7m+ja+ucPKvXGDdT5rfTS++PI8vViqbT021DS+",
        "PcVtPg6oQj6OHJk9a63QPnbuhj2UlrY9d/sGP/N9u74kCie/SxAxPYWJoj6p7es81XTavXURUD0az2i+HM/BvM+AEz78Iqq+MNnUvsvCCD9PJdI9pSMHPr0JgD5kIc+9K2QEv8hXJD8YIWy+pTpQPswuoD6RAbo+6TYjPnIgHD8oyeo8N8EsPttWzj7Wl7Y+PYBRP6zfxD5hS1I+IoCEP/tU7z2qqgm/leGqPspN+T5FDq0+i+B8vobrHD5dACW+WB8hPyUuer4aNZA/1FJovzZndD5RTXE/D1r1Pj0phr7qKhO+zW+dvtWPOr4ftby9Fwx2voDZND9x7TA+1GxNvgPAvb6IFI6+l3ykvOmaET9cqk6+VNOfvlY4GL3PwAA+ZJ0Xvz4M1r20eDC+1UErvvJ62D1Hf3u9Wj3OvM46Vz5V/70+YfHmvOD+gj7ddp++9AchvgUIBj+apeC+RdTEPDFpg7yImxE+3HECPtXr/jyaohY/6X+FPLTybTxjKZK+c2FEO2yoUT3lvI4+ZTuEvTTqrr6XYrk96V6DPT4XjzxgAzM+nKccvbDSor5QoNk9Fa3Yve8Nk74KDQA96rgDPhennrw6cAi+eeRZvuqFib60Kzm/RjGpvvGFIT1FCTY+8Ca2PpOZwj3lYhi+cC04vqTsHr6T9wQ+wA2zvVLmYT1iVQu9mha3vvTjIz6vmgA+uEnQPq3zgjzgeKA+KunTPpR75T5xTKu8S8DXPuXAY71HyRm/cckivyuZY73NBDI/yU+CvzjIw75yaK0+7uQaPyQ5Bj+tTGC/k6osP9xnCb8wwAW/JyhrP+2EVL9xwcg80pckOoc+uLrro9C+tXqRvf2Tcb6Kuz2+rDy7PXc1HT/7thy+78UTPyCh7L6YO7W9Clh0P/IRA79SFww/kX58PlVeiD1t/Om++0n2PfUuDD/ysje//RPrPIWEHjy3sja+7c8uPplYzL7hfZY+IyDGvswMQL98CVw9AOqAvlNodL4lG4i9yqLOPiZCl75SFIe9",
        "TDBHP3uVOD61bx2+SXOcvgpcjj5FAaw/Fzp8vtA94L2Webo7Kl26PjhLKD5l4zE+we2nPuYGYL5XsRA9ijshvuq75L55FXA/lQs3Paxxnz6fgVQ+Y6mdPpsk0j3kcLU+eLsQvz0e/z7sQw4+JFOvPbo0Lb7i7xW+dKqJvgkqrT6K1k4/4jHBPktLHbyrJCG/Snbsvqq0hz1a8Ec+rHLyPicJlz6cu0s9iu/uPRbFiT5D+E68zfsqv6kU875uDQw/bQNOvlWSLT4mZ2I9NHC/Pa36HL1UAqS9bX46vuPAfL0UMlo+CkgLv6T9Uj4YhB4/fwB/Pop4nj4Y1+89XqHAOcYPSr9meve+dnuLveRCYr6mpku/6TrHvq/8jr4jw+69iJWEPqcFlL5YAMg+QqHGvej4CL/aUlK/Js47Py+jTD6oaSK/YaanvqjD8L5gyyE9PX0IvvXhhT3YOhC+e0k5vTEinb3iMdw98XlQPkUj4rzG1LU9m7zQvlvQUb6SekS+Y4+rvlguQb44mv+9LrkdP0ebkr6VtuC9jccIvuChab7hvtU+J/SPvaY90L7JGEW/VGK4vD7NEb2CnDm/XTONv0vCsb6qVjm+McptvHZMRb/scOg+q9nCPpKiy77wRaS+p2+JvvHOmj7wa9y+6a0CPrJFbb/YGa8++0QLviYWU7z0jdi9ZiZPP5sxN74GhMK+kl+XPgU1lLwDQqk+Ur4lPWjZt753lc8+m8OCPnnEhz5bdaW9WpWqvIErWr9qkTq/eS2UPTD6mb79jbK+DWryvtJDJ74MDl88Z/yPvuTQcD7tCcS9/qerviDFmb25/cm+0LW1vkG9yT3s/nq+5/7CvG74rr573qA+tWHyPgtjYD5ugLk+WvRfPlELTL79GZg7TcUYvkgvmL6jfzI9j2GWPkChQ764bwS/lLrLvdKCiz5M7JC9jxZuvSvU4D52V/y+p2LEO63Fgr10N5U+J1mkPXXQkL2UDFQ8xKa0Pig+y7yCAxG/3NYIPwGbXb5JpGk+",
        "l8+vPoGgiz4y6si+l0QFvgKOHb5S9qi8DGuRvvEJlr9yH8y9OaHwvX92DD/7/6e+U3w7O5w8Nr9qc7A9KgSWvgPk5r2y8p89YYc9PvsJpL7OMNi+s7vavZ9/5D1brIq+0QfQvlFDD75noqc9K3q2PITllL5AZU2+wZiePXQ6YD7fg4U9ZvMPPlNZiz4Q8dS+HAgXv+qYOL/PGEI/JZqfPgTFGr7eNS274C7fvf7Pbb0hiP6+J1/xPT+HBb+4r+2+BxVcvTpOCj9fMqc8R7YUPg3yBT9G3Bm+HefRvlRs5D64R5W+reNBvex/V76igSk/o32JviDfQT+qY8Q+I0iSvscENz50kom+L00Avvno4757zvA8B/6Jvooeur6L9Te/Kr5BvhegqT4s0me/Z+DrPbYnGD/TGKW+bzOFPjOOq75o+EO/RvyHvto1JD0bqqg90oeFPqOkMj9y/jM9XfA3P6PHXL/ey68+XvQVPr15Kb8OB8O/ELAAvSYHib/vfeK+IqDCvoWJA77mTYw+DnqAPozK7rzy94K+THh1Pje3Fbv6r3K+c5sMvyFG1j6W1IS+qRMDPaFRPb6hL5u+NWAmP0I+kL9yvxc+Chktv+FMET7NKJ69rI5WvxkaHj7ImRa+cVKCvxpQlL5Kapq9BxGwvh4QFz/p52g/ajhWvlivW7xRhLe8MFtbPtBSrD7xTBK+3WOtvs9Wc740YTo+Xl7OPjverT69kUS+vjbEPpNv+T0w1pC+DHCRvuiBnj6eU0Y+98EOvniJ3r5Cjqu+ETnGPqWiZ75oByK/F3ODvZslIr+1yqo9b/oDP1pSRD/iIuu+tRqXvqPDCb5osxI/ylmWPeySTL/VWdw+Zx+mPoJWNT88geS+Cx0OvC1UsD0TEt29HJNCP1Krf74pTCm/pYOrve2sjr0Bj+e9x+DBvsjG+r1tW+C+TFsvvmFmgr7Jkfq+joAJvgynij00tFE+Le6svrWXVT+wegc/3w8/vndi/j0xL9O+ZNoWP2Mz7L7rgGo+",
        "g1qtPT56tb7gSra9iqApvT0K171x4bW91f0iP3IgmD2Czwi+90oyPhThrz4z52M+Az8LvlLUTb6Fczi+JERPvlV8nr2pMmU+S7ujvscmr76B0v69BnKWPoNcJb60lYE99SV9vNjImz7rNHM7YNV3votzSb5IGmy+LhaAvrw8Bb7DqMI8Xr43vh0RO75sAFo/RtU+vov8wbx9c+m+wIRkvuhgMz2Mov+34NeGvk9Gdj5EiGk+LwnPvg3glr7luq8++ASQvWz2nb65BzA8G34Pvuyw9L1Q0p6+5srSPglLHr5f94s+P2S0Pf7GfL6IqG4+X1mfvoojnT4fw5Q8/xaNvBN5tD5qtEY+/R0gv4tzqb5dcHK+dQEvv8hDWr5DKpE9IaIfP+o6e77x9lu9XMLEvj6uCT8KjTu+IPTdvgk0oT0f/gm/im2rvg1WrL7fVnG9jwAVvzMGGj9TaT4/Ts+2vld2j72E33A+QqIsP3I1A7/EW4y/LSKIvpaKBb3SXNg8xFiUvs/tCT9VnNA9MDAovpZuML8ARO69w2/ZvflekL4bZPW9MqgSv13/DD/HS4O+0AgkvyL7gT5Dd9K9ioIVvoAh874CJNq8ktepvqoGIL4bglu8pdwav8HV5j685fu+mMOMPpxM7z4kYSy+1Oj/vm4Mvb4VrF8/Udscv3Xrzb72Xai9maOhPkaR2j4l2Ro7VW5Kv4TZgj7Ryw4+2CUUvjL8Mz8kJ2E+bjhov5GLg75Dnvm9w2mMvmXTAr+JEoc8/uOkPitC5r6I6Sw+uJ1AvxKbJLwEx2E+nKAdP/CmHb+mnac+pUUZvpXsAz7Fr5m9Pnw2P5f+br4f9xe+TqCfvfvLDb9FlAy/4i/QPtcYX7xyeHG/afI9Ptrbfr1t/Ny+fT6RP++NTj+aQLA940e7PlVndb6IhU0/+T0zv/AkSL+x9go/mOYAvYzeX705ECe/b7bgPiPJkL4pCYa+K6ruPJLRhT06x+A+nYKXvT9TN7+g4i++y0ZBPiBekr0SeOE9",
        "fqfivlRyWL05M3y+D6svPalO1r1xzqk9pcfOvji+SL+i8uq95VhlPi2RJb8d8Uc/GAQZPhikBT8t9rG+1fKavvBpGD4qGe4+FfI+vxElfb4Tpfc+0dVSPmRSl77O6Is+xlZev7h3uz1tXuO+PKGBPsIbSDybz4G+6OzMvaBZhT7YeAO+MezuPT3CDT4XgrA7hZrEvkNbx766KFG+Gr2NPrNQCL818aq7Itv2vt8zsD2DrMs+ewJXPhk0Vr3woh++NkXbvHz5gz6FpeU95mwnvrw7Oj7v6pm+9M1Bvh3Se7wfebu+ELYeP67Q6z6gFKM+bt77voHvtL2PQbI927WAvvxKij4B008+c3COPpA46T2Gy7a+H2/+PRIrZj0eYhA/wxLrvD1z4b36y4c71wJ0vq1MKbyhhd8+eZlsvdh8Cz5W0EK+sZKqPlEPzDy4rr4+UccTvr5az74Rqek9oY9gvheFszwDsgY/Sa8FPixRSr4jnSY9XOl4PYms2j0Jpr+92JK7PYDYOD7s2x0+58BBPhD32D2KTKS9k9enu1mDHD7K32S+w8HkPifRO71eIyO+mKS4PPf0HL7Obpq+tEpoPTKhgT4B0a697kbAvdsXhb4cmoa+003LvRXw4Lyu5sC+VgAmPLIlj74O2Lq9Ef2CvHn4ED7T2ci+VymKPgWZLT7tKPm+x5rsPMNfRj+xXh++e5h4PbZ+mz4/W5S+jNhCvjZrir6jYL0+xa+4vs2jGz9mwCa/I7XWvvbfbL476x49gnqrvgxtzL17Oi0+uJbovebeSD9QHNU9bq6IviwfEb7gKje/P+gFPkgNgT6dBF4+f1cpP6+hvr1lNxC+6sfnu5Kn977P04e+49vsPuICVr3QQA6/fJ+0vhx+mD7mZ6K+2UVUPh9rsT654uG+WE0yO9NcNLx6Nv8+B5QzvxE/E7+mGYC+4FXWO2TE2j7KX4a+hsfMPkvMCT5u/E2++S5UvuCbu74IRB4/sIrSvsS1N78DcRe9cA3CvkBD57ujAiM/",
        "uNsAPR9N9L2Dqoo9838vv7H0Xb+wNPg+pV2bPkncNr1N3Mq+6qZTv6dzfb8ZK2u+vi+TvwQV375zABM+pB4/v7xnrb1t4YY+U9GZvHplN78myY+/iVXPvnNLC7/soxq/Ub8KPc4tM78MERW/9OWzvWOftLxrP9E+GnWGvpsTcr+6fhI+2BMevFRx+776NQi/5inCvm1mob0k7NW9O218vwkkGL/K12w8XDNJvbZZ3j5ofha9MhKAvoUP+z4EEtA85rjsPl6Bkz4aQbS+jJawPTwloj6bXEy+d+VHvlrA+D5nvKo8mLD2vkP2kT5TNE6+vmUJvlcdJ79CTPs9KW/JPhUY3z7BjJY+q9MrP63igLwm9ko/vlXYPltL677X7w0+kFuSPpncIT/dmxK+37JcP5fHOD42+PE+VzXGvqFdzD3DvEo8IBZGPgnBOz8nQLC+4CetPQxj5z6qZ/S9pbEyPm50DD1nI7U+VsMLPmvlzD4UG4E+arb3vcwShb7Apvw+4zXGPg5QPr4odNI9gzQeP1ZFPD4aRSW9pUkiPa6BFT+vBM0+2WE6O/Q2+764cWU8SF1uPg8vmT7zxmY+3HbGPfx/2z583wi/DY3CPtymlT0tg6A9rP6cvjabJT+EEuq9x9sRP6CeDT/1cPA9DLvHPk22qD3cCTY++FwvPl93/j27NLe7nKqgPiBvRD4oSS0+rAwbvaWRar4pcIo8pwMjPRP1Sz5TCtY+KEF5Phv6d74XVlA+gDlPPl67g75Eg9K+SoXMvs8+8T0ikgI+4Cz3vL4ii76LPxi+hz1GPo6emb6tg0++oxjWPQ0qnj2B+Rg/bGrmvbFn9buP0Ug+XxXFPnNPfD72uKS+CRi6PWVqkzz6fZE+j8mLvva3n71qcAM+j1xFPs4tPD22LEA9aemSPnd5Nz0jeTu+fbt6vuBpKj6/loy+7JgRPmkaKz5mew+/bMR0PgkplL7ZqEO9AgWsvFqEm74q/Zg+eNwzvoyYoz62JzY+kO9PPkrSDb4aQNU9",
        "s/dNPgD+Ab+Ihao+DjTavmQWQr6QriK+Qbolv1xtyb6KASM+uf+EPpToZT67uW0+hwZBv5DZJb6KUDq+MsuRPkNR4ztXJau+1HS1PlwwAb9sw+y+Tgfpvt7DT72HKWc+o8T7vgDnCb/9aE6+JiS8vtnFQj3TR8u76wxevk1nDb+V1p8+5x73vijhkD500rg+69lEvnMax77ah+Y9AZ4hv+8F0L6SXIg+u6Qtvq86Jb62DxG+HHkaP8dj/zzh6AQ91tqCPf0u1L7ATtU94YgwP82tw76rmAw/MoKCvsmHHT93RoS+iJmoPh/aWL5JHZa+NJOgPuKw577+v8O9lrZSP0I49L7U1TM/PaQXPk4npD3xHoe9BQGFvbq/zD7Khgu/lFE4vgtphT92l+C9EqUkP5R/Dj/8bEg+sRAPPjmaR79vLsU9bMgMv3oLLLwg2gy+kgdCPurLab7nI1o+VlfOvEEczL2MZRa/lBm0Pu4LPb84QNo9ZEKgPidFIz9Re4e+EzaDPTMGs73JDi0/ydhxvo4N0D664Oe95xTTPtPIm74i3U8/rPXXPYRskb4t7Bi+EjeeP6YOID+QcxG/ruvwvjv3Xb4ODBs/t4qTviaBjj7mA5++rsDOvTfUCr4FNWu+UzNavzI13L6A2O4+XQIQPxgF175w2Ws+jxg8vwhVkT/fcRc+U5YEPzIgJ7+e2lA+648fvfEXEL+okxA+E4/evg5wYz2R8sS+Kwn9vfR74b5Xd40+lZ7evTPU9L4vXQs/7GfZvpIzWb8z8k0+s0lAvp7LDD7bqpG+tzUOvseddr5gUWU+CCcHv05e1TuQLhi97gmyvPfNi75kKnA+EuU6vrhRhL5q1Qk9yjNVvlBCsj78F+89MMVQvmiT0L7MR5a+EJhYvy3pq75xkmu+UV8Avny3CD4tqL69YLhwvSndUD0F7Wq9FuncPu7Hsz45pla/FTnqvsMxJb8pHoI+6Fkjv6xmsD6GYqo90OiqvzXkb74urFK//r7fPha8A7+JVMm+",
        "rwrtvSQm+D0lTzo/NQq6uxLSWr9qKA6/f9XoPjoLqD5I++e+GLS0PnLPeT9InEi9Ms6fvhD4uj2EFEe/zwQUvtFfvr0w2MK89m57vnSfQj4vNiA+UT41Pn1SHL9GGgu/6VbJvpkfLz95cRq+gSfHPWiuyb4KvCW+ym7sPZrWET4tPze8LMQhPv6OcDz8Ep89rEspvplxOD/JOAK/1Q6pPrfvn743G8m+r2XHPpZGbz7sub4+X9upvke0GL70fy6+IcL7vOHYxD1SysM+AqRJv1TgMD9gJOC+6XedPK2s5j2AnCi+F9GlPT5SzD6zD94+2LOvvmgkID/p3089krShPtSFHr3tuzc/Y5bcvjpH1z383VM/7VZzvkm3+D7BROI9ZsOYvi7pKT7OkWW+9rYMvxwgFT6sLxw/CqQDPtaghj79eGO/jxIiv+xf6L382Qs+aZgJvwIuYL9riDk/lrDIvirO2r6ACgy/7uHdvPh7Bz1ul1q+nWW+PssopT5aVlA+5waUPjLdvz7MM8I+IU8tvyZYgb9W+1U97v4lPcdd670XHgy/WoofviseCz5h/jk/h+jNPnQG3j7CK1y+guwNvxd8ib7kMKk+TiVrvecYCL6nfbO+rK9pvh1A9T2gP9++f2w3P+CJLL63vES/cnaBPlJubr/UfVU8p1o4v+DN1r3Ocic/fvLEO6bT+D6feRG+OwFLPxHZ7714f90+TcRhvfVhyT5raCw+oo8jvvJ5j77v2jw/LwJOvgatmT75m+68kN0ZP6McI79AVK4+W/uEvtdokD2fPpS9g9MOPxJ+Ez/iZoI9KcOzPV9jyb2IeoU+6HO5PkOFyD5cP8i9/8O3PrInbDxO3+a+Du7DPg/6Gz7KJie/kG+NvHR/Az6K4FE+Jk3ZPm7R7j4y6gW+lUcJPqeq9D6KMjU+8MYDP0JGDT8WzdI96mEMP6AtcrymOgi/7bITP/46gr8mnN8+ucX9PiTSuLoFPa4+ubP1vlW9Cb9AUaK+dgJZPkCTOL6VDOQ9",
        "OsV0vjQwGj7q1Js8A+CePvpcvz1haBq/DT1JPm7AsD56YBU/RY1CPiOnjr7wjhk/uMpdPUFjRD4lBMC+9+VOv3Phlr5GwUU+aVZSPpef0z0zArK+GIoTvv9DLL6lPGQ9tFaEvWZibb2ap8M+wr0pv894ob56q2u+ie5WvheGG780L7M9n3SnPshHgr7hOo2+rOP6vjh6Hb7iYxu+NUgLv4tGWb7arFW9nJmnPshfxz6mdKO9FTjIvnrA7D7hKRy/opS1vN5gjr7MfqW9z080vrqfsb1UzQe+iyQfvmhmUD7NTJs+nhVcvk0/uz4itCo/tK0Qv3N6Hr45tBS+k07nvjoSND7cy0W/GEOPPsIepj4ixuM+ET6DvnwFDz4G+LY+7dgEP8Dk5L7VEEy+HDb2vBp8XT5y6Ka9F8J+PS2uiD0ggc49OamEPfEZRT8rZ/g9B2Bmvhj4njy3ZHS98Kgwvk/ORj0omIK+EYTtPhqRKb+ajeq8u/smvlALqz6eZkW/TD73Pq2tAr3/bga+rFlEObFjOb2nrre9pewVPomwWD6H3mI9hX4CP08wsr5EeH6+7pJ0PdNBgr4xOOG+sJa8PDRmTjzKmWC+hI6LvRlmgL4IdOS8NMOrvjlIrT5U3Ly+QyBnPeIvV7xCT/y9xn/FviPcJz78624+VIohPt08Ij4ZsUe+46gCP4c/pz43p3k+DOlAPhDEyb2Nvm2+gisBPni2Qz7hcpg+6bm8PJB8Tj2dv6s+dz+2vs2TbD+2hRu+pEW1PiTOYz5h9DI/yggJPl7Sqj7u4L49DwLYvnSuSD/4b4w+rSxfvsVLAT0G+l0+FfZ8vGB2CL9RIeC+ZKUcvljobz60EP47GLiNPg6glj2r6f28sW1zvim9G77xYty+XezqPnVD4T5/TFU+/1BJP/SuG7+xuD0/HglyvpH5Xz7Jl9A9DtAnPUUf+L7XISa/g4PqPj2IRb9uHAU8gUjlPnv6Nr9+43C+ylrXvIZfirtikrS+uHOoPu3Sir7v5BW9",
        "B068vhN1/j5fFxc+gTL+vZCWBb+WcaI+suzTPoGjkL4D6AO++CPRvLI7QDw93t6+FQkGvzgVAD/WzL4+mE9fPkd+Ij5bZry+z2cjvoIdIr7+FUC/AESTv4BhJb8e1eO+VZtAPQ/hor5zcRy/ZBgxPnmk/j4vB0S+7NjrPpJ9f73HOAw8IEKxvoabD773x/G90EI8PV6Lhz17a4S8fq+bvhg4Yb+mnbU+A6x+vVhVjj9fWwc/JLVlPWrucb2l7Zc+MjkBPxFMHD43I5Q+ZGGGPnJ7AD2L+Kg+BI12vhXlqb6Rd2y+fyGrPOa86L78TGy+6DGLPDpZfL6wi5m+EHSRvSNx2r5cOZy9hPmEPpp/nj6AxiE/dCqbvjTvijwwnFG+rN+XvpvT5L5mQJa+iI3RPbBq2T7NXis+mnQMP3sVwzww4x8+2V1Gvos/VD26kb++Z8+pvo3dCj81MBm/vqJ/PTZAED5kZkK/Vl6Svr3woT7nbwK/mV5avgvCGb+01LS+WTocP+orQL5kTIa++erLvnE5bD8xOxW9j1ARPqo/qT00ZqM9ky1Jvs6TPr93ZJe8og4mPjiggD8RAhg/f+y2vvvGob43xDy+ctmMvX0jBb1Lqog+++MzvxSVFb8Sa2y9A5tyPmwfMT7Erx2+wjEdvbLJLb44vx++GF6lvvu0yr2aO4Y+QWiAPlQY0D49qiu+N/KBPiKG67zroIu+2Lq7vVgDAb6nKZI+4NX0PmFqBT2Uyp++ynxMPka3G76fbx++aTi8PvNhZL4Yehi+lMMyPmD74L50mni+eCxlvdbd5D17tje+JkmOvrQ/QL+hQgo+UX6CvcJryj1fLj8+ZoBpP2PVMz4MbbM+SDHAPqMJkj7ZW94+1F2QPUeQnD5hrGY+tWMrvtbTZL7yKn+9JFdsPhWtj71lpEE+EWTcvnpvuL1BzDa962b6PmPf0L3j/qy+pvDDvUCqKb4rCig+yYsFu+03Z75bZXk+jvWLPpZZTL5qMz8+XEagPi7TBT8nACW8",
        "8MkVv35SgD6gTNc+tL74PvnCfT9CA289VS88vpNUrL6TKBS/iXCcPiG8IL9DQ+o9ilPXPddlaD7qM3o/+W6HPoKSpz6+0Mm9IMv5PosCBL/ejxG/r1TavgU+Vb+xKPQ+oGEmvqDjcb/MGV6/MN/SPrLhfj57vAs/x05Xvmf4hb8fGYY+VBwCPlZSMD69wTk+HInaPn8dHT76RTk/fcWZvlkze7+QiuM8OJwTv+cVBb6PjLU+7gT/Punr3z6esWG+doPevfeikT1q7ri+zk1DvCIFmL3j2Xk/JP9MvtqtgD9k/cq+HCKTuyD0hr1G6nw+woj3Poia8L4tuSK+YAwKP07QvT7Pwki9rhOKP0AvW70WbUi+O2MwPzCslj67P9m+OpZTvrsfNj9TNWM/tyUfP/AlF77wiOo9BUTAPsfFBz70bMc+c8sVPslekb2NuTU+15rvvmxbsz7mYpa99yUGvrVwzz79Mp09mEjKPlIBlb45Pog/W2jcPg+K1L3xkvc91yePvZMBBz9RmoA+0cH9uqI85L4jf+q8aWQaP9Cphz6u2+M9ecKZPeQtij6XKu4+mnOAu18Wzj52bEK/zVGWvQF+aT8QxWE9e3m9vcpboT78fyK+DegpvTaKgL4p5w4/2UFIvv8aub5I10I/KTdlPA9JmT4MPL4+Aq2PPpIF+T7R7S++lnPXvreWcz2HxfK92SiDvtiwEr+HTW6+A3vEvquw/T6hLXU+NY//voFM4L0PE8w+AvQsP7UYNL7J/LM+m4OdvhwVl759uJy+e8ckv1ib0L3uNpa+pgWCvnIGQj4oqLI+AaXvvpAc7j5Izx6/P9AyPsgUnr7gICK/kCdwvsFRhL34cie/tUYhPSiPyr1SlSi+5i0Pv7pdOz4w+TS+/sOyPR4VD7+Ydv2+3nnVvutqAL8XL54+dp+qvtgOzz231ge+rsdbPt/8g77TdSa+6tervGVmyL60GqO+qKbbPfpGr76tNfe89MOxvT42OL9h0gO/ctaOPmRCLL5qGys+",
        "NEVWPO7wpj7+0q8+CeSYPaINIz2YQKE+TUEuPcwjBz8tdu29kdY4vfO5fT6T5RW+9IY/vniNtDxeA7c+SMPgvdu3lL5eMLG9OF2PveuHzLwaTgG+5LWevqrAuz5jD5s9WpMjPJhctD7lpMk99YiUPhNiwr4tFH6+RxLvvbShfD6wtpu+YH7evqVYLz1rhAK9vEIPPvRFsb7GiSw+bueDvnRX0b6O1yO8z2ARPhR5+z2Rrp++QfbYvb1xF75QkEE+W5ykvVHRtD1viLG9i56hvh1NZj6/Z3O+BLnkvMq5cr4btsa+bC3HvnZtnz29jRS/D55+vZzOfL6dD84+TzYzPvq0Nr5tthw+B5sEPzO7xb3inoy+ZjG8PbDygb55HYe+kMddvWEXjj+k65w+V3inPpespbwF6Og9BJovP9RE6D50PPU+DTodv5W8NL0twFa+dvP1vmGV67wlroa/9u7/PSf3g77C2Uu+mV/JPhx9+r4gOvU+qCOhvZkZhjwJL2W/zqpJvhD0Gb61uZM+c48Kvs6HWz3Oi/K+bvElP/Vbxz5Z6ZA+aZC+vS9rsb645iY/8HApPuwuRD8lHhK/+eoQv4gRET9yBTK+3UA1vj5/RD5KaYI970S/vRHI3b541RU/sPh9vtZlx76LhAK+CJ4evxC75z6E+P69I7bevfE9jT93g7u/pyOdvcLIf7+deqO9I744vy7Fy7/E16g+3YHdPRlvIT95Ybu+LwYuv2D+nr5n+D+/Ciuivm0R0b4QQj+/ATO3Pm2Ss7/XQe++pdQzv9WFqz5Tmx+/Bjk2PXLcZr+Fx8e+1SSEvggvQD1xX+i9tH3NPpbmB7+Q32c8wV6Qvtjh5r7BElE+oJ08vx3fXj1riXm/aavoPakQJ77E5P2+PKM/vx/N7D5xP7K/cfC7PgLcDT+SBRq+HuYCPoxpe7/BBx6/kaNXv6srNT5l73u/vQFGvy92AD8/hQ6/VaSavya+kT6fceQ+k6o2vyQ5FL+wf02/YttCvQMLub9evwS/",
        "gOqlO9uJ1b0WWxO/jgjfPbYbAT9hcDk/a/f7u1Lzuj22034+MG68vJSIoD6d3zu+dQKrPQahrDuXSAO9VmgKPw0HkTzmzGs/FIahPYNesT6xOo69fPh+vn0NmD6cYBw+DaQTPrOPR75QNce+55pSPlSJKb4Xt5Y+VgqBP11FBj/C6YG+ZscZv0fUE7+jZbU+hqyOvnmj5j7pH7S+2x1hvmKYFr6zUoA/o7U2P5mfRL/jbDa+3cvVvocv1L2zocY+yuVWv9CwgT4fUsO7K9TPPq5Snz0d462+SnqdPN+fKr5wnk4+Dek0uwCS/b3HTH8+/WE2vw3uAr8cu1I56VCGvYPKBz+avdq+pscSPoA7Oz5hjlq/Vnz3vdsNAb9WJFi9ulEaP7YQ97wMrLG+3Bj1PGHLpjp3w38/vYQ1PumKCT/nMVU+VbUpPzbBxb4HzDO9tU4ovsMzm74F+2G/OWkMPxuBYb38deU+NH6TvMlMf7wI+t6+r0zFvtuhjT3PYHK+eteDPxz5Lz25Kg0+HbjBPdE+Mb60p+K9S1MJPcjmyz0gXTa9GUsKPyDyfj2rqUg+5SBcPo/dfj7aLZW+wyBXPbY1lD7lsDO9jvsrvvNjpj4Ffxo+0hlJPSYZz75ocl6+c2T5PVz7bL2d9Ji+W6kHPsU4DD5an7O+CB4KPh93fb6laHy+oWAjPYXWHr9a3IK9+afhPl7B4T1BRxo/ib7YPjsiuT19b6O+0cKKvmUXl703EkC/uZH/PrIvdj2iSRA/lWddP0QOer58sbS+EhJcPpxplro5Ew2/jmV+PkZ71b65HWC+z1v4vJlVkD4xcQI/gcuLvTZHG74srTo+H9yzvewdez5lpOM+8bPevjfPob2h/gG/iJA1PznBG7xihrm+082ZPKkO+T5p4Ye+Dsk5PqOu8j4NnIa+RK3Qvolxyr6wz62+ugaAv0NjKT/vWnu85AHFPFWk3j04+c+9ZIR1v+LgND+sSgA+s0jbvhQKoz5WN4S/U9OMvs1xDL9mBJa+",
        "ztlyvmAcqLwidZQ+/I+bPsy6oT7wwEO/qHq4vVCLDT+cuEA/Q54svnoxwb2pAzw96nSvPjHUCj4Wyp++nsIcvmbEXL6S066+2TVHPvu6BL8LWQ8/k+y1vd49h76Uv5u9vr+pPVqpR72kQLa9k1K7PTzdBz90zuW9GFsDPk7fcD291Pu+uwPKvaZQEr++wu8+45YtvdvhFD+A+DW/QGabPqckED/pbFc+QmM3vyvwVL5pR/K9g8xSPQ7Vib2XqNO+YKTgvmVXNb946C4903koviZKU74GBjm97AqrvSvRvTw0OIc++A7qvS69Or/NTy2/Lgenvqoeib5XyvK+XZ0EPeYDsz5HCUk/8duhPWg9GD/nXWk+BH0GP/BcJ73BbzG+vo/hvQJEE76sd76+yrwIv+w0Qr4z/Wg+7elAvlbDmr6mT2C+ZtKZvtdvxDuxERI+i+GVPrBaO74R2Di+oY6RPvhmRr4zIBQ+DdV/vhpj074eiIq+VXlzvkll9D7z/oI+fSq3vSk6Gb3ClQ2+PmkRvwbzLj5e18A9tAHpvV2i5r4dB0m/PAeqPijbRT7xBaw95t6fvr9BKT769L4+GRJJvtKaTDySV2o++58RP7PGUj7sqcm9VN2kPbtvjzy636G+bUwdPFC3Yr7lrwu/DXxCPpdboj1aoMy+8UqwvRB15L65VLe8q7PTvvobOj6ko/Y+gC61vWAZSTyV7Jm+6g2GPZoPMj5xhwy9OxfxvVQVa76md28+XYcBPMRDLz+F4ng+WzgcP67dHD6iVCs+ySFbPg5O+rzho8u9fntbv1v2iT6c2CM+CnSVPqkdiT2TSwe9/ORGP30K/73fLhE9O9NTvw/Yiz6YIOs+FEmIPFRg9z3sNuG+eOMQPuR9gz7EzYS+yfqWPhkZRj8cRL+9eIMMvpPmIj3k0DA+jMy8PTKYEb3BTU+8mmigvfPbm76A2Pw+K0iLPtmXSj2vJSs+worUvid9BT76VPi8hZlWvS09mLwT8Vc+q3p3PoIQPb63eS++",
        "p+bJvl/WJz2Lp5k+fhzMPu6tgzzNJYo+76LmPrrqDz+POlu+en83PsUOCL/aJQi/952vvD5mZL7bJ2W9ddG6vRS0pb5cyZe9Vaa6PUqllT5XWAE/JIXYvrfhab0kcaa+OHNwvbH7VT5PAAa/yglIP4UHYD4V8Y6+3wmFvtJcO76ZI4M9LeVxvmSbEb2gPLU9jAqHvtMMpz7gYgy/wwOMvcJZ5j76zYW9zvkpvmwVfj4jTry+UyTlvh+Dlb017EE/SrwxvlYPu74AvS69pOgsv32HaL4jRyS+cibRPDmLEL/V35q+ubU7PuPgA793T0S+SCIov4zhCr/xmCe/1v9Nv4dV5T2vy/0+OA6kP6meYz8KCZc+9R5SPynLlz1DMV++CTgoParwHT8Sj54/q206Pu37Nj/F06U+jC9RPlM2LT8dGZE+BluEP0Huaz/tpoY9LfzVvHL4UD+b0XU+CCgMvCO7hD+rZik+Qq4ovfd+AT+4rzw/X4i8Po9xVz9jLh4/Ps6IPXrDVj4HqZY/bLzbPpAkGz+xmlc/1nN3PuPoAz9Bn6Q/odV6vuIs2j45Z3o+n5/hvkgDej9LRYi96NbzPqOzXj9lAWw/JG6TPni2pT7i4RQ/vK3zPnqHxr3ajIw//p9YvOg4L747pi4/aB/zPahyID3y8Js9kAptPzT5JD+e3UW+nwoCvwQ2zr6bBUO8ZJYDvlE03b1vJUi/txCtvjSoHL67Zx29Xf/Yvvn7TD2V4qU9+PCgPdE+Rr++xyC+VIGKvomLeT7SpnW+T2oNvy1OXz7UVqq8hB8WPvKHYr4c6Rg/tFkiv1wYaT5trTq/CbmpvORiTr+As2m/ABLEvgf7Eb5VkQS/6FPsvsfaT79VzgK+S/03v7Qt8L60Y9k865nUvqbQcL92kzI+z0MmPtPA1L4V7IC+BHAOvw7svD7BxUI9tofKvpktpr1MjDk+73GKvrAxjD5M57u+Eu+MPZUu/r4wBmq+gv/3vssP/r4bbvc9T1TGPC0MyT4yVIS+",
        "8Z+OvgqLHT4AOlg+c6LzPlqKJz/q4GE+9UHAPZyLMDxdhBe90+kCvobThL5nt6q+FNH4vq+8Z75/bx0/eBFFPg5YrD7WJC29j4WoPlh+Yj8TQPM+DzFNPpcuBD8/RCm9YS/IPU8S1z62JHC+WRcRP3/3GD+vkuo+O04ePsqFhD5GVIe+2SJgPn+Nyz27k56+s87xvaf1Ez5GhgU/3t8rvq7aFr4+5Jq+sHd4Pl4jGb9f5iG+SJfpPl+2RT8USQe/yG1+PmijxT3GURS+wMVevm4J773+4Hc+LtSBvaqbDj1hXpK+vz3gvrFv2T3N0+q+MgOGvWhUKr78uhm+XD0vvc1Sqb4bFSa91MVFP4oToD47QNG91CtVP4m/dr52usg+X7nnPO2e7j4vJwE/PvEMPyle6j4zp+Q9P+tHvQhlvD5k+CQ/oWCLPpDtfj/u4oK+VZ5TP8HyXT6uCFq/xtsjPiGAXz/52nM+bRfcvdaEED9imJ4/IaplPh5T8bzbuYS+ymWcvutHK7+keiE/xgciP0bH1D7liGE+qcCmPvRjrD4NUU0/8t21vv9FbD7jFNw+V7lMPbEFHj5njmC+6mg6P1PW1T4+7wY+5ADsvs1HqD3Hrj0/UJICP5RiOb4V4nQ/qXyVvhVgp75oVBM9Xb+Svi+pEz5s6/e+goEJP3NwhD/AdgO9lS23Ps+zNT97QFm+erI0PyewDb5ucLA+SKWZPbxezj6tpUA/lFLuPoegFD5ZRgs/m0HxPuXwGz9A90E+SNveviSmDb9gDpg+72g/vlOR8r5vOZo+3bBVvPZdMT5ESfo+y5LyvkRqQj76tkY9hPY0vRA7kj6Pb9a+8OOIPTTge79AFMm9r21EP8wSPj9j8GY+SAkivXPvkj6WmoC/hfkAP4vKPzsqKGI/trcBPr2cmr0R65g+4rMjvn78qT7xnEm/CxoNP2IWAjnwnNC9XZphPbxnoruRzok9sXCSP2xWI76j+WE9+3EGP9Q8qL6D6hA/18fNvsHPGj9LBXE/",
        "MSumPvZ0KD/Fb7c9oZgsPx+5ET8Vn1++K1iQO0uInr4m1BG/zIDNPY56071h+Iu+j6n5PqMT9T6Av26+YgJrPkF2KT+MaB6+ZRdwPzfeYT5AKNa+TEM3vqKUKL7XT/c93QwjPraE+b23SeI+jp1SvshHGD7aE+e+hzC1Pr58Vb61eVY9++MiPuSu6r3uvUK+c0itPi+Ejr3TLDk+bCJpPyT8vj4NvPe+n5U2vEM3dj90s9U9vTDWvC9TuT4sl3A+SITnPuCRor5fLKE+3Dw6vQtmib97yFM+2gSKPpdGkr7vO/o+j8PjvkZ0s71eZQC/aAz3PkDYMT7nCb6+ec0Tvv28vz2ktNS+rLGaPtTGMj900Cm9rtqWvtFQejwH/FM+8PS8vsQHDL4bILq+pnaEvRJp5r0ooe+9q26xvJtVwD26lry+wdgxPSv1Az9lcCs/OKnjvlAbgT3eO6i9gTfDvkGyG74qVxs9MYbdvifCf76nfcY+fgmJPhnQwD6j8B69WPWpvu9j/r4rpt49N4xDvoGP0r4GQVa9bdYHPs8yP75xbcq96N/dvepz1z32ZqC95hIGvnQFOz4lH2Q9aOHtvnspxT4RLuu93tbjvnXMOj3mv+8+0UYTPj5UW7ydm3q+zpVUvRwxuT7kU+u+r7EgvmLzsD7E+zw8bHlCPlgrGb7tF7g+CIxkvEID9z7RAyS+ULU9vFIfhr/jCtO+C5ipvszukj4uCPE9JIGVPnkCir13CUO+eD+EPt1Esb3Cczw/4zoUPzmXB79CcgU/Dc2XPtZ09D5cP6m+DO6PPJh+xz72gjA8neQWPqtnCj3QPL0+/uAVvgTYKb6gAP2++bk5Pt/fVL4sKB6+lwB/PBHlKD/v5Rc/ezCCPWSBzj2o4Cm/ixlYP7a0Wr7OSTM/iy7yPpb8bL7pbZA+Y6R7vqAw3D5V0iy+m5BQvi1zuL3napC9gJlUOpusUL7kmfw+mJweP6xp/b1Zspq9QHuNvsXe1DyDc1Q/QBidPb9bzr7dUso9",
        "LXsGv5DaAz9xMwm/fhjOPl45LL7KUpC+d3QOvt69oT7tBms/TYBBv3pZmb7Rm8s8mi/EPTKnAz/2DYm+YdlsvoGjFD8RP+a+q6iWPUqWIL9uVBs/HT4Cv6UoYr9GRDG/R/YGv62IRb9ecLM5XhZFvdcQ1j63vxS+JqK1PsQKwL7bQoS+TRmpPom1bb/GMbo+E5GFPmwLBD5HEt++nsWaPdwwxT3WClY+57X1vfszFz+aVJ88LgU0vftcxT5Bpjg+vDWdPYI7vb7aJji+TQmNvhxGBL8Ql1W9hMgPvhC3ir7GTdq9C5Q6P8sP/L5SDJW/lbtFPoLtFr4LjRC/PIAIv5y+Bj3C0lk9iF5+P1Xl/L3GOQU/8V0bP7A1jb07HCW+z2acPohiIb4oaUC+4r9yvotGgD0X7IG9wGcTv3WUzr5diBq+3d2PPnX1xb0jFuq+Y4RqPa5Op71NNi2/oPhJPnnpx772tJe9CG/Uvdd7TLut5w2/gR62Pbk+PL+l9uU9rzwjP0ZP4j6ZoaQ+R9OvvoGw7D0pYR67xsWJPsqIiz4eMX++K9QyvtpCjL3GQgQ/LmFUPm5BjD7l7L4+fH52vLT/0z6xRHw+sHraPtvLjj7STdk+g2WEvrKXP71K34+9kHQ6Ph/G77tJki4+lqqfPuTLgb4NZ00+rvjxvvk7MTwz4R+/tCaQvi0aeT4r/C4+CMZlvvnhPb6mniu/I+8XPuyJIT7e81a+kDagvf1BaL75/wI9UXZtPs3oob6lAGA/s9iKPhaWbDwGl/8+TP8HvXMbU7wuDsm+ljCgPZLtO72AcJw5JspJPjbJPD5YiUo+2punvBHTADycZU0+8kiuvnRbt701VZ09I5+Qvrk0NT6VDve90zz1vgu3uj5X7xa+d7NFPgnxkD7Uduk9Ir/rvnBVl73SGAu+GWc/PnX1J77R+/08HUBrPZ8V0b25/uM+gkNRvT7r8zze8Zw+YYqXPa7isr3i+tQ8oCb/PDHkcL6q2y8/wmt8vYFI7z4KMTO+",
        "PWdkvvtKmz5S5h0/rowmP/BhMT8UC7Q97N4qPQakYz+7Dqg+scM+voGfEr7cJhk+vxszvmboIj4NElK/P5NWPrHXSj7L15u8jPLvPZIPkr0zTzG+IS1Av/WGRL6NwQK/z5F5vreoIL4hSmO+jEcVPfVCNzzFClC9xAlLvtaMIr/YJPs9me/lPs0dHr/xQso+3uSSvjkIRj+ZTUC/2w+rPpyiVT5Zwgo/lP6fvnGcsz5SpQ4+Qh/SvDiWu75aLWU+hBRpvVzjR70t1MY+gXpCPt735D4Cbg6+/f4HP1jcGr3/Tw69JCqYvkingz49eWq+goKGPsTwAL+Svly/d/iGPqjB1TxuKis+GpL1Pogtg75Daxa/CGJAP8uZtz7aaHG/O85EvzxZPT+ldcc+4BBLPvnyVr/evoO+re9IPla9T7/Jf7w+eZI1P+mwC789QQK/Vh3WvaAJDr5hfQ+/foWrPLKwcj5RkDm9ZedgPi9AST6eIf0+Hdtuvp/ehb5s3pk+ayKlPSUPTz6JyIs+DmiAv57TxjyAcRI9EUUbvXPDLb6LtgE9UqK0PTHbvD6wNsK+RmYnvrL7mb2MoFO/fWDBvrtVET4mdYW90Qc0vxjhYz/bg0c+64FWv1DGGr5+oqY+mWFav1rdW707zI4+eTwSv9pQzT2naxo/Ji/KPfa3SD4leCc+qHcHP74qkT6l/zs93+ldvllHCr+2qwK/Wwy/vmEl8T4Za4E/4PCxvnpmlj4mL+s9po9TPiprsD5ZdMI+OdBHvgkOSr6Hzmm9Hm02v9YQuT1H0Qg+DhMfv+HqYD69I/69gcP3vu3jjj5FajE9BeoBvsu/sT1WmlW+3qMAvvyllb4UJzK9Imi0PcbRKD621bc9P/NgvvlZsr1k3JA9ZUmIPnXhW753qzS/lgoHv6A7BL5ppMs+YK6rvk+kg7yK3gc/maPBPrN3XD+eqVI9rgLXvQ8dnT6g1bG+VWIWv1B2bT7vCVW+2DCMvg6l3j1zNxc93o4ZP82CwzzzQT+9",
        "aRmnPmIUjz5+niK+eshXvk1LpD4S3/I+g90CPvp06z6zmrK917p1voNRPj9o0W0+grimvjtEWr4eBd4+zmOwvoVpUr+ap8O+oQFEvpUoK725Cmq+TpgxPbVBDz+Laym9ZvzJvHjavT268cY9A6c0PmEwDj7S8yQ+o7svvMgW1j0Y652+QAtnvpIB0r2rijK+0Z69PRQ+gb6MebW95IOrPn7y7r70EXu+CGk6PSDrED/Gd7I9axRivlzDlL1ScXQ+QIQnPjhwDT4Gu+U+70pmvj+pPL7rdD2+5HAnvv2hYr4LiAu+Varhvpf8BD90J7O+zqAqvsROUb5aHSg+1N8dPdvlBL6X5IU+q/s7vkw1I70Zt/u+egyLvNOteb68efa+RQZ3vu1RXD/mRdY9IEotPv1CHr0Hy9C+D/nEPj42sL6mSmy+5q98vTEVh76bVzy+W0HfvrkDVj1zjjG/kne5vhrszr6aG2m+EpwRPh9iZryFp+s9TyI+vX+1tz4QUKm9QlMMvw0HD77staA+W8QRv+nStr4h4tE8IT+2PmEIcz7c9rK+un0Ev0qI2L6Xrw6/mMMMupxuGz8iKqy+GnA6vxF2+7vWh7e9qPK1vqgYHT8mprK990Omvc3rR78koxc9fYzrvpEZRr21xrq+4kQsv/xHFr0Olug+FpdAPviQRD5cLRQ+UAPivWad5j7GGWW++Nkjvsb6HT+NfR8/vSzFvjg7Nr+M8dU+tfb7PnGaAz/13Tw+PzojvsYboj6ncY29oMg8PqhuMj8NRn0+URyDPmkzCL9rGxY8vsUrv2+dpj3UIBI/FdjpPt3O0j60pkI+90cyP/TNnj74Enm9GhLFPirWkD922Cg9IMM4Pw5fAr//QAY/bpb7PM5Rhz+gW+M+e8oTvfCVVr2WKki/e01zPovV9r5MVgy8hsUaP7WuAD+K0xQ/YtYrP0AjQj4cvUc+g5oiPt/WU76UDZq+jtTNPo6JLD8IyeS+nXFCPz/uBT94upq+v+8vP5y4QT5BC0M/",
        "v+Q0PgiTQr8F1p6+F/+0vqaqTj4lUZa/lLMjPvD5nr0YBxA+sy+XPjI1er5oo6k9Svp9PjQpkD5kwNS+SKfMPlG+W74Cn1E8e0QIPscKaL6ubZG+gw+8vqh5jT5Q71S+bt6VPkVoKb8lJsi+xqOfvh19zT2CS9k+3Y05v43qkL3k7TE7ipdPvZ1urz6JXMg+GNXHPYg2ib1skHs+78sBv8mE4b6fLPe9uX31PJ4GlL6y9KO9mWH3PRv/tD2gzQQ/iDJevjNx0T3mOJy+S/5IPubzOTtQLYS92C6bvJu4Cr4MI2M+NTUMPzVhAr9UAiQ9E5boPTF8rb7IvQM+1XN/PRO5ez5m73o9SACQvqSzLr2E/kq+ZvoAvm4taDzCURc+4LbMPQ1Dk77IKY0+gR8rPgqONL6CC7u+rutyvvM1M75NqBO/PWJ0PTFKFz6naXi9U5gmO5p0HL0mdJK97+gVPWdQ3b37y92+1WstvA8wn7uDdYy+5ES2vhtrt763JX69m/Mmvreffb5OWNm911lbvgmMgT3LLco+zI9SvYI+LT/2NI2+zCYjv9+eBL7odx2+m3gAPmfOQL44ilg+ZrLMPjc2sT3+dc8+jXT4Pq0/cb+bM1g9cnc1vDOWwD3S1Ls99DEkvXfJd7z3dJs+IDTsvEk81D7qcxA+/4aoPvXaLT7+v4o+BZcHvrTIAr59vgy/qXg6PgZ+Cr5eS80+fYQFvx5VSL+pnXc/chkuPxqZMz/Lc9I+SQg/P5v/KD6e8n++6aR8PrhD3T6+aEY9SpA3v/XRRb/CA3Y+xowbv8+urj4tShY/ARoRv+9cAL/YWA0/uIZxPXm9WT9yaT8+54UXvhCZFb5koDU+nAZDP/mQO7+P7R8/GO49v8pCCD+P/pC+9Jcjv6k0q77t/C6/vLopPqBJaj3M9hE/R20HP8k+5T6s4JY+UWz2PoV+D764Sy4/NSHWvQBhpz7loFu8qPkRPwRp3D4xwo2+zPiuvTlJXT3bvM09K4uevERkGz9XWLE+",
        "6LivviajA7zIJJa/O/NYvuqb9b6wa9K+NRUQv8AZGz9iraa+VUYIv7MpuL433SS/7YKyPpD6275kf/S+h0Lmvpyjjb6TIFU+gnKYv+BeOj99Gqg+37v8vQDZEz/vRCC/ZIhlvyrclr64ZRq/BeIZvBxRYb8KtNA9DhiHvThNxr6U8sa+zRpfPURIVT35mdy+OXMvv4J9XL1Efg6/K1oAvjnlyb462za/mJkRP3Wx6L6WjIO/HH1Lv2H/XL9m0he/aO7Rvub92r5Bn3K/iOlmv81TXz7y9nO/Hk49P163Ib4pFaa+oH8TPigWc73pTZk/2KF4vh5eDb9vibo9n0gwv3MmrT4tFwm/HHXWOkpRgb4JfL++6SsEP+HhRD5Amjm+zKCEvd4w9z7xJL69pRb6PoYdeL+nJ/A9LOYevk7h670s/WY9YJkXvmgeIL7FzIe/ReiRPjDMdr7R8n89RlKbPYImRr+wh5M94W+Fvmm1Nj+TrIM+0pVaPmTpnj6rAJi9IW6hvpUlqD19N4M+RY5uPv7ujj5Pq42+75TgviXX1z37BXy9oTRgPuwoFj7kAIK+NnPYPgZusL1SQeM+CyesvaoqUz6Jlom8qktcPgHVkb0D4us+eJ9RvZeiID6dKTo+M5EPv4GmtD5dLtA+soQVPYhQqT7D9rk9DIp/PrA81D5gQ5M9wrRpPvzy7T6ApIy+j+CXPH6Y8D5Ax+u9G12PPpPOt74rNYA+Gn0kPz9ZbL5lp+E9ewI6PsGdNr4YOma+H0NXvhMvIT7TXp89xATcvlV0sz5tQOg+ZtihvUkP8z131H+/rayiPiXVED8KLdu+V7sNv05hsL0eA/m+bnXxvj2mpT5zs2K+9kGGPqhRKj8lAQQ+9BZlvpCwLr/kXJ6+5MkRPqNRJT7suh0+uQbOPe2UljwMMaC+4pKKvbw74T77ILo8eVUzvxbarz13OqI+Wm35PjVlOr8b8JM9cf2rPep3Br1tBwE/OGdZvcHII750lBC/Xks2vlgbDb+JhMk9",
        "zCXYvpN2V79azxC/3Qc4vuvqI7+F+RS+UgHVvkC9Xz67eRm/HWpCv4p+KT8IRQ692wr2vh2c6L62wYe+TKNTvpXSXD6ZPfm+gT8/v4naQL+hc/A88ZsXPl/5hT4cHSU+S98sv87eET8pSdq+UonsvU8Z4b6lh1S+lUZ0vwo1BL/uWgg9BEQ3vwCwSD9oshW/GS8Svo4Kjz4JgY6+jqqRPm1btT5E/FI8kBGUPhS6hru1KcQ91YPgvn7ZsL42HGu/JuMTPG7eUj8cxR6+5AD/vhylpr57t4y/W3ZIPRqflL1gUym/pfoyP6zEMr4Rubs+/Yx6PohP4zyfpEY+nlK0Pklbwr4a3GI/8bbyvlXjID62eei+kfmlvcbynT38LMM+Ri87P3mArr83+K69jPwKvz07o742CbS+5cBtvqk8Y74zmHE/1r24vZ4Ib7+n0+m+W9D1PVcBPr+dUzS/jPHNv5B2lb+p4je9AG0Avkb+/73gGRA/C2ObPjjNJT9ZJ8g9BwSEv2i5Vj24uK+/ZemIPrqcur1HqgY+ZuMwvy46HD29dq09BQQVP1REwr8kuDA+62LOPvD5kT171xG/yEqCvwZdxj7YTDu/YKyoPrqrM7sRkE6/bgbevDFS3b2KU0a/T1SmPp6nCT9NnYy+u/HovsetSr9eIsi+2GacvxWDQr/p+Q49DcJAveKH9jw21CI9MPtFPtAzLz4as4U++dLovorE775mCmq+xfAGP1dQNT7cWL88uCYGv2mnob0C1vg+KGeCviEs9D6Y1709KeeUPsFViD6+Pro+U1eEv1BDZT7/dPy+ocSUv2ZQn744FUo+WOcyvoP9sb4PSha/LoaiPX0IED+YJBG/nXMqvscWjb6VMiU/icIJvsnBmTzrATG/U1OMPqoiSb7Yaoe+H5W2vm0cxz2xnyU/SL8ZPg0FgD9nVa49EFMsP4YiHD9SJde+XHmSvgVuIr8mqcO+YeJOvXVRPT/GKoS+bKnYvtFwj75pEzq/+bAZvYVQ3b3YsHu+",
        "W3Mkv8F+FT4s7uw+ro6RPkp0w752nQQ/W9LKvfUzJj8331G+fnrcPc+gZT8ZNsO+D59tPvObiT2zzOM9vwpBPwJ2oz75SzS+kseZvM5S7jtA+oy9lK0PvtFYjL4SOhU/PW9LvGClIz+4vsI8Nl8gPXX4677a8wS/LVcJPu96Qr7QNge/hlW5Pmjc4D0CxXI+BPjVPvp1DL/O9249eDA6PcjZAD+rJXA+aBRdvqHRKj/vxTS+yNNbvtAVyb2qRTc+NFOfPZELUj4AyEw95K8bP1qG7z3lVOW+/xOcPhh7Xj4JHpk9jqyCPIU2FT0OSZ4+rELDPRB0Nj7MMIm+xjl5vLCCsL7ZbR8/EgmXvuU8YD+m2zI+WU+uPkNetT5Wcvc+wRYMvp4i+z0voY49BN8hv00WRb9l+W8+6LpSPr9Jmj6mF5Y/IN9Rvh7sSr4sTbw9ZjY1PvOGML+zP0i/33lbv8HdJb/a+b+6BQOGvuqSlr42IUs+FR6YPoG5iz4Wp4C/BhwTv1Cob76zrC+/OEKhPrRrP74DogA/RvZcvqaWvT1dziu8WZCVPzXgLb80nFy+bGaYP/iTuT7uFma/cDXbvo0Dlz7v/Jm+7z1oP4kxEb3KJqc9MyX+PJxmzL6cLZQ9tw5IP/zww7y9jjS/3YhTv/+LMb7cNa++4yczv2c1Ejyxzxi/Skb/Pjjacr56xq0+Qr8Evm+S/b7FyDu/9XY/vdVNwb5sTws+8LZNPUr4pL/Tt1Q8B/PCvZXRBD9P0ho/Ei2IP6Dghr8HVFe/tqXEvYZ4AL/BYqy/xTzHvsGS8r56a1k9a8O9PeioS751cuC9+xV1P05Acr6g9SG+TqBJvtrvkL8Ajm8+8w8av/l+Vj1kgpG++2p/PfAUh77i9qS9J8QivnIV2T5Zwiq/SIjAPl1daT8MsCo+TWbZvgPyH789kGg9xzKjv3KE0j5U1Qi/SAB5Ps6bfz6GEQu/b8gXv2tqjb7c9uQ/M3g+vwKIXL7d1+++Qu/BvHGDT7/6A1i+",
